#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область РаботаСоСтабильнымиПериодыми

Функция ИзменяемыеПараметрыРасчета() Экспорт
	
	ИзменяемыеПараметрыРасчета = Новый Соответствие; 
	
	ИзменяемыеПараметры = Новый Массив;
	ИзменяемыеПараметры.Добавить("СрокПоверкиИстек");
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
		
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриборыУчетаСИстекшимСрокомПоверки(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "ПроверятьТаблицуОснование", Истина) Тогда 
		Если Схема = Неопределено Тогда
			РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора, "ДействующиеПриборыУчетаПомещения"); 
		Иначе		
			ЕстьПриборыДействующихТочек 		= Ложь;	
			Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
				Если яПакет.ТаблицаДляПомещения  = "ДействующиеПриборыУчетаПомещения" Тогда
					ЕстьПриборыДействующихТочек = Истина;
					Прервать;
				КонецЕсли;		
			КонецЦикла;
			
			Если НЕ ЕстьПриборыДействующихТочек Тогда
				РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора, "ДействующиеПриборыУчетаПомещения");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение, "&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки() Экспорт
	
	Текст  =
		"ВЫБРАТЬ
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.Организация КАК Организация,
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.Район КАК Район,
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ДатаПоверки КАК ДатаПоверки,
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ДатаИстеченияПоверки КАК ДатаИстеченияПоверки
		|ПОМЕСТИТЬ ДатыПоверокДействующихПриборовУчета
		|ИЗ
		|	РегистрСведений.энргПриборыУчетаСИстекшимСрокомПоверки.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения, ПриборУчета) В
		|				(ВЫБРАТЬ
		|					ДействующиеПриборыУчетаПомещения.Организация,
		|					ДействующиеПриборыУчетаПомещения.Район,
		|					ДействующиеПриборыУчетаПомещения.КлючПомещения,
		|					ДействующиеПриборыУчетаПомещения.ПриборУчета
		|				ИЗ
		|					ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения)) КАК энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних
		|ГДЕ
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ПоверкаВыполнена = ЛОЖЬ";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли