
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	// ОТЭК, 21.05.2020, 000202897.	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для каждого стр из Объект.Жильцы Цикл
		Если НЕ ЗначениеЗаполнено(стр.ЛьготнаяКатегория) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + стр.НомерСтроки + " не заполнена категория субсисдии!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
	
	// ОТЭК, 21.05.2020, 000202897.
	Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	
	// ОТЭК, 21.05.2020, 000204429.	
	Объект.Абонент = ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	// ОТЭК, 21.05.2020, 000202897.	
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда								
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);			
		отэкОбновитьСписокЖильцов();
	Иначе	
		Объект.Жильцы.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 21.05.2020, 000202897.
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, Объект.Организация, Объект.Район,, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ОТЭК, 21.05.2020, 000202897.
&НаСервере
Процедура отэкОбновитьСписокЖильцов()
	Объект.Жильцы.Загрузить(ПолучитьСписокЖильцовАбонента());
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЖильцовАбонента()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("КлючПомещения", 		Объект.Абонент.КлючПомещения);
	Запрос.Текст = "ВЫБРАТЬ
	|	энргПроживаниеЖильцовСрезПоследних.Жилец КАК Жилец
	|ИЗ
	|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК энргПроживаниеЖильцовСрезПоследних
	|ГДЕ
	|	энргПроживаниеЖильцовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.Регистрация)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПроживаниеЖильцовСрезПоследних.Жилец";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЖильцыЖилецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СписокЖильцов = ПолучитьСписокЖильцовАбонента();
	//
	//энргПользовательскийВводКлиент.НачалоВыбораЖильца(Элемент, СписокЖильцов, СтандартнаяОбработка);
	
	// ОТЭК, 21.05.2020, 000202897.
	энргПользовательскийВводКлиент.отэкНачалоВыбораЖильца(Элемент, ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ФизЛицо"), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"Жильцы");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры             

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры
