#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет техническую возможность установки ПУ точек учета.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТехническаяВозможностьУстановкиПУТочекУчета(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
		КонецЕсли;
	КонецЕсли; 	
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТехническаяВозможностьУстановкиПУТочекУчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];	
	
	//Если ПараметрыОтбора.Свойство("Граница") Тогда
	//	ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Граница"].ИмяПараметра));
	//ИначеЕсли НЕ ПараметрыОтбора.Свойство("Период") Тогда
	//	ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("");
	//ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
	//	ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра)); 	
	//КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Граница") И Не ПустаяСтрока(ПараметрыОтбора["Граница"].ИмяПараметра) Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Граница"].ИмяПараметра);
	ИначеЕсли ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора["Период"].ИмяПараметра) Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);
	КонецЕсли;
	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 						= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор				= "энргАктивностьТочекУчета";
		ДоступныеПараметры 			= "Организация, Район, КлючПомещения, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТехническаяВозможностьУстановкиПУТочекУчета()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.Организация КАК Организация,
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.Район КАК Район,
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргТехническаяВозможностьУстановкиПУСрезПоследних.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
	|ИЗ
	|	РегистрСведений.энргТехническаяВозможностьУстановкиПУ.СрезПоследних(
	|			,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочки.Организация,
	|					ДействующиеТочки.Район,
	|					ДействующиеТочки.КлючПомещения,
	|					ДействующиеТочки.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочки КАК ДействующиеТочки)) КАК энргТехническаяВозможностьУстановкиПУСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли