
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ЦеноваяКатегория, ТипТарифа, ЗначениеСкидки, ТарифнаяСетка");
	УстановитьСвойстваЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТарифаПриИзменении(Элемент)
	УстановитьСвойстваЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

&НаСервере
Функция ПолучитьРезультат()
	СтруктураЗаполнения = Новый Структура("ТипТарифа, ТарифнаяСетка, ЦеноваяКатегория, ЗначениеСкидки");
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ЭтотОбъект);	
	Возврат Новый Структура("РезультатДанные", СтруктураЗаполнения);
КонецФункции

&НаСервере
Процедура УстановитьСвойстваЭлементов()
	ФиксированныйТариф = ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ФиксированныйТариф;
	ПустойТариф = ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ПустаяСсылка();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТарифнаяСетка", "Видимость", ФиксированныйТариф И Не ПустойТариф); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЦеноваяКатегория", "Видимость", Не ФиксированныйТариф);
	Если ФиксированныйТариф Тогда
		ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ПустаяСсылка();
	Иначе
		ТарифнаяСетка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бестТарифныеСетки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
