#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующие приборы учета помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыТочекУчета.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочек"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыДействующихТочек" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыТочекУчета.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочек");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеПриборыУчетаПомещения());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, ТочкаУчета, ПриборУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить( "ПриборУчета, ПриборВведен, ДатаСостоянияПрибора");
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
		
	Возврат ИзменяемыеПараметрыРасчета;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает данные для проведения по стабильным периодам.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам() Экспорт 
	
КонецПроцедуры

#Область ГИСЖКХ

// Заполняет схему действующие приборы моменты времени.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуДействующиеПриборыМоментыВремени(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеПриборыМоментыВремени());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
	ОператорыВыбора  						= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы;
	ОсновнойОператор 						= ОператорыВыбора[0];
	ЕстьВременнаяТаблица					= Ложь;
	ПоляВременных 							= Новый Соответствие;
	ДоступныеПоляОтбора 					= "Организация,Район,КлючПомещения,ТочкаУчета,ПриборУчета";	 
	ИменаВременныхТаблиц 					= Новый Массив;
	ДоступныеПоляСоединений 				= СтрРазделить("Организация,Район,КлючПомещения,ТочкаУчета,ПриборУчета",",");
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ПараметрыВТ 						= ПараметрыОтбора.ПараметрыВТ;
		Для Индекс = 0 По ПараметрыВТ.ВГРаница() Цикл
			ОписаниеПараметра 				= ПараметрыВТ[Индекс];
			Если ОписаниеПараметра.ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Для Каждого КлючЗначение Из ОписаниеПараметра.СоотвествиеПолей Цикл
					Если ДоступныеПоляСоединений.Найти(КлючЗначение.Ключ) = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					ЕстьВременнаяТаблица 	= Истина;
					ИндексВременной 		= ИменаВременныхТаблиц.Найти(ОписаниеПараметра.ТаблицаИсточник);
					Если ИндексВременной = Неопределено Тогда
						ИменаВременныхТаблиц.Добавить(ОписаниеПараметра.ТаблицаИсточник);
						ПоляВременных.Вставить(ОписаниеПараметра.ТаблицаИсточник, Новый Массив);									 
					КонецЕсли;
					ПоляВременных[ОписаниеПараметра.ТаблицаИсточник].Добавить(КлючЗначение);
				КонецЦикла;				
			ИначеЕсли ОписаниеПараметра.ТипПараметра = "ТипПараметраРавно" Тогда
				врПараметры 				= Новый Массив;
				врПараметры.Добавить(ОписаниеПараметра);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОсновнойОператор.Отбор, "СостояниеПриборовУчетаАбонента", врПараметры, ДоступныеПоляОтбора);
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	Если ЕстьВременнаяТаблица Тогда 		
		Для Индекс = 0 По ИменаВременныхТаблиц.ВГраница() Цикл
			НовыйИсточник 					= ОсновнойОператор.Источники.Добавить(ИменаВременныхТаблиц[Индекс]);			
			УсловиеСоединения 				= Новый Массив;
			СоотвествиеПолей 				= ПоляВременных[ИменаВременныхТаблиц[Индекс]];
			Для Каждого КлючЗначение Из СоотвествиеПолей Цикл
				Если ДоступныеПоляСоединений.Найти(КлючЗначение.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				УсловиеСоединения.Добавить(СтрШаблон("СостояниеПриборовУчетаАбонента.%1 = %2.%3", КлючЗначение.Ключ, ИменаВременныхТаблиц[Индекс], КлючЗначение.Значение));
			КонецЦикла;
			УсловиеСоединения.Добавить(СтрШаблон(
			"ВЫБОР 
			|	КОГДА СостояниеПриборовУчетаАбонента.Период < %1.Период
			|		ТОГДА ИСТИНА
			|	КОГДА СостояниеПриборовУчетаАбонента.Период = %1.Период
			|		ТОГДА СостояниеПриборовУчетаАбонента.Регистратор < %1.Регистратор
			|	ИНАЧЕ ЛОЖЬ
			|КОНЕЦ", ИменаВременныхТаблиц[Индекс]));
			ОсновнойОператор.Источники[0].Соединения.Добавить(ИменаВременныхТаблиц[Индекс],СтрСоединить(УсловиеСоединения,Символы.ПС + " И ")); 
			НовоеСоединение 				= ОсновнойОператор.Источники[0].Соединения[ОсновнойОператор.Источники[0].Соединения.Количество() -1];
			НовоеСоединение.ТипСоединения 	= ТипСоединенияСхемыЗапроса.Внутреннее;			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеПриборыУчетаПомещения()
	
	Текст  =
		"ВЫБРАТЬ
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация КАК Организация,
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район КАК Район,
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета КАК ПриборУчета
		|ПОМЕСТИТЬ ВведенныеПриборы
		|ИЗ
		|	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения, ТочкаУчета, ПриборУчета) В
		|				(ВЫБРАТЬ
		|					ПриборыДействующихТочек.Организация,
		|					ПриборыДействующихТочек.Район,
		|					ПриборыДействующихТочек.КлючПомещения,
		|					ПриборыДействующихТочек.ТочкаУчета,
		|					ПриборыДействующихТочек.ПриборУчета
		|				ИЗ
		|					ПриборыДействующихТочек КАК ПриборыДействующихТочек)) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
		|ГДЕ
		|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДействующиеПриборыМоментыВремени()
	
	Текст  =
	"ВЫБРАТЬ
	|	СостояниеПриборовУчетаАбонента.Организация КАК Организация,
	|	СостояниеПриборовУчетаАбонента.Район КАК Район,
	|	СостояниеПриборовУчетаАбонента.КлючПомещения КАК КлючПомещения,
	|	СостояниеПриборовУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеПриборовУчетаАбонента.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(СостояниеПриборовУчетаАбонента.Регистратор) КАК Регистратор,
	|		СостояниеПриборовУчетаАбонента.Период КАК Период,
	|		СостояниеПриборовУчетаАбонента.Организация КАК Организация,
	|		СостояниеПриборовУчетаАбонента.Район КАК Район,
	|		СостояниеПриборовУчетаАбонента.КлючПомещения КАК КлючПомещения,
	|		СостояниеПриборовУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеПриборовУчетаАбонента.ПриборУчета КАК ПриборУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(СостояниеПриборовУчетаАбонента.Период) КАК Период,
	|			СостояниеПриборовУчетаАбонента.Организация КАК Организация,
	|			СостояниеПриборовУчетаАбонента.Район КАК Район,
	|			СостояниеПриборовУчетаАбонента.КлючПомещения КАК КлючПомещения,
	|			СостояниеПриборовУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
	|			СостояниеПриборовУчетаАбонента.ПриборУчета КАК ПриборУчета
	|		ИЗ
	|			РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК СостояниеПриборовУчетаАбонента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостояниеПриборовУчетаАбонента.Организация,
	|			СостояниеПриборовУчетаАбонента.Район,
	|			СостояниеПриборовУчетаАбонента.КлючПомещения,
	|			СостояниеПриборовУчетаАбонента.ТочкаУчета,
	|			СостояниеПриборовУчетаАбонента.ПриборУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК СостояниеПриборовУчетаАбонента
	|			ПО ВложенныйЗапрос.Организация = СостояниеПриборовУчетаАбонента.Организация
	|				И ВложенныйЗапрос.Район = СостояниеПриборовУчетаАбонента.Район
	|				И ВложенныйЗапрос.КлючПомещения = СостояниеПриборовУчетаАбонента.КлючПомещения
	|				И ВложенныйЗапрос.ТочкаУчета = СостояниеПриборовУчетаАбонента.ТочкаУчета
	|				И ВложенныйЗапрос.ПриборУчета = СостояниеПриборовУчетаАбонента.ПриборУчета
	|				И ВложенныйЗапрос.Период = СостояниеПриборовУчетаАбонента.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СостояниеПриборовУчетаАбонента.Период,
	|		СостояниеПриборовУчетаАбонента.Организация,
	|		СостояниеПриборовУчетаАбонента.Район,
	|		СостояниеПриборовУчетаАбонента.КлючПомещения,
	|		СостояниеПриборовУчетаАбонента.ТочкаУчета,
	|		СостояниеПриборовУчетаАбонента.ПриборУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК СостояниеПриборовУчетаАбонента
	|		ПО ВложенныйЗапрос.Организация = СостояниеПриборовУчетаАбонента.Организация
	|			И ВложенныйЗапрос.Район = СостояниеПриборовУчетаАбонента.Район
	|			И ВложенныйЗапрос.КлючПомещения = СостояниеПриборовУчетаАбонента.КлючПомещения
	|			И ВложенныйЗапрос.ТочкаУчета = СостояниеПриборовУчетаАбонента.ТочкаУчета
	|			И ВложенныйЗапрос.ПриборУчета = СостояниеПриборовУчетаАбонента.ПриборУчета
	|			И ВложенныйЗапрос.Период = СостояниеПриборовУчетаАбонента.Период
	|			И ВложенныйЗапрос.Регистратор = СостояниеПриборовУчетаАбонента.Регистратор
	|			И (СостояниеПриборовУчетаАбонента.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод))";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли