
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСУслугами(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("гжшфГИСЖКХШаблоныФЛ") Тогда
		гжшфОбменСГИСМодуль = ОбщегоНазначения.ОбщийМодуль("гжшфОбменСГИС");
		гжшфОбменСГИСМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли; 
	
	ЗаполнитьДокумент = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент; 
	КонецЕсли;
	
	Если ЗаполнитьДокумент И Параметры.Свойство("ДанныеДляЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ДанныеДляЗаполнения);
        энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент, Объект);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.КлючПомещения) И ЗаполнитьДокумент тогда
		Если не ЗначениеЗаполнено(Объект.Дата) тогда
			Объект.Дата 							= ТекущаяДата(); 		
		КонецЕсли;
		ЗаполнитьПриборыУчетаСервер();
	КонецЕсли; 
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗначениеСвойства = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПричинаОграничения", "Видимость", ЗначениеСвойства);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления") Тогда
		НовыйПараметр = Новый ПараметрВыбора("ТочкиОРП", Истина);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоныТочкаУчета.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;                                                                                
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ ПоказанияЗависимыхТочекУчетаЗаполненны() Тогда 			
			Отказ 										= Истина;
			Элементы.СтраницаПриборыУчета.Видимость 	= Истина; 		
			Элементы.ГруппаСтранцицы.ТекущаяСтраница 	= Элементы.СтраницаПриборыУчета; 			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У абонента обнаружены точки учета с установленными приборами учета участвующие в формуле, укажите показания этих приборов учета");
		КонецЕсли;  	
	КонецЕсли;
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
		энргРаботаСПериодомДействия.ЗаполнитьДанныеУстановкиФормулы(ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	
	Если ДопСвойства.свойство("ДанныеДляФормулы") тогда
		ДанныеДляФормулы = ДопСвойства.ДанныеДляФормулы;		 
	иначе
		ДанныеДляФормулы = Неопределено;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("гжшфГИСЖКХШаблоныФЛ") Тогда
		гжшфОбменСГИСМодуль = ОбщегоНазначения.ОбщийМодуль("гжшфОбменСГИС");
		гжшфОбменСГИСМодуль.ПослеЗаписиНаСервере(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ЕстьРасчетныеТочки = ПроверитьТочкиУчетаВРСРасчетныеФормулы();
		Если ЕстьРасчетныеТочки Тогда
			ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияУстановкиФормулы",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"В списке присутствуют принимающие участие в расчетах точки учета! Открыть документ установки формулы расчета?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияУстановкиФормулы(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаУстановкаФормулыРасчета(ДанныеДляФормулы);
		иначе
			ДанныеДляФормулы = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОперацияСУслугами",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	Иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли; 
	
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры 

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли; 	
	
	ЗаполнитьПриборыУчетаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	
	ТекущаяСтрока 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущаяСтрока;
	ЗаполнитьПриборыУчетаСервер(ТекущаяСтрока);
		
КонецПроцедуры

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	// энргРаботаСПоставщиками }
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма, ДополнительныеПараметры.ТекущиеДанные);
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);
			
			ТаблицыФормы = Новый Массив;	
			ТаблицыФормы.Добавить("ШкалыПриборовУчета");
			
			ТаблицыФормыВторогоУровня = Новый Массив;
			ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
			
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)     
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления")
		    ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления")
			ИЛИ  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги") Тогда
		Отказ = Истина;  
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки, Неопределено, "ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ПроверкаУдаленияСтроки(ДопПараметры);	// энргРаботаСПоставщиками }
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ПроверкаУдаленияСтроки(ДопПараметры);	// энргРаботаСПоставщиками }
КонецПроцедуры

#Область СобытияТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ) 
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления")
		    ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления")
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги") Тогда
		Отказ = Истина;  
	КонецЕсли;  
	
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ОбновитьПоказанияТУ(Команда) 	
	ЗаполнитьПриборыУчетаСервер();	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено)
	
	ТочкаУчета  									= Неопределено;
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
		Объект.ТочкиУчета.Очистить();
	Иначе
		СтрокаТочкиУчета  							= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
		ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
		СтрокиШкал  								= Объект.ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
			СтрокиПоказаний 						= Объект.ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла; 		
	КонецЕсли;

	Если Объект.ВидОперации = Перечисления.энргВидыОпераций.ПустаяСсылка() Тогда
		Возврат;
	ИначеЕсли Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления Тогда
		Результат = Обработки.энргСостояниеТочекУчетаМенеджер.ТочкиОРПиИхПриборы(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета);
	ИначеЕсли Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги Тогда
		Результат = Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета,Новый Структура("ВключаяОРП", Истина));
	Иначе 		
		Результат = Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета,Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	КонецЕсли;

	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			иначе 				
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 			= Выборка.ПриборУчета;	
			//СтрокаТочкиУчета.Поставщик 				= Выборка.Поставщик;
			СтрокаТочкиУчета.ДатаПоверкиСчетчика 	= Выборка.ДатаПоверки;
			СтрокаТочкиУчета.ЭтоСоставнаяУслуга 	= Выборка.СоставнаяУслуга;
			Если Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления Тогда
				Если СтрокаТочкиУчета.ЭтоСоставнаяУслуга Тогда 
					Для Каждого ТекУслуга Из Выборка.Услуга.СоставляющиеУслуг Цикл
						СтрокаУслуги  				= Объект.ПоставщикиСоставныхУслуг.Добавить();
						СтрокаУслуги.IDСтроки 		= IDСтрокиТочки;
						СтрокаУслуги.ЧастьСоставнойУслуги	= ТекУслуга.Услуга;
						СтрокаУслуги.Поставщик = ВернутьПоставщикаУслуги(ТекУслуга.Услуга, Выборка.ТочкаУчета, Объект.Организация, Объект.Дата, Объект.Район, Объект.КлючПомещения);
					КонецЦикла;
				иначе 
					СтрокаТочкиУчета.Поставщик = ВернутьПоставщикаУслуги(Выборка.Услуга, Выборка.ТочкаУчета, Объект.Организация, Объект.Дата, Объект.Район, Объект.КлючПомещения);
				КонецЕсли;
			иначе 
				СтрокаТочкиУчета.Поставщик = Выборка.Поставщик;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла;
	
	ДатаЗаполненияПоказаний = ?(Объект.ДатаФактическогоСобытия = Дата(1,1,1), Объект.Дата, Объект.ДатаФактическогоСобытия); 
	
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения, ДатаЗаполненияПоказаний, ПриборыДляОтклоненияПоказаний.Выгрузить());
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	Если Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления Тогда
		ОбновитьДанныеНаГраницуДокумента();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьПоставщикаУслуги(Услуга, ТочкаУчета, Организация, Дата, Район, КлючПомещения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПоставщикиУслугАбонентаСрезПоследних.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрСведений.энргПоставщикиУслугАбонента.СрезПоследних(
	|			&Дата,
	|			КлючПомещения = &КлючПомещения
	|				И Организация = &Организация
	|				И Район = &Район
	|				И Услуга = &Услуга
	|				И ТочкаУчета = &ТочкаУчета ) КАК энргПоставщикиУслугАбонентаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Поставщик;
	КонецЦикла;	
КонецФункции

&НаСервере
Функция ПроверитьТочкиУчетаВРСРасчетныеФормулы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	энргОперацияСУслугамиТочкиУчета.ТочкаУчета
	|ПОМЕСТИТЬ ВрТ
	|ИЗ
	|	Документ.энргОперацияСУслугами.ТочкиУчета КАК энргОперацияСУслугамиТочкиУчета
	|ГДЕ
	|	энргОперацияСУслугамиТочкиУчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОперацияСУслугамиТочкиУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка, ЛОЖЬ) КАК Рассчитываемая
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник, ЛОЖЬ)
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия,Объект.Дата));
	Запрос.УстановитьПараметр("ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПоказанияЗависимыхТочекУчетаЗаполненны()
	
	Отказ 						= Ложь;
	
	// Если отключаемые точки учета учавствуют в формуле. 
	// в этом случае необходимо указать показания приборов учета.
	// которые установлены на точках учета участвующие в формуле.
	ПериодСреза 				= ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата);
	РезультатФормулыРасчета 	= энргРаботаСТочкамиУчетаСервер.ФормулыРасчетаТочекУчета(Объект.ТочкиУчета.Выгрузить(,"ТочкаУчета,НомерСтроки"),Объект.Организация,Объект.Район,Объект.Абонент.КлючПомещения,ПериодСреза);
	
	Если РезультатФормулыРасчета.пустой() тогда
		Возврат Истина;
	КонецЕсли;
	
	ТаблицаФормулы  			= РезультатФормулыРасчета.Выгрузить();			
	ЗависимыеТочки  			= Новый Массив;
	
	для Каждого СтрокаТЧ из Объект.ТочкиУчета цикл
		// отключается рассчитываемая
		СтрокиФормулы			= ТаблицаФормулы.НайтиСтроки(Новый Структура("ТочкаУчета",СтрокаТЧ.ТочкаУчета));
		Если СтрокиФормулы.Количество() > 0 тогда
			для Каждого СтрокаФормулы из СтрокиФормулы цикл
				Если ЗависимыеТочки.Найти(СтрокаФормулы.ТочкаУчета) = Неопределено  тогда
					ЗависимыеТочки.добавить(СтрокаФормулы.ТочкаУчета);
				КонецЕсли;
			КонецЦикла;	
			Если ЗависимыеТочки.Найти(СтрокаТЧ.ТочкаУчета) = Неопределено  тогда
				ЗависимыеТочки.добавить(СтрокаТЧ.ТочкаУчета);
			КонецЕсли;
		КонецЕсли;	
		
		// отключается учавствующая в формуле		
		СтрокиФормулы			= ТаблицаФормулы.НайтиСтроки(Новый Структура("ТочкаУчета",СтрокаТЧ.ТочкаУчета));
		Если СтрокиФормулы.Количество() > 0 тогда
			ЗависимыеСтроки  	= ТаблицаФормулы.НайтиСтроки(Новый Структура("ТочкаУчета",СтрокиФормулы[0].ТочкаУчета));
			для Каждого СтрокаФормулы из ЗависимыеСтроки цикл
				Если ЗависимыеТочки.Найти(СтрокаФормулы.ТочкаУчета) = Неопределено  тогда
					ЗависимыеТочки.добавить(СтрокаФормулы.ТочкаУчета);
				КонецЕсли;
			КонецЦикла;			
			Если ЗависимыеТочки.Найти(СтрокиФормулы[0].ТочкаУчета) = Неопределено  тогда 
				ЗависимыеТочки.добавить(СтрокиФормулы[0].ТочкаУчета);
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	
	Результат 					= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(ПериодСреза,Объект.Организация,Объект.Район,Объект.КлючПомещения); 
	Выборка  					= Результат.выбрать();
	
	Пока Выборка.следующий() цикл
		
		Если ЗависимыеТочки.Найти(Выборка.ТочкаУчета) = Неопределено тогда
			// точка не зависит от других
			Продолжить;
		КонецЕсли;
		
		СтрокиПриборов 			= Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета,ПриборУчета",Выборка.ТочкаУчета,Выборка.ПриборУчета));
		СтрокиОтключения 		= Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета,ПриборУчета",Выборка.ТочкаУчета,Выборка.ПриборУчета));
		Если СтрокиПриборов.Количество() > 0 или СтрокиОтключения.Количество() > 0 тогда
			// строка точки уже добавлена или отключается
			Продолжить;
		КонецЕсли;
		
		Отказ 					= Истина;
		СтрокаПриборов  		= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриборов,Выборка);	
	КонецЦикла;  	
		
	Возврат не Отказ;	
КонецФункции 

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеДанныхНаГраницуДокумента

&НаСервере
Процедура ОбновитьДанныеНаГраницуДокумента()
	Объект.ВидыБлагоустройстваТарифныеКатегории.Очистить();
	энргРаботаСЛицевымСчетомСервер.ОбновитьВидыБлагоустройстваТарифныеКатегории(ЭтотОбъект);
	
	МассивРезультатов 	= Документы.энргОперацияСУслугами.ДанныеНаГраницуДокумента(Объект);
	КолвоРезультатов	= МассивРезультатов.Количество();
	
	Выборка 			= МассивРезультатов[КолвоРезультатов - 4].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Объект, Выборка,, "Организация,Район,КлючПомещения,Абонент");
		ЗаполнитьТочкиУчетаНаГраницу(Выборка);
		ЗаполнитьВидыБлагоустройстваТарифныеКатегорииНаГраницу(Выборка);
	КонецЦикла;	
	
	ЗаполнитьНаГраницуПотери(МассивРезультатов[КолвоРезультатов - 3].Выбрать());
	ЗаполнитьНаГраницуЗначениеПлощадей(МассивРезультатов[КолвоРезультатов - 2].Выбрать());
	ЗаполнитьНаГраницуЗначенияИзмерителей(МассивРезультатов[КолвоРезультатов - 1].Выбрать());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТочкиУчетаНаГраницу(Выборка)
	МассивСтрок = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета", Выборка.ТочкаУчета));
	Если МассивСтрок.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаТочки = МассивСтрок[0];
	ЗаполнитьЗначенияСвойств(СтрокаТочки, Выборка);
	СтрокаТочки.ТочкаУчетаРодитель = Выборка.РодительТочкиУчета;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыБлагоустройстваТарифныеКатегорииНаГраницу(Выборка)
	МассивСтрок = Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(Новый Структура("Услуга", Выборка.Услуга));
	Если МассивСтрок.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТекСтрока = МассивСтрок[0];
	ТекСтрока.ВидБлагоустройстваИндивидуальный 	= Выборка.ВидБлагоустройства;
	ТекСтрока.ТарифнаяКатегория 				= Выборка.ГруппаПотребителей;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаГраницуПотери(Выборка)
	Объект.Потери.Очистить();
	СпособПроцент = Перечисления.энргСпособыРасчетаПотерь.Процент;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Значение = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета", Выборка.ТочкаУчета));
		Если МассивСтрок.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		
		IDСтрокиТочкиУчета 		= МассивСтрок[0].IDСтроки;
		
		НСтрока = Объект.Потери.Добавить();
		НСтрока.IDСтроки 						= IDСтрокиТочкиУчета;
		НСтрока.ВидПотерь 						= Выборка.ВидПотерь;
		Если Выборка.СпособРасчетаПотерь = СпособПроцент Тогда 
			НСтрока.ПроцентПотерь 				= Выборка.Значение;
		Иначе 
			НСтрока.ФиксированныйОбъемПотерь 	= Выборка.Значение;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаГраницуЗначениеПлощадей(Выборка)
	Объект.ЗначениеПлощадей.Очистить();
	Пока Выборка.Следующий() Цикл		
		Если Выборка.ВидПлощади = Перечисления.энргВидыПлощадей.ПустаяСсылка()
			ИЛИ НЕ Объект.ЗначениеПлощадей.НайтиСтроки(Новый Структура("ВидПлощади", Выборка.ВидПлощади)).Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли; 		
		
		НСтрока = Объект.ЗначениеПлощадей.Добавить();
		НСтрока.ВидПлощади 	= Выборка.ВидПлощади;
		НСтрока.Значение 	= Выборка.Площадь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаГраницуЗначенияИзмерителей(Выборка)
	Объект.ЗначенияИзмерителей.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Значение = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета", Выборка.ТочкаУчета));
		Если МассивСтрок.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;		
		IDСтрокиТочкиУчета = МассивСтрок[0].IDСтроки;
		
		НСтрока = Объект.ЗначенияИзмерителей.Добавить();
		НСтрока.IDСтроки 					= IDСтрокиТочкиУчета;
		НСтрока.НаправлениеИспользованияТУ 	= Выборка.НаправлениеИспользованияТУ;
		НСтрока.Значение 					= Выборка.Значение;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СервисПроверкиПоказанийПриборовУчета

&НаСервере
Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний()
	
	ТаблицаПриборов = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Для Каждого ТекСтрока из Объект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район 			= Объект.Район;
		НСтрока.КлючПомещения 	= Объект.КлючПомещения;
	КонецЦикла;
	
	ПериодЗапроса = Новый Граница(Объект.Дата, ВидГраницы.Исключая); 
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний();
	ВспомогательныеПараметры.ПоказанияВСрок = Истина;
	ВспомогательныеПараметры.ПериодНачисления = Объект.ПериодНачисления; 
	
	Если Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления Тогда 
		ВспомогательныеПараметры.ПроверятьОРП = Ложь;
	КонецЕсли;
	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, Объект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ЭтотОбъект, РезультатЗапроса);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные, ДанныеСтроки = Неопределено)
	
	РезультатПроверки = энргРаботаСПоказаниямиПриборовУчетаКлиент.ОпределитьСостояниеПоказанийПоСтроке(ТекущиеДанныеТочкиУчета.ПриборУчета, ЭтотОбъект, ТекущиеДанные);
	Если РезультатПроверки.СостояниеИзменено И Не ТекущиеДанные.ПричинаОтклонения = РезультатПроверки.ПричинаОтклонения Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатПроверки);	
		
		Если Не ДанныеСтроки = Неопределено Тогда
			Если ДанныеСтроки.Свойство("СтатусИзмененПользователем") И ДанныеСтроки.СтатусИзмененПользователем Тогда
				ДанныеСтроки.СтатусИзмененПользователем = Ложь;		
			КонецЕсли; 
			Если ДанныеСтроки.Свойство("ПереворотИзмененПользователем") И ДанныеСтроки.ПереворотИзмененПользователем Тогда
				ДанныеСтроки.ПереворотИзмененПользователем = Ложь;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата, ДанныеСтроки); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти




