
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьДанныеВБезопасноеХранилище(Результат, Владелец, СохраняемыеДанные, Ключ, ПараметрыЖурналаРегистрации) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, СохраняемыеДанные, Ключ);	
		Результат = Истина;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		
	   	ЗаписьЖурналаРегистрации(
			ПараметрыЖурналаРегистрации.ИмяСобытия,
			ПараметрыЖурналаРегистрации.УровеньЖурнала,,,
			ПараметрыЖурналаРегистрации.ПрефиксОшибки + ПодробноеПредставлениеОшибки(ИнфОбОшибке));
	КонецПопытки;	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПрочитатьДанныеИзБезопасногоХранилища(Результат, Владелец, Ключ, ПараметрыЖурналаРегистрации, ОбщиеДанные = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключ, ОбщиеДанные);
	Исключение
	    ИнфОбОшибке = ИнформацияОбОшибке();
		
	   	ЗаписьЖурналаРегистрации(
			ПараметрыЖурналаРегистрации.ИмяСобытия,
			ПараметрыЖурналаРегистрации.УровеньЖурнала,,,
			ПараметрыЖурналаРегистрации.ПрефиксОшибки + ПодробноеПредставлениеОшибки(ИнфОбОшибке));
	КонецПопытки;	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыЖурналаРегистрации() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяСобытия"		, "");
	Результат.Вставить("УровеньЖурнала"	, УровеньЖурналаРегистрации.Ошибка);
	Результат.Вставить("ПрефиксОшибки"	, "");
	
	Возврат Результат;    
	
КонецФункции

#КонецОбласти