#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Ответственный = Пользователи.ТекущийПользователь();
		
	Структура 	= Новый Структура;
	Структура.Вставить("МКД", МКД);
	Структура.Вставить("Видблагоустройства", ВидыБлагоустройстваТарифныеКатегории);
	Для каждого стр из Структура Цикл
		Если Не ЗначениеЗаполнено(стр.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение '" + стр.Ключ + "'!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.энргВидБлагоустройствМКД.Записывать = Истина;
	Движения.энргВидБлагоустройствМКД.Очистить();
	
	ЗаписатьВРегистрВидБлагоустройствМКД();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

Процедура ЗаписатьВРегистрВидБлагоустройствМКД()

	Набор = Движения.энргВидБлагоустройствМКД;
	Для Каждого Строка Из ВидыБлагоустройстваТарифныеКатегории Цикл
		НовЗапись = Набор.Добавить();
		НовЗапись.Период 						= Дата;
		НовЗапись.Регистратор 					= Ссылка;
		НовЗапись.Район							= Район;
		НовЗапись.МКД 							= МКД;		
		НовЗапись.Услуга						= Строка.Услуга;
		НовЗапись.ПериодНачисления 				= ПериодНачисления;
		НовЗапись.ПериодРегистрации             = Дата;
		НовЗапись.ВидБлагоустройства			= Строка.ВидБлагоустройстваОбщедомовой;
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли