#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РеализацияИнтерфейса_

Функция ЗавершениеПериодаНачисленияПоОрганизации(Организация, Район) Экспорт  
	
	ПараметрыСхемы  				= Новый Структура;	
	ПараметрыВТ						= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	Схема 							= Неопределено;	
	ТекущиеДатыОтчетногоПериодаОбщиеНастройки(Схема, ПараметрыСхемы, "");
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
		
	Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Если Результат.Пустой() Тогда
		Результат 					= 31;
	Иначе
		Выборка 					= Результат.Выбрать();
		Выборка.Следующий();		
		Результат 					= Выборка.Завершение;
	КонецЕсли;
	

	
	Возврат Результат
	
КонецФункции

Процедура ТекущиеДатыОтчетногоПериодаОбщиеНастройки(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "ТекущиеДатыОтчетногоПериодаОбщиеНастройки") Экспорт  
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;			
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТекущиеДатыОтчетногоПериодаОбщиеНастройки());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
				
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ДатыОтчетногоПериодыОбщиеНастройки", ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
	
#Область ТекстыЗапросов

Функция ТекстЗапросаТекущиеДатыОтчетногоПериодаОбщиеНастройки()
	
	Текст =
	"ВЫБРАТЬ
	|	ДатыОтчетногоПериодыОбщиеНастройки.Организация КАК Организация,
	|	ДатыОтчетногоПериодыОбщиеНастройки.Район КАК Район,
	|	ДатыОтчетногоПериодыОбщиеНастройки.Завершение КАК Завершение
	|ИЗ
	|	РегистрСведений.бестДатыОтчетногоПериодыОбщиеНастройки КАК ДатыОтчетногоПериодыОбщиеНастройки";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли