#Область ПрограммныйИнтерфейс

// Процедура - При изменении услуги
//
// Параметры:
//  Форма							 - ДанныеФормыСтруктура 
//  ТекДанные						 - Строка ТЧ 
//  ОписаниеУслуги					 - см энргРаботаСПоставщикамиСервер.ОписаниеУслуги() 
//  ТЧ								 - Строка - Название ТЧ 
//  СоответствиеЗначенияПоУмолчанию	 - Соответствие
//
Процедура ПриИзмененииУслуги(Форма,ТекДанные,ОписаниеУслуги, ТЧ = "СпособыРасчетаНормативаСоставныхУслуг", СоответствиеЗначенияПоУмолчанию = Неопределено) Экспорт 
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга и не ЗначениеЗаполнено(ТекДанные.IDСтроки) тогда
		ТекДанные.IDСтроки 					= Новый УникальныйИдентификатор;
	КонецЕсли;
		
	ТекДанные.ЭтоСоставнаяУслуга 			= ОписаниеУслуги.ЭтоСоставнаяУслуга; 	
	
	// ищем строки 
	СтрокиСоотвествия 						= Форма.Объект[ТЧ].НайтиСтроки(Новый Структура("IDСтроки",ТекДанные.IDСтроки));	
	для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
		Форма.Объект[ТЧ].Удалить(СтрокаСоотвествия);
	КонецЦикла;
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		для Каждого Строка из ОписаниеУслуги.Услуги цикл
			СтрокаТЧ  						= Форма.Объект[ТЧ].Добавить();
			СтрокаТЧ.IDСтроки 				= ТекДанные.IDСтроки;
			СтрокаТЧ.ЧастьСоставнойУслуги 	= Строка;
			Если СоответствиеЗначенияПоУмолчанию <> Неопределено Тогда
				Для каждого эл из СоответствиеЗначенияПоУмолчанию Цикл
					СтрокаТЧ[эл.Ключ] 	= эл.Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли СоответствиеЗначенияПоУмолчанию <> Неопределено Тогда
		Для каждого эл из СоответствиеЗначенияПоУмолчанию Цикл
			ТекДанные[эл.Ключ] 	= эл.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура - Перед удалением
//
// Параметры:
//  Форма		 - ДанныеФормыСтруктура 
//  ТекДанные	 - Строка ТЧ 
//
Процедура ПередУдалением(Форма,ТекДанные) Экспорт 
	
	Если не ТекДанные.ЭтоСоставнаяУслуга тогда
		Возврат;
	КонецЕсли;
	
	// удаляем строки из табличной часть СпособыРасчетаНормативаСоставныхУслуг
	ТабЧасть  	= Форма.объект.СпособыРасчетаНормативаСоставныхУслуг ;
	СтрокиТЧ 	= ТабЧасть.найтиСтроки(Новый Структура("IDСтроки",ТекДанные.IDСтроки));
	для Каждого СтрокаТЧ из СтрокиТЧ цикл
		 ТабЧасть.удалить(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
