#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значения реквизитов объекта.
//
// Параметры:
//  МаркаСсылка			-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//  ПолучаемыеСвойства	-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
// 
// Возвращаемое значение:
//   Структура	-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//
Функция ЗначенияРеквизитовОбъекта(МаркаСсылка, ПолучаемыеСвойства) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МаркаСсылка, ПолучаемыеСвойства);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает тип СИ.
//
// Параметры:
//  МаркаПрибораУчета	-	СправочникСсылка.энргМаркиПриборовУчета.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.энргТипыСИ.
//
Функция ПолучитьТипСИ(МаркаПрибораУчета) Экспорт
	ТипСИ	= Перечисления.энргТипыСИ.ПустаяСсылка();
	
	Запрос	= Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	МаркиПриборовУчета.ТипСИ КАК ТипСИ
		|ИЗ
		|	Справочник.энргМаркиПриборовУчета КАК МаркиПриборовУчета
		|ГДЕ
		|	МаркиПриборовУчета.Ссылка = &МаркаПУ";
	
	Запрос.УстановитьПараметр("МаркаПУ", МаркаПрибораУчета);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 ТипСИ = Выборка.ТипСИ;
	КонецЕсли;
	
	Возврат ТипСИ;
КонецФункции

#КонецОбласти

#КонецЕсли