#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеТУ(),	Движения.бестДоговорыТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДоговора(), Движения.бестСостояниеДоговоров);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТУ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЗаменитьДоговорПоУслуге.Организация КАК Организация,
		|	бестЗаменитьДоговорПоУслуге.Район КАК Район,
		|	бестЗаменитьДоговорПоУслуге.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаменитьДоговорПоУслугеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	бестЗаменитьДоговорПоУслугеТочкиУчета.Услуга КАК Услуга,
		|	бестЗаменитьДоговорПоУслугеТочкиУчета.Договор КАК Договор,
		|	бестЗаменитьДоговорПоУслуге.Дата КАК Период
		|ИЗ
		|	Документ.бестИзменитьДоговорПоУслуге.ТочкиУчета КАК бестЗаменитьДоговорПоУслугеТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьДоговорПоУслуге КАК бестЗаменитьДоговорПоУслуге
		|		ПО бестЗаменитьДоговорПоУслугеТочкиУчета.Ссылка = бестЗаменитьДоговорПоУслуге.Ссылка
		|ГДЕ
		|	бестЗаменитьДоговорПоУслуге.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьДанныеДоговора()
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИзменитьДоговорПоУслуге.Организация КАК Организация,
		|	бестИзменитьДоговорПоУслуге.Район КАК Район,
		|	бестИзменитьДоговорПоУслугеТочкиУчета.Договор КАК Договор,
		|	бестИзменитьДоговорПоУслуге.Дата КАК Дата
		|ПОМЕСТИТЬ ДанныеДоговора
		|ИЗ
		|	Документ.бестИзменитьДоговорПоУслуге.ТочкиУчета КАК бестИзменитьДоговорПоУслугеТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьДоговорПоУслуге КАК бестИзменитьДоговорПоУслуге
		|		ПО бестИзменитьДоговорПоУслугеТочкиУчета.Ссылка = бестИзменитьДоговорПоУслуге.Ссылка
		|ГДЕ
		|	бестИзменитьДоговорПоУслуге.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестСостояниеДоговоровСрезПоследних.Договор КАК Договор,
		|	бестСостояниеДоговоровСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ СостояниеДоговоров
		|ИЗ
		|	РегистрСведений.бестСостояниеДоговоров.СрезПоследних(
		|			&Период,
		|			(Организация, Район, Договор) В
		|				(ВЫБРАТЬ
		|					ДанныеДоговора.Организация КАК Организация,
		|					ДанныеДоговора.Район КАК Район,
		|					ДанныеДоговора.Договор КАК Договор
		|				ИЗ
		|					ДанныеДоговора КАК ДанныеДоговора)) КАК бестСостояниеДоговоровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДоговора.Организация КАК Организация,
		|	ДанныеДоговора.Район КАК Район,
		|	ДанныеДоговора.Договор КАК Договор,
		|	ДанныеДоговора.Дата КАК Период,
		|	ИСТИНА КАК Состояние
		|ИЗ
		|	ДанныеДоговора КАК ДанныеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеДоговоров КАК СостояниеДоговоров
		|		ПО ДанныеДоговора.Договор = СостояниеДоговоров.Договор
		|ГДЕ
		|	НЕ ЕСТЬNULL(СостояниеДоговоров.Состояние, ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДоговора.Организация,
		|	ДанныеДоговора.Район,
		|	ДанныеДоговора.Договор,
		|	ДанныеДоговора.Дата";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли