#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНапоминания(Команда)
	Если НЕ ЗначениеЗаполнено(Организация) 
		ИЛИ НЕ ЗначениеЗаполнено(РольПользователя)
		ИЛИ НЕ ЗначениеЗаполнено(ТекстНапоминания)
		ИЛИ НЕ ЗначениеЗаполнено(ЗаСколькоДней) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните необходимые параметры напоминания.");
		Возврат;
	КонецЕсли;
	СоздатьНапоминанияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьНапоминанияНаСервере()
	Обработки.бестРаботаСНапоминаниямиПользователей.СозданиеНапоминаний(Организация, РольПользователя, ТекстНапоминания, ЗаСколькоДней, Район);
КонецПроцедуры

#КонецОбласти
