#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак распределения.
//
// Параметры:
//  Период			-	Дата.
//  ДанныеСтроения	-	Структура.
//  ФормаУправления	-	ПеречислениеСсылка.энргФормыУправленияМКД.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПолучитьПризнакРаспределения(Период, ДанныеСтроения, ФормаУправления = Неопределено) Экспорт 
	ТекФормаУправления = ФормаУправления;
	Если ФормаУправления = Неопределено Тогда
		Ответ = ПолучитьФормуУправленияПоМКД(Период, ДанныеСтроения.Организация, ДанныеСтроения.Район, ДанныеСтроения.МКД);
		Если Ответ.Количество() > 0 Тогда
			ТекФормаУправления = Ответ[0].ФормаУправления;
		КонецЕсли;
		
	КонецЕсли;
	
	Распределять = ТекФормаУправления = Перечисления.энргФормыУправленияМКД.УК 
					или ТекФормаУправления = Перечисления.энргФормыУправленияМКД.ТСЖ;
	
	Возврат НЕ Распределять;
КонецФункции

// Проверяет УК.
//
// Параметры:
//  ФормаУправления	-	ПеречислениеСсылка.энргФормыУправленияМКД.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПроверятьУК(ФормаУправления) Экспорт
	Проверять = ФормаУправления = Перечисления.энргФормыУправленияМКД.УК 
					или ФормаУправления = Перечисления.энргФормыУправленияМКД.ТСЖ;
					
	Возврат Проверять;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает форму управления по МКД.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.энргФормыУправленияМКД.
//
Функция ПолучитьФормуУправленияПоМКД(Период, Организация, Район, МКД) Экспорт
	Возврат РегистрыСведений.энргФормыУправленияМКД.СрезПоследних(Период, Новый Структура("Организация, Район, МКД", Организация, Район, МКД));
КонецФункции

#КонецОбласти

#КонецЕсли
