#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СФормироватьЛицевойСчет(Знач Организация, Знач Район, Знач ГруппаАбонента, АбонентскийОтдел = Неопределено) Экспорт
	перем Группа;
	
	ДлинаЛС 	= РегистрыСведений.энргДлинаЛицевогоСчета.ПолучитьДлинуЛС(Организация);//8;
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Филиал",			АбонентскийОтдел);
	
	Если Не ЗначениеЗаполнено(АбонентскийОтдел) Или Не ЗначениеЗаполнено(АбонентскийОтдел.ПрефиксЛицевыхСчетов) Тогда
		
		Группа 		= ГруппаАбонента;
		
		Текст 		=
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.ЛицевойСчет, ""00000000"") КАК МаксНомер
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПОДСТРОКА(энргАбоненты.ЛицевойСчет, 5,%%ДлинаЛС%%)) КАК ЛицевойСчет
		|	ИЗ
		|		Справочник.энргАбоненты КАК энргАбоненты
		|	ГДЕ
		|		энргАбоненты.Район  =&район И энргАбоненты.Организация  = &Организация) КАК ВложенныйЗапрос";
		Текст 			= СтрЗаменить(Текст,"%%ДлинаЛС%%",Строка(ДлинаЛС));
		Запрос.Текст 	= Текст;
		Выборка  		= Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		МаксНомер  		= СокрЛП(Выборка.МаксНомер);
		
		КодАбонента 	= Формат(Число(МаксНомер) + 1,"ЧГ=0");
		
		Если ЗначениеЗаполнено(Группа) Тогда
			Пока Группа.Уровень() > 1 Цикл
				Группа = Группа.Родитель;
			КонецЦикла;
			КодРайона = ?(ЗначениеЗаполнено(Группа.КодРайона),Группа.КодРайона, "00");
		Иначе
			КодРайона = "00";
		КонецЕсли;
		
		Префикс			= Район.КодРайона + КодРайона;
		ЛС 				= Префикс + Лев("00000000000000", ДлинаЛС - СтрДлина(Префикс) - СтрДлина(КодАбонента)) + КодАбонента;
	Иначе
		Текст 		=
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.ЛицевойСчет, ""00000000"") КАК МаксНомер
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПОДСТРОКА(энргАбоненты.ЛицевойСчет, 5,%%ДлинаЛС%%)) КАК ЛицевойСчет
		|	ИЗ
		|		Справочник.энргАбоненты КАК энргАбоненты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних КАК энргФилиалыАбонентовСрезПоследних
		|			ПО энргФилиалыАбонентовСрезПоследних.Абонент = энргАбоненты.Ссылка
		|	ГДЕ
		|		энргАбоненты.Район = &район
		|		И энргАбоненты.Организация = &Организация
		|		И ПОДСТРОКА(энргАбоненты.ЛицевойСчет, 1,4) = &Префикс
		|		И энргФилиалыАбонентовСрезПоследних.Филиал = &Филиал) КАК ВложенныйЗапрос";
		
		Префикс			= Район.КодРайона + АбонентскийОтдел.ПрефиксЛицевыхСчетов;
		
		Текст 			= СтрЗаменить(Текст,"%%ДлинаЛС%%",Строка(ДлинаЛС));
		Запрос.Текст 	= Текст;
		Запрос.УстановитьПараметр("Префикс", Префикс);
		Выборка  		= Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		МаксНомер  		= СокрЛП(Выборка.МаксНомер);
		КодАбонента 	= Формат(Число(МаксНомер) + 1,"ЧГ=0");
	
		
		ЛС 				= Префикс + Лев("00000000000000", ДлинаЛС - СтрДлина(Префикс) - СтрДлина(КодАбонента)) + КодАбонента;
	КонецЕсли;
	
	Возврат ЛС;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДлинуЛС(Знач Организация, Знач Дата = Неопределено) Экспорт
	
	Возврат РегистрыСведений.энргДлинаЛицевогоСчета.ПолучитьДлинуЛС(Организация, Дата);
	
КонецФункции

#КонецОбласти

#КонецЕсли