#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДвиженияПоРегистрам();  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам()
	
	РезультатЗапроса = РезультатЗапросаДанныеТЧ(); 	
	
	Выборка  = РезультатЗапроса.выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Если Выборка.ОбъемУслуги = 0 Тогда
		//	Продолжить;
		//Иначе
		Запись  				= Движения.бестГарантированныеОбъемы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Период 			= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата);
		Запись.Организация 		= Организация;
		Запись.Район 			= Район;
		Запись.ОбъектРасчета 	= ОбъектРасчета;
		Запись.Год 				= Год;
		Запись.МКД 				= ОбъектРасчета.МКД;
		Запись.ПериодНачисления	= ПериодНачисления;
		запись.ПериодРегистрации=Дата;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗапросаДанныеТЧ()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга КАК Услуга,
		|	1 КАК Месяц,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Январь КАК ОбъемУслуги
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	2,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Февраль
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	3,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Март
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	4,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Апрель
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	5,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Май
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	6,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Июнь
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	7,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Июль
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	8,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Август
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	9,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Сентябрь
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	10,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Октябрь
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	11,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ноябрь
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Услуга,
		|	12,
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Декабрь
		|ИЗ
		|	Документ.бестУстановитьГарантированныеОбъемыНП.ГарантированныеОбъемы КАК бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы
		|ГДЕ
		|	бестУстановитьГарантированныеОбъемыНПГарантированныеОбъемы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ПредГод", Год - 1);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат  Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли