#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОткрытьДиалогВыбораФайла()
	
	РедактированиеШаблона=Ложь;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Документ Microsoft Word (*.doc, *.docx, *.dot)|*.doc;*.docx;*.dot";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Если СтрДлина(СтрЗаменить(ДиалогОткрытияФайла.ПолноеИмяФайла, ДиалогОткрытияФайла.Каталог, ""))>100 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Слишком длинное имя файла (больше 100 знаков)!";
			Сообщение.Сообщить();
		КонецЕсли;
		Данные = Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Объект.Наименование = СтрЗаменить(ДиалогОткрытияФайла.ПолноеИмяФайла, ДиалогОткрытияФайла.Каталог, "");
	Иначе
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокумент()
	
	Возврат РеквизитФормыВЗначение("Объект").ПечатнаяФорма.Получить();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСОМДокумент()
	
	Документ = ПолучитьДокумент();
	Если Документ=Неопределено Тогда Возврат; КонецЕсли;
	ПутьКФайлу = КаталогВременныхФайлов() + Объект.Наименование;
	
	Попытка
		Документ.Записать(ПутьКФайлу);
	Исключение
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Не удается записать документ по причине: ";
Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	Попытка
		ЗапуститьПриложение(ПутьКФайлу);
	Исключение
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Не удается запустить приложение по причине: ";
Сообщение.Сообщить();
		Возврат;
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ТекущийОбъект.ПечатнаяФорма = Новый ХранилищеЗначения(Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Если Не ВебКлиент Тогда
		ОткрытьДиалогВыбораФайла();
		
	#Иначе
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
		
		Диалог.Заголовок = "Загрузка файла"; 
		
		
		ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("Обработчик_Завершения_Загрузки", ЭтаФорма); 
		
		
		//НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, ,Диалог, Истина, УникальныйИдентификатор);
		НачатьПомещениеФайлаНаСервер(ОбработкаОкончанияЗагрузки, , , , Диалог, УникальныйИдентификатор); 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Завершения_Загрузки(Результат, ВременноеХранилище, ИмяФайла, ДопПараметры) Экспорт
	Если Результат Тогда
		Данные = ПолучитьИзВременногоХранилища(ВременноеХранилище);
		Объект.Наименование = ИмяФайла;		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	#Если ВебКлиент Тогда
		ПараметрыОповещения = Новый Структура;
		РасширениеПодключено = ПодключитьРасширениеРаботыСФайламиАсинх();
		Если НЕ РасширениеПодключено Тогда
			// Расширение не установлено, пробуем установить
			ПараметрыОповещения.Вставить("ДоПодключения", Истина);
			ОбработкаОкончанияУстановкиРасширения = Новый ОписаниеОповещения("Обработчик_Завершения_УстановкиРасширения", ЭтотОбъект, ПараметрыОповещения); 
			НачатьУстановкуРасширенияРаботыСФайлами(ОбработкаОкончанияУстановкиРасширения);
			Возврат;
			//УстановитьРасширениеРаботыСФайлами();
		КонецЕсли;
		
		РасширениеПодключено =  ПодключитьРасширениеРаботыСФайламиАсинх();
		Если Не РасширениеПодключено Тогда
			// Расширение не удалось установить, сообщаем об этом пользователю
			ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
			Возврат;
		КонецЕсли;
		ПараметрыОповещения.Вставить("ДоПодключения", Ложь);
		Обработчик_Завершения_УстановкиРасширения(ПараметрыОповещения);
	#Иначе
		ОткрытьСОМДокумент();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Завершения_УстановкиРасширения(ДопПараметры) Экспорт
	Если ДопПараметры.ДоПодключения Тогда
		РасширениеПодключено =  ПодключитьРасширениеРаботыСФайламиАсинх();
		Если Не РасширениеПодключено Тогда
			// Расширение не удалось установить, сообщаем об этом пользователю
			ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	
	Попытка
		Документ = ПолучитьДокумент();
		Если Документ=Неопределено Тогда Возврат; КонецЕсли;
		
		Адрес = ПоместитьВоВременноеХранилище(Документ);
		
		ПолучитьФайл(Адрес, Строка(объект.ссылка), Истина);
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры
		
&НаКлиенте
Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.ВладелецПФ = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПФПриИзменении(Элемент)
	НастроитьВидимостьДополнительныхОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьДополнительныхОтборов();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДополнительныхОтборов();
	Если ТипЗнч(Объект.ВладелецПФ.СсылкаНаОбъект) = Тип("СправочникСсылка.энргАбоненты")
		или ТипЗнч(Объект.ВладелецПФ.СсылкаНаОбъект) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом")  Тогда
		Элементы.ТипСтроения.Видимость = Истина;
	Иначе
		Элементы.ТипСтроения.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
