
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргИзменитьФормуУправленияМКД(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;  
	
	// ОТЭК, 25.05.2020, 000202897.
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	УстановитьВидимостьУК();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ОТЭК, 25.05.2020, 000202897.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если (Объект.ФормаУправления = ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.УК") ИЛИ
			Объект.ФормаУправления = ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.ТСЖ") )
			И Не ЗначениеЗаполнено(Объект.УК) Тогда
				
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""УК"" не заполнено",, "Объект.УК",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	Объект.МКД = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	Объект.МКД = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	МКДПриИзмененииНаСервере();
	ЗаполнитьУслугиМКД();
КонецПроцедуры

&НаКлиенте
Процедура ФормаУправленияПриИзменении(Элемент)
	УстановитьВидимостьУК();
	
	Распределять = ПолучитьПризнакРаспределения();
	Для Каждого ТекСтр из Объект.ТочкиУчета Цикл
		ТекСтр.РаспределятьНаАбонентов = Распределять;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьУК()
	// ОТЭК, 26.05.2020, 000202897.
	//Элементы.УК.Видимость = Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");
	Элементы.УК.Видимость = Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.ФормаУправленияНеВыбрана") И
								Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");
	Элементы.РасчетОбъемовВыполняетУК.Видимость = Элементы.УК.Видимость;							
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	КонецЕсли;
	ЗаполнитьУслугиМКД();
КонецПроцедуры

&НаКлиенте
Процедура МКДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 25.05.2020, 000202897.
	энргПользовательскийВводКлиент.отэкНачалоВыбораСтроения(Элемент, Объект.Организация, 
																Объект.Район, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура МКДПриИзмененииНаСервере()
	Объект.Район = Объект.МКД.Район;
КонецПроцедуры


#Область ВспомогательныеПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиМКД()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Период  = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	Иначе
		Период 	= Объект.Дата;
	КонецЕсли;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район",			Объект.Район);
	Запрос.УстановитьПараметр("МКД", 			Объект.МКД);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВсеТочкиУчета
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	ВсеТочкиУчета КАК ВсеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД
	|		ПО ВсеТочкиУчета.ТочкаУчета = АктивныеТочкиУчетаМКД.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргУслугиТочекУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	УслугиТочекУчета.Услуга КАК Услуга
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = УслугиТочекУчета.ТочкаУчета";
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	
	Объект.ТочкиУчета.Очистить();
	Распределять = ПолучитьПризнакРаспределения();
	
	Пока Выборка.Следующий() Цикл	
		НоваяСтрока = Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.РаспределятьНаАбонентов = Распределять;
	КонецЦикла;	
			
КонецПроцедуры

&НаСервере
Функция ПолучитьПризнакРаспределения()
	Возврат РегистрыСведений.энргФормыУправленияМКД.ПолучитьПризнакРаспределения(Объект.Дата, Новый Структура, Объект.ФормаУправления);
КонецФункции

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти

