#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Выполнить команду задачи
//
// Параметры:
//	ИмяКоманды - Строка
//
Процедура ВыполнитьКомандуЗадачи(ИмяКоманды) Экспорт
	Результат					= Перечисления.бестРезультатыЗадачДоговорногоБлока[ИмяКоманды];
	ФактическийСрокИсполнения	= ТекущаяДата();

	ВыполнитьЗадачу();
	
	Если Результат = Перечисления.бестРезультатыЗадачДоговорногоБлока.ОтправитьПоЭлПочтеСмс Тогда
		бестБизнесПроцессДоговорногоБлока.ОтправитьПисьмо(Ссылка);
	КонецЕсли;
КонецПроцедуры

// Процедура - Принять к исполнению
//
Процедура ПринятьКИсполнению() Экспорт
	
	Исполнитель = Пользователи.ТекущийПользователь();
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли