#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;                  	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета", ""));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьЗначенияИзмерителей";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеНаправлениеИспользованияТУ());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьДанныеИзмененияИзмерителей(Схема,ВыбираемыеТаблицы) Экспорт
	
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеИзмеретелйУстановитьЗначенияИзмерителей";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияИзмерителей());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстПолучитьДанныеНаправлениеИспользованияТУ()
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.КлючПомещения КАК КлючПомещения,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияИзмерителей.ТочкиУчета КАК ТаблицаТочекУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияИзмерителей КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргРодительТочкиУчетаСрезПоследних.Организация КАК Организация,
	|	энргРодительТочкиУчетаСрезПоследних.Район КАК Район,
	|	энргРодительТочкиУчетаСрезПоследних.РодительТочкиУчета КАК РодительТочкиУчета,
	|	энргРодительТочкиУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТУРодитель
	|ИЗ
	|	РегистрСведений.энргРодительТочкиУчета.СрезПоследних(
	|			,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					вт.Организация,
	|					вт.Район,
	|					вт.КлючПомещения,
	|					вт.ТочкаУчета
	|				ИЗ
	|					ВТ_ТУ КАК вт)) КАК энргРодительТочкиУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТУ.Организация КАК Организация,
	|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ТУ.Район КАК Район,
	|	ВТ_ТУ.ЧастныйСектор КАК ЧастныйСектор,
	|	ВТ_ТУ.Строение КАК Строение,
	|	ВТ_ТУ.Помещение КАК Помещение,
	|	ВТ_ТУ.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_ТУ.КлючПомещения КАК КлючПомещения,
	|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ТУ.ДатаРегистратора КАК ДатаРегистратора,
	|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТУ.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	ВТ_ТУ КАК ВТ_ТУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТУ.Организация,
	|	ВТ_ТУ.ПериодНачисления,
	|	ВТ_ТУ.Район,
	|	ВТ_ТУ.ЧастныйСектор,
	|	ВТ_ТУ.Строение,
	|	ВТ_ТУ.Помещение,
	|	ВТ_ТУ.ДокРегистратор,
	|	ВТ_ТУ.КлючПомещения,
	|	ВТ_ТУ.ПериодРегистрации,
	|	ВТ_ТУ.ДатаРегистратора,
	|	ВТ_ТУРодитель.РодительТочкиУчета,
	|	МАКСИМУМ(ВТ_ТУ.НаправлениеИспользованияТУ)
	|ИЗ
	|	ВТ_ТУРодитель КАК ВТ_ТУРодитель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТУ КАК ВТ_ТУ
	|		ПО ВТ_ТУРодитель.ТочкаУчета = ВТ_ТУ.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТУРодитель.РодительТочкиУчета,
	|	ВТ_ТУ.ДатаРегистратора,
	|	ВТ_ТУ.ПериодРегистрации,
	|	ВТ_ТУ.ПериодНачисления,
	|	ВТ_ТУ.Район,
	|	ВТ_ТУ.Организация,
	|	ВТ_ТУ.ЧастныйСектор,
	|	ВТ_ТУ.КлючПомещения,
	|	ВТ_ТУ.Помещение,
	|	ВТ_ТУ.Строение,
	|	ВТ_ТУ.ДокРегистратор";	
	Возврат Текст;
КонецФункции

Функция ТекстПолучитьДанныеИзмененияИзмерителей()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаИзмерителей.НаправлениеИспользованияТУ КАК Измеритель,
	|	ТаблицаИзмерителей.Значение КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияИзмерителей.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияИзмерителей КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияИзмерителей.ЗначенияИзмерителей КАК ТаблицаИзмерителей
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаИзмерителей.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаИзмерителей.IDСтроки";	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли