#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// заполняем список параметров участвующих в расчете
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();
	Если Инструменты = Неопределено тогда 		
		Отказ 			= истина;
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПараметрыРасчета(ПараметрыРасчета);
			
	Если ЗначениеЗаполнено(Параметры.ДанныеФормулы) тогда
		ФормулаРасчета 	= Параметры.ДанныеФормулы;
	иначе
		ФормулаРасчета 	= "Результат  = ";
	КонецЕсли;		
	Поле 				="<"; 
КонецПроцедуры  

&НаКлиенте
Процедура ПолеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;	
	ТекСтрокаСписка  		= Элементы.ПараметрыРасчета.ТекущаяСтрока;
	Если ТекСтрокаСписка = Неопределено тогда
		Возврат;
	КонецЕсли;	
	ФормулаРасчета 			= ФормулаРасчета + ПараметрыРасчета[ТекСтрокаСписка].Значение;		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)                      
	// проверяем формулу расчета
	ДанныеФормулы  	= СтрЗаменить(СокрЛП(ФормулаРасчета),"  "," ");;
	НомерСимвола 	= Найти(ДанныеФормулы,"Результат = ");
	Если НомерСимвола <> 1 тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формула расчета должна начинаться со строки ""Результат = """);
		Возврат;
	КонецЕсли;
	Закрыть(ДанныеФормулы);
КонецПроцедуры



#КонецОбласти
