#Область ОбработчикиСобытий

Функция СтруктруаЗначенийЗаполненияАбонента() Экспорт
	СвойстваАбонента = энргРаботаСЛицевымСчетомСервер.ЗаполняемыеСвойстваАбонентаПоУмолчанию();
	Возврат Новый Структура(СвойстваАбонента);
КонецФункции

Функция СтруктруаЗначенийЗаполненияМКД() Экспорт  
	 Возврат Новый Структура("Район, Организация");
КонецФункции
 
 Функция СтруктураЗначенийЗаполненияДоговора() Экспорт  
	 Возврат Новый Структура("Организация,Район,ДатаФактическогоСобытия,Контрагент,Договор,ОбъектРасчета");
КонецФункции


#КонецОбласти                     
