#Область ОписаниеПеременных

перем Организация Экспорт; // Организация предоставляющая услуги
перем ПериодНачисления Экспорт; // Период начисления услуги
перем Район Экспорт; // Район, в котором оказывается услуга
перем ЧастныйСектор Экспорт; // Булево - Является ли строение частным сектором
перем Строение Экспорт; // Адрес, по которому оказавается услуга
перем Помещение Экспорт; // Помещение, в котором оказывается услуга
перем ФинальноеНачисление Экспорт; // Последнее актуальное начисление
перем МассивАбонентов Экспорт; // Массив, состоящий из абонентов пользующихся услугами 
перем МассивКлючейПомещений Экспорт; // Массив ключей помещений
перем ГраницыПериода;
перем ДокументОбъект,Набор,НаборПомещения,НаборНачисленныйСредний, ОчищатьНабор;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатДокументыДляОчисткиДвижения()
	 	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	НЕ энргПерерасчет.ПометкаУдаления
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(энргПерерасчет.Дата, МЕСЯЦ) = &ПериодНачисления
	|	И энргПерерасчет.Строение = &Строение";
	
	Если ЧастныйСектор = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргПерерасчет.Строение = &Строение","");
	ИначеЕсли ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Строение",		Справочники.энргСтроения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
		
КонецФункции

Функция ГраницыПериода() Экспорт 
	 Возврат ГраницыПериода;
КонецФункции

Функция НаборОбъемНачислений() Экспорт 
	 Возврат Набор;
КонецФункции

Функция НаборОбъемНачисленийПомещенийСРазделеннымиЛС() Экспорт 
	 Возврат НаборПомещения;
КонецФункции

Функция НаборНачисленныйСредний() Экспорт 
	  Возврат НаборНачисленныйСредний;
КонецФункции

Процедура Инициализировать(МВТ) Экспорт 
	
	ГраницыПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  	= ГраницыПериода.ЗавершениеОП;

	Схема = Неопределено;
	НомерПозицииПредоставленных = 0;	
	ПараметрыСхемы = Новый Структура;
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ = Новый Массив;
	
	СоотвествиеПолей = Новый Структура(
	"Организация,Район,ПериодНачисления,Период,НомерПозиции,ВидОперацийНачисления",
	"Организация", "Район", "ПериодНачисления", "НачалоПериодаРасчетаГраница", "НомерПозицииПредоставленных", "ВидОперацийНачисленияНачисление");
	
	Если НЕ ЧастныйСектор = Неопределено Тогда
		
		СоотвествиеПолей.Вставить("ЧастныйСектор", "ЧастныйСектор");
		СоотвествиеПолей.Вставить("МКД", "МКД");		
		
		Если НЕ ЧастныйСектор И НЕ Строение = Неопределено Тогда
			СоотвествиеПолей.Вставить("Строение", "Строение");
		КонецЕсли;
		
		Если НЕ Помещение = Неопределено  Тогда
			СоотвествиеПолей.Вставить("Помещение", "Помещение");
		КонецЕсли;
		
	КонецЕсли;
	   	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	
	Если Не МассивАбонентов = Неопределено и НЕ МассивАбонентов.Количество() = 0 Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Абонент","МассивАбонентов")));
	КонецЕсли;
	
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	ПараметрыСхемы.Вставить("Период", Новый Структура("ИмяПараметра", СоотвествиеПолей.Период));
	
	СоотвествиеПолейСредний = ПараметрыСхемы.ПараметрыВТ[0].СоотвествиеПолей;
	СоотвествиеПолейСредний.Удалить("ПериодНачисления");
	РегистрыНакопления.энргНачисленныйСреднийОбъем.ЗаполнитьСхемуЗапросаОстатками(Схема, ПараметрыСхемы, "НеСписанныйСредний");
	
	//СоотвествиеПолей.Вставить("Организация",		"Организация");
	СоотвествиеПолей.Вставить("ПериодНачисления",	"ПериодНачисления");
	
	СоотвествиеПолейДокументовНачисления = ПараметрыСхемы.ПараметрыВТ[0].СоотвествиеПолей;
	СоотвествиеПолейДокументовНачисления.Удалить("Организация");
	РегистрыСведений.энргДокументыНачислений.ДокументыНачислений(Схема, ПараметрыСхемы, "ДокументыНачислений");
	
	СоотвествиеПолей.Вставить("Организация", "Организация");
	СоотвествиеПолейПерерасчет = ПараметрыСхемы.ПараметрыВТ[0].СоотвествиеПолей;
	СоотвествиеПолейПерерасчет.ВидОперацийНачисления = "ВидОперацийНачисленияНачислениеПерерасчет";
	РегистрыСведений.энргДокументыНачислений.ДокументыНачислений(Схема, ПараметрыСхемы, "ДокументыПерерасчет");	
			
	ПараметрыОбъемНачислений = Новый Массив;
	СоотвествиеПолейОбъемНачислений = Новый Структура("Регистратор", "ДокументНачисления");
	ПараметрыОбъемНачислений.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ДокументыНачислений", СоотвествиеПолейОбъемНачислений));
	ПараметрыОбъемНачислений.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Период", "КонецПериодаРасчета")));
	
	Если НЕ Помещение = Неопределено Тогда
		ПараметрыОбъемНачислений.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения", "КлючПомещения")));
	КонецЕсли;
	
	ПараметрыСхемы.ПараметрыВТ = ПараметрыОбъемНачислений;
	
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписей(Схема, ПараметрыСхемы, "НачисленныйОбъем");
	РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.ЗаполнитьСхемуНаборомЗаписей(Схема, ПараметрыСхемы, "НачисленныйОбъемПомещений");	
	
	ЗаполнитьСхемуНаборомЗаписейВыводыПУБезПоказаний(Схема, СоотвествиеПолей);	
	
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.МенеджерВременныхТаблиц = МВТ;
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	Если НЕ ПараметрыЗапроса.Найти("НачалоПериодаРасчетаГраница") = Неопределено Тогда
		Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница", Новый Граница(НачалоПериодаРасчета, ВидГраницы.Исключая));
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("КонецПериодаРасчетаГраница") = Неопределено Тогда
		Запрос.УстановитьПараметр("КонецПериодаРасчетаГраница",	КонецПериодаРасчета);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ПериодНачисления") = Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("Район") = Неопределено Тогда
		Запрос.УстановитьПараметр("Район", Район);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("Организация") = Неопределено Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("МКД") = Неопределено Тогда
		Запрос.УстановитьПараметр("МКД", ?(ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),Строение));
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ЧастныйСектор") = Неопределено Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор", ЧастныйСектор);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("Строение") = Неопределено Тогда
		Запрос.УстановитьПараметр("Строение", Строение);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ВидОперацийНачисленияНачисление") = Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацийНачисленияНачисление", Перечисления.энргВидыОперацийНачисления.Индивидуальные);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ВидОперацийНачисленияНачислениеПерерасчет") = Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацийНачисленияНачислениеПерерасчет", Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("Помещение") = Неопределено Тогда
		Запрос.УстановитьПараметр("Помещение", Помещение);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("МассивАбонентов") = Неопределено Тогда
		Запрос.УстановитьПараметр("МассивАбонентов", МассивАбонентов);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("НомерПозицииПредоставленных") = Неопределено Тогда
		Запрос.УстановитьПараметр("НомерПозицииПредоставленных", НомерПозицииПредоставленных);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("КонецПериодаРасчета") = Неопределено Тогда
		Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета-1);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("НачалоПериодаРасчета") = Неопределено Тогда
		Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоПериодаРасчета);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("КлючПомещения") = Неопределено Тогда
		ОписаниеКлючаПомещения = Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение,Помещение);
		Запрос.УстановитьПараметр("КлючПомещения", ОписаниеКлючаПомещения.КлючПомещения);
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		Коллекция 						= СтрРазделить("ДокументыНачислений,ДокументыПерерасчет,НеСписанныйСредний,НачисленныйОбъем",",",Ложь);
		Для ИндексТаблицы = 0 По Коллекция.ВГраница() Цикл
			РезультатЗапроса 			= МВТ.Таблицы[Коллекция[ИндексТаблицы]].ПолучитьДанные();			
			ИмяМетода 					= "ДелегатПерерасчетСреднихНачислений.Инициализировать" + "." + Коллекция[ИндексТаблицы];
			слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
			слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, РезультатЗапроса);			
		КонецЦикла; 		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередПроведенияМКД(МКД,яДокументПерерасчет,ДокументПерерасчетаПометкаУдаления) Экспорт 
	
	НачатьТранзакцию();
	
	ОчищатьНабор								= Ложь;
	
	КонецПериодаРасчета 						= ГраницыПериода.ЗавершениеОП;
	Набор 										= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("Организация", 	Организация);
	Набор.ДополнительныеСвойства.Вставить("Район", 			Район);
	Набор.ДополнительныеСвойства.Вставить("МКД", 			МКД);
	Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор", 	?(ЗначениеЗаполнено(МКД),Ложь,Истина));
	
	НаборПомещения 										= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	НаборПомещения.ДополнительныеСвойства.Вставить("Организация", 	Организация);
	НаборПомещения.ДополнительныеСвойства.Вставить("Район", 		Район);
	НаборПомещения.ДополнительныеСвойства.Вставить("МКД", 			МКД);
	НаборПомещения.ДополнительныеСвойства.Вставить("ЧастныйСектор", ?(ЗначениеЗаполнено(МКД),Ложь,Истина));
	
	НаборНачисленныйСредний 					= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
	НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Организация", 	Организация);
	НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Район", 			Район);
	НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("МКД", 			МКД);
	НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ЧастныйСектор", 	?(ЗначениеЗаполнено(МКД),Ложь,Истина));
	
	Если НЕ Помещение = Неопределено Тогда
		Набор.ДополнительныеСвойства.Вставить("Строение", 	Строение);
		Набор.ДополнительныеСвойства.Вставить("Помещение", 	Помещение);
		
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Строение", 	Строение);
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Помещение", 	Помещение);
	КонецЕсли;
		
	ДокументОбъект 								= Неопределено;
	Если НЕ ЗначениеЗаполнено(яДокументПерерасчет) Тогда
		ДокументПерерасчета 					= Документы.энргПерерасчет.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ДокументОбъект 							= Документы.энргПерерасчет.СоздатьОбъектСвязанныйПерерасчет(ДокументПерерасчета,Организация,Район,МКД,КонецПериодаРасчета-1); 
	ИначеЕсли ДокументПерерасчетаПометкаУдаления Тогда
		ДокументПерерасчета 					= яДокументПерерасчет;
		Набор.ДополнительныеСвойства.Вставить("ДокРегистратор", 					ДокументПерерасчета);
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ДокРегистратор", 	ДокументПерерасчета);
		Документы.энргПерерасчет.СнятьПометкуУдаленияСвязанныйПерерасчет(яДокументПерерасчет,Организация,Район,МКД); 
		РегистрыСведений.энргДокументыНачислений.СнятьПометкуУдаленияДокументаНачислений(ПериодНачисления, Организация, Район, Строение, Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
	ИначеЕсли НЕ Помещение = Неопределено Тогда
		ДокументПерерасчета 					= яДокументПерерасчет;
		Набор.ДополнительныеСвойства.Вставить("ДокРегистратор", 					ДокументПерерасчета);
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ДокРегистратор", 	ДокументПерерасчета);
		
		РегистрыНакопления.энргОбъемНачислений.ПрочитатьЗаписиПоПомещениюДоЗаписи(Набор);
		РегистрыНакопления.энргНачисленныйСреднийОбъем.ПрочитатьЗаписиПоПомещениюДоЗаписи(НаборНачисленныйСредний);
	Иначе		
		ДокументПерерасчета 					= яДокументПерерасчет;
		Набор.ДополнительныеСвойства.Вставить("ДокРегистратор", 					ДокументПерерасчета);
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ДокРегистратор", 	ДокументПерерасчета);
		
		Если Не ФинальноеНачисление Тогда
			РегистрыНакопления.энргОбъемНачислений.ОчиститьНаборЗаписейПоРегистратору(ДокументПерерасчета);
			РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.ОчиститьНаборЗаписейПоРегистратору(ДокументПерерасчета);
		КонецЕсли;
	КонецЕсли;
	
	Набор.Отбор.Регистратор.Установить(ДокументПерерасчета);
	НаборПомещения.Отбор.Регистратор.Установить(ДокументПерерасчета);
	НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументПерерасчета);
	
	Если ФинальноеНачисление И Не МассивАбонентов = Неопределено Тогда 
	
		Набор.ДополнительныеСвойства.Вставить("МассивКлючейПомещений",	МассивКлючейПомещений);
		РегистрыНакопления.энргОбъемНачислений.УдалитьЗаписиПоКлючамПомещений(Набор);
		
		НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("МассивАбонентов",	МассивАбонентов);
		РегистрыНакопления.энргНачисленныйСреднийОбъем.УдалитьЗаписиПоАбонентам(НаборНачисленныйСредний);
		
		ОчищатьНабор								= Истина;
	КонецЕсли;	

КонецПроцедуры

Процедура ПослеПроведенияМКД(мОшибки) Экспорт 
	Попытка
		Если Не ДокументОбъект = Неопределено Тогда
			ДокументОбъект.Записать(); 			
			Если ДокументОбъект.ДополнительныеСвойства.Свойство("НаборДокументыНачислений") Тогда
				ДокументОбъект.ДополнительныеСвойства.НаборДокументыНачислений.Записать(Ложь);				
			КонецЕсли;			
		КонецЕсли;	 
		
		ТЗОрганизаций = Набор.Выгрузить(,"Организация");
		ТЗОрганизаций.Свернуть("Организация");
		Если ТЗОрганизаций.Количество() > 1 Тогда
			Набор.ДополнительныеСвойства.Вставить("Организации",		ТЗОрганизаций.ВыгрузитьКолонку("Организация"));	
		КонецЕсли;
		
		Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
		Набор.Записать(ОчищатьНабор);
		
		ТЗОрганизаций = НаборПомещения.Выгрузить(,"Организация");
		ТЗОрганизаций.Свернуть("Организация");
		Если ТЗОрганизаций.Количество() > 1 Тогда
			НаборПомещения.ДополнительныеСвойства.Вставить("Организации",		ТЗОрганизаций.ВыгрузитьКолонку("Организация"));	
		КонецЕсли;
		
		НаборПомещения.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
		НаборПомещения.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке 					= ИнформацияОбОшибке();
		мОшибки.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтменитьОперациюПерерасчетСреднихНачислений() Экспорт
		
	КонецПериодаРасчета  						= ГраницыПериода.ЗавершениеОП;
	ВыборкаДокументыОтменить 					= РезультатДокументыДляОчисткиДвижения();
	ВыборкаДокументыОтменить 					= ВыборкаДокументыОтменить.Выбрать();
	Пока ВыборкаДокументыОтменить.Следующий() Цикл				
		ДокументОбъектОтменить					= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
		Если ФинальноеНачисление И Не МассивАбонентов = Неопределено Тогда
			Набор 										= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
			Набор.ДополнительныеСвойства.Вставить("Организация", 	Организация);
			Набор.ДополнительныеСвойства.Вставить("Район", 			Район);
			Набор.ДополнительныеСвойства.Вставить("МКД", 			Справочники.энргСтроения.ПустаяСсылка());
			Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор", 	Ложь);
			
			НаборНачисленныйСредний 					= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Организация", 		Организация);
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Район", 			Район);
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("МКД", 				Справочники.энргСтроения.ПустаяСсылка());
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ЧастныйСектор", 	Ложь);
			
			ДокументПерерасчета 					= ВыборкаДокументыОтменить.Ссылка;
			Набор.ДополнительныеСвойства.Вставить("ДокРегистратор", 					ДокументПерерасчета);
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("ДокРегистратор", 	ДокументПерерасчета);
			
			Набор.Отбор.Регистратор.Установить(ДокументПерерасчета);
			НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументПерерасчета);
			
			Набор.ДополнительныеСвойства.Вставить("МассивКлючейПомещений",	МассивКлючейПомещений);
			РегистрыНакопления.энргОбъемНачислений.УдалитьЗаписиПоКлючамПомещений(Набор);
			
			НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("МассивАбонентов",	МассивАбонентов);
			РегистрыНакопления.энргНачисленныйСреднийОбъем.УдалитьЗаписиПоАбонентам(НаборНачисленныйСредний);
			
			Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
			Набор.Записать(Истина);
		ИначеЕсли Помещение = Неопределено Тогда
			ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
			РегистрыСведений.энргДокументыНачислений.УстановитьПометкуУдаленияДокументаНачислений(ПериодНачисления, Организация, Район, Строение, Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
		Иначе
			// надо удалить движения с этим помещением
			Набор								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ВыборкаДокументыОтменить.Ссылка);
			Набор.Прочитать();
			
			СтрокиНабораДоЗаписи 		= Набор.Выгрузить();
			СтрокиУдалить 				= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Строение,Помещение", Строение, Помещение));
			Если СтрокиУдалить.Количество() <> 0 Тогда
				
				НаборНачисленныйСредний 			= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ВыборкаДокументыОтменить.Ссылка);
				
				НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
				НаборНачисленныйСредний.Прочитать();
				СтрокиНаборНачисленныйСреднийДоЗаписи 			= НаборНачисленныйСредний.Выгрузить();
				СтрокиУдалитьСреднего		= СтрокиНаборНачисленныйСреднийДоЗаписи.НайтиСтроки(Новый Структура("Строение,Помещение", Строение, Помещение));
				Для Каждого СтрокаУдалить ИЗ СтрокиУдалитьСреднего Цикл
					СтрокиНаборНачисленныйСреднийДоЗаписи.Удалить(СтрокаУдалить);
				КонецЦикла;
				НаборНачисленныйСредний.Загрузить(СтрокиНаборНачисленныйСреднийДоЗаписи);
				
				Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
					СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
				КонецЦикла;
				
				Набор.Загрузить(СтрокиНабораДоЗаписи);
				Набор.ДополнительныеСвойства.Вставить("Помещение",			Помещение);
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.ДополнительныеСвойства.Вставить("Строение",			?(Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД, Строение, Справочники.энргСтроения.ПустаяСсылка()));
				Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
				Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
				
				Набор.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСхемуНаборомЗаписейВыводыПУБезПоказаний(Схема, Отборы)
		
	ЕстьОтборЧС = Отборы.Свойство("ЧастныйСектор");
	ЕстьОтборСтроение = Отборы.Свойство("Строение");
	ЕстьОтборПомещение = Отборы.Свойство("Помещение");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	энргАктивностьТочекУчета.Организация КАК Организация,
	               |	энргАктивностьТочекУчета.Район КАК Район,
	               |	энргАктивностьТочекУчета.КлючПомещения КАК КлючПомещения,
	               |	энргАктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ТочкиБезПрибора
	               |ИЗ
	               |	РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	               |ГДЕ
	               |	энргАктивностьТочекУчета.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	               |	И энргАктивностьТочекУчета.Организация = &Организация
	               |	И энргАктивностьТочекУчета.Район = &Район
	               |	И энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена)
	               |	И энргАктивностьТочекУчета.КлючПомещения.Строение = &Строение
	               |	И энргАктивностьТочекУчета.КлючПомещения.ЧастныйСектор = &ЧастныйСектор
	               |	И энргАктивностьТочекУчета.КлючПомещения.Помещение = &Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргПриборыТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	               |	энргПриборыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	энргПриборыТочекУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ПриборыТочекУчета
	               |ИЗ
	               |	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	               |			&КонецПериодаРасчета,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И (КлючПомещения, ТочкаУчета) В
	               |					(ВЫБРАТЬ
	               |						ТочкиБезПрибора.КлючПомещения КАК КлючПомещения,
	               |						ТочкиБезПрибора.ТочкаУчета КАК ТочкаУчета
	               |					ИЗ
	               |						ТочкиБезПрибора КАК ТочкиБезПрибора)) КАК энргПриборыТочекУчетаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргСостояниеПриборовУчетаАбонента.Организация КАК Организация,
	               |	энргСостояниеПриборовУчетаАбонента.Район КАК Район,
	               |	энргСостояниеПриборовУчетаАбонента.КлючПомещения КАК КлючПомещения,
	               |	энргСостояниеПриборовУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
	               |	энргСостояниеПриборовУчетаАбонента.ПриборУчета КАК ПриборУчета,
	               |	энргСостояниеПриборовУчетаАбонента.КлючПомещения.Строение КАК Строение,
	               |	энргСостояниеПриборовУчетаАбонента.КлючПомещения.Помещение КАК Помещение,
	               |	энргСостояниеПриборовУчетаАбонента.КлючПомещения.ЧастныйСектор КАК ЧастныйСектор
	               |ПОМЕСТИТЬ ВыведенныеПриборыВПериоде
	               |ИЗ
	               |	РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК энргСостояниеПриборовУчетаАбонента
	               |ГДЕ
	               |	энргСостояниеПриборовУчетаАбонента.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	               |	И энргСостояниеПриборовУчетаАбонента.Организация = &Организация
	               |	И энргСостояниеПриборовУчетаАбонента.Район = &Район
	               |	И энргСостояниеПриборовУчетаАбонента.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод)
	               |	И энргСостояниеПриборовУчетаАбонента.КлючПомещения.Строение = &Строение
	               |	И энргСостояниеПриборовУчетаАбонента.КлючПомещения.ЧастныйСектор = &ЧастныйСектор
	               |	И энргСостояниеПриборовУчетаАбонента.КлючПомещения.Помещение = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения.Строение,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения.Помещение,
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения.ЧастныйСектор
	               |ИЗ
	               |	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
	               |			&КонецПериодаРасчета,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И (КлючПомещения, ТочкаУчета, ПриборУчета) В
	               |					(ВЫБРАТЬ
	               |						ПриборыТочекУчета.КлючПомещения КАК КлючПомещения,
	               |						ПриборыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	               |						ПриборыТочекУчета.ПриборУчета КАК ПриборУчета
	               |					ИЗ
	               |						ПриборыТочекУчета КАК ПриборыТочекУчета)) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
	               |ГДЕ
	               |	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыведенныеПриборыВПериоде.Организация КАК Организация,
	               |	ВыведенныеПриборыВПериоде.Район КАК Район,
	               |	ВыведенныеПриборыВПериоде.Строение КАК Строение,
	               |	ВыведенныеПриборыВПериоде.Помещение КАК Помещение,
	               |	ВыведенныеПриборыВПериоде.ЧастныйСектор КАК ЧастныйСектор,
	               |	энргОбъемНачислений.Абонент КАК Абонент,
	               |	ВыведенныеПриборыВПериоде.ТочкаУчета КАК ТочкаУчета,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК ЕстьНачисленияПоПоказаниям
	               |ПОМЕСТИТЬ ВыводыПУБезПоказаний
	               |ИЗ
	               |	ВыведенныеПриборыВПериоде КАК ВыведенныеПриборыВПериоде
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленныйОбъем КАК энргОбъемНачислений
	               |		ПО ВыведенныеПриборыВПериоде.Организация = энргОбъемНачислений.Организация
	               |			И ВыведенныеПриборыВПериоде.Район = энргОбъемНачислений.Район
	               |			И (НЕ энргОбъемНачислений.Распределение)
	               |			И ВыведенныеПриборыВПериоде.Строение = энргОбъемНачислений.Строение
	               |			И ВыведенныеПриборыВПериоде.Помещение = энргОбъемНачислений.Помещение
	               |			И ВыведенныеПриборыВПериоде.ТочкаУчета = энргОбъемНачислений.ТочкаУчета
	               |			И ВыведенныеПриборыВПериоде.ПриборУчета = энргОбъемНачислений.ПриборУчета
	               |			И (энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргНачисление)
	               |			И (энргОбъемНачислений.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	               |			И (энргОбъемНачислений.Организация = &Организация)
	               |			И (энргОбъемНачислений.Район = &Район)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыведенныеПриборыВПериоде.Организация,
	               |	ВыведенныеПриборыВПериоде.Район,
	               |	ВыведенныеПриборыВПериоде.ТочкаУчета,
	               |	ВыведенныеПриборыВПериоде.Строение,
	               |	ВыведенныеПриборыВПериоде.Помещение,
	               |	ВыведенныеПриборыВПериоде.ЧастныйСектор,
	               |	энргОбъемНачислений.Абонент
	               |
	               |ИМЕЮЩИЕ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) = ЛОЖЬ";
	
	Если НЕ ЕстьОтборЧС Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргАктивностьТочекУчета.КлючПомещения.ЧастныйСектор = &ЧастныйСектор",
		"");
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргСостояниеПриборовУчетаАбонента.КлючПомещения.ЧастныйСектор = &ЧастныйСектор",
		"");
		
	КонецЕсли;
	
	Если НЕ ЕстьОтборСтроение Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргАктивностьТочекУчета.КлючПомещения.Строение = &Строение",
		"");
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргСостояниеПриборовУчетаАбонента.КлючПомещения.Строение = &Строение",
		"");
		
	КонецЕсли;
	
	Если НЕ ЕстьОтборПомещение Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргАктивностьТочекУчета.КлючПомещения.Помещение = &Помещение",
		"");
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"И энргСостояниеПриборовУчетаАбонента.КлючПомещения.Помещение = &Помещение",
		""); 
		
	КонецЕсли;	
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	Для Каждого ПакетЗапроса из СхемаЗапроса.ПакетЗапросов Цикл
		НовыйПакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		НовыйПакет.УстановитьТекстЗапроса(ПакетЗапроса.ПолучитьТекстЗапроса());
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти