#Область События_Формы 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Договоры.Видимость 					= Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка");
	Элементы.КоличествоЗнаковПослеЗапятой.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка");
КонецПроцедуры

#КонецОбласти
