#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыОбъекта = Неопределено;
	Если Параметры.Свойство("ПараметрыОбъекта", ПараметрыОбъекта) Тогда
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыОбъекта);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.Поставщик) Тогда
		Объект.Поставщик = энргОбщегоНазначенияСерверПовтИспол.ПолучитьЗначениеКонстанты("энргПоставщикПоУмолчанию");
	КонецЕсли;
	
	ЭтоПервыйЭтап  									= Ложь;
	Если Параметры.Ключ.Пустая() и не ЗначениеЗаполнено(Параметры.Основание)  тогда
		ПервыйЭтап 									= Документы.энргЭтапПретензионноИсковойДеятельности.ПервыйЭтап_ПИД();
		Объект.ЭтапПИД							 	= ПервыйЭтап;
		ЭтоПервыйЭтап 								= Истина;
	ИначеЕсли Параметры.Ключ.Пустая() и ЗначениеЗаполнено(Параметры.Основание)и не ЗначениеЗаполнено(Объект.ЭтапПИД) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден следующий этап ПИД, создание документа отменено");
		Отказ 										= истина;
		Возврат;		
	КонецЕсли;
			
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	ВидимостьПоЭтапу(ЭтоПервыйЭтап);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСледЭтапа) Тогда
	 	ТекОбъект = РеквизитФормыВЗначение("Объект");
		ДатаСледЭтапа = ТекОбъект.ПолучитьДатуСледЭтапа();
		Если ЗначениеЗаполнено(ДатаСледЭтапа) Тогда
			Модифицированность = Истина;
			Объект.ДатаСледЭтапа = ДатаСледЭтапа;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.МКД 			= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.ЛицевойСчет 	="";
		Объект.АдресОбъекта ="";
	КонецЕсли;
	
	ЗадолженностьАбонентаСервер();	
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент,,Объект.Район,Объект.МКД,СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Печать(Команда)
	Отказ 			= Ложь;	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(Объект.Ссылка);
	ИмяМакета  		= "ПФ_MXL_" + Элементы.ФормаПечать.Заголовок;
	ТаблицаМакета 	= "Документ.энргЭтапПретензионноИсковойДеятельности";
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,ПараметрКоманды, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗадолженности(Команда) 	
	Диалог  		= Новый ДиалогРедактированияСтандартногоПериода;
	Оповещение  	= Новый ОписаниеОповещения("ВыборПериодаЗадолженностиЗавершение",ЭтотОбъект);
	Диалог.Показать(Оповещение);
КонецПроцедуры


#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборПериодаЗадолженностиЗавершение(РезультатЗакрытия,ДополнительныеПараметры) Экспорт 
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодЗадолженностиНачало 	= РезультатЗакрытия.ДатаНачала;
	Объект.ПериодЗадолженностиКонец 	= РезультатЗакрытия.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ЗадолженностьАбонентаСервер()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",	КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Район",	Объект.Район);
	Запрос.УстановитьПараметр("МКД",	Объект.МКД);
	Запрос.УстановитьПараметр("Абонент",Объект.Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргВзаиморасчетыОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчеты.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыОстатки";
	Результат  						= Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Выборка 					= Результат.Выбрать();
		Выборка.Следующий();
		Объект.СуммаЗадолженности 	= Выборка.СуммаОстаток;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ВидимостьПоЭтапу(ЭтоПервыйЭтап)
	
	СоотвествиеГрупп  					= Новый Структура;
	Менеджер  							= Справочники.энргВидыОперацийПИД;
	СоотвествиеГрупп.Вставить("ГруппаУведомление",			Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Уведомление"]);
	СоотвествиеГрупп.Вставить("ГруппаИзвещение",			Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Извещение" ]);
	СоотвествиеГрупп.Вставить("ГруппаПредупреждение",		Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Предупреждение"]);
	СоотвествиеГрупп.Вставить("ГруппаПередачаДелЮристам",	Менеджер["ЭтапПретензионноИсковойДеятельности_" + "ПередачаПакетаДокументовЮристам"]);
	СоотвествиеГрупп.Вставить("ГруппаРешениеСуда",			Менеджер["ЭтапПретензионноИсковойДеятельности_" + "РешениеСуда"]);
	СоотвествиеГрупп.Вставить("ГруппаИсполнительныйЛист",	Менеджер["ЭтапПретензионноИсковойДеятельности_" + "РегистрацияИсполнительногоЛиста"]);
	
	для Каждого КлючЗначение из СоотвествиеГрупп цикл		
		ЭлементГруппа  					= Элементы[КлючЗначение.ключ];
		ЭлементГруппа.Видимость 		= Объект.ЭтапПИД = КлючЗначение.Значение; 		
	КонецЦикла;
			
	Если ЭтоПервыйЭтап тогда
		Элементы.Основание.Видимость 	= Ложь;
	КонецЕсли;	
	
	СоотвествиеПечатныхФорм 			= Новый Соответствие;
	СоотвествиеПечатныхФорм.Вставить(Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Уведомление"],		"Уведомление");
	СоотвествиеПечатныхФорм.Вставить(Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Извещение"],		"Извещение");
	СоотвествиеПечатныхФорм.Вставить(Менеджер["ЭтапПретензионноИсковойДеятельности_" + "Предупреждение"],	"Предупреждение");
	
	СинонимПечФормы  					=  СоотвествиеПечатныхФорм.Получить(Объект.ЭтапПИД);
	Если СинонимПечФормы <>Неопределено тогда
		Элементы.ФормаПечать.Заголовок 	= СинонимПечФормы;
	иначе
		Элементы.ФормаПечать.Видимость 	= Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьГосПошлину(Команда)
	Объект.СуммаГоспошлина = энргПретензионноИсковаяДеятельностьСервер.ГосПошлина(Объект.Дата,Объект.СуммаЗадолженности);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

