#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли; 	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьСпособНачисленияПоНормативуНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	

	ЗаполнитьТекСпособРасчетаУслуги();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьСпособНачисленияПоНормативуНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если ТекСпособРасчета = Объект.СпособРасчетаНорматива Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущий способ расчета совпадает с новым");
		Отказ = Истина; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	Если не ЗначениеЗаполнено(Объект.ТочкаУчета) Тогда  
		Объект.Услуга = Неопределено;
		ТекСпособРасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	Объект.Услуга = Неопределено;
	ТекСпособРасчета = Неопределено;
	Объект.ТочкаУчета = Неопределено;
	ОрганизацияОбъектаРасчета();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияОбъектаРасчета()
	Объект.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
		СтруктураОтбора.ОбъектРасчета = Объект.ОбъектРасчета;
	Иначе
		СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	КонецЕсли;

	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		
		Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
			Объект.ТочкаУчета	= РезультатЗакрытия.ТочкаУчета;
			Объект.Услуга		= РезультатЗакрытия.Услуга;
			ЗаполнитьТекСпособРасчетаУслуги();
		Иначе
			ТекДанные.ТочкаУчета	= РезультатЗакрытия.ТочкаУчета;
			ТекДанные.Услуга		= РезультатЗакрытия.Услуга;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекСпособРасчетаУслуги()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСпособНачисленияНормативаНПСрезПоследних.СпособРасчетаНорматива КАК СпособРасчетаНорматива
		|ИЗ
		|	РегистрСведений.бестСпособНачисленияНормативаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета
		|				И Услуга = &Услуга) КАК бестСпособНачисленияНормативаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРасчета",	Объект.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Период",			Новый Граница(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район",			Объект.Район);
	Запрос.УстановитьПараметр("ТочкаУчета",		Объект.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга",			Объект.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекСпособРасчета = Выборка.СпособРасчетаНорматива;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти