
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	 ЗаполнитьНеделиЗамещенияНаСервере(ПараметрКоманды);   
	 ОбщегоНазначенияКлиент.СообщитьПользователю("Заполнение недель замещения закончено");
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции   

&НаСервере
Процедура ЗаполнитьНеделиЗамещенияНаСервере(ПроизводственныйКалендарь)  
	 РегистрыСведений.бестНеделиЗамещения.ЗаполнитьНеделиЗамещения(ПроизводственныйКалендарь);
КонецПроцедуры      

#КонецОбласти