#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему поставщики услуг МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПоставщикиУслугМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "ПоставщикиУслугМКД") Экспорт
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПоставщикиУслугМКД());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, МКД, ТочкаУчета, Услуга, ЧастьСоставной";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПоставщикиУслугМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	ПоставщикиУслугМКД.Организация КАК Организация,
	|	ПоставщикиУслугМКД.Район КАК Район,
	|	ПоставщикиУслугМКД.МКД КАК МКД,
	|	ПоставщикиУслугМКД.ТочкаУчета КАК ТочкаУчета,
	|	ПоставщикиУслугМКД.Услуга КАК Услуга,
	|	ПоставщикиУслугМКД.ЧастьСоставной КАК ЧастьСоставной,
	|	ПоставщикиУслугМКД.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних КАК ПоставщикиУслугМКД";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли