
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргСпособыРасчетаПоНаправлениям(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
	УправлениеДоступностью();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРасчетаНормативаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура НормативПоДнямПриИзменении(Элемент)
	Если НЕ Запись.НормативПоДням Тогда 
		Запись.НормативПоЧасам = Ложь;
	КонецЕсли;
	
	УправлениеДоступностью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСвойствамиЭлементовФормы

&НаКлиенте
Процедура УправлениеВидимостью()	
	//Элементы.ВидПлощади.Видимость = НЕ Запись.СпособРасчетаНорматива = ПредопределенноеЗначение("Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади");	
	ЗначениеСвойства = НЕ Запись.СпособРасчетаНорматива = ПредопределенноеЗначение("Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади");	 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидПлощади", "Видимость", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()	
	ЗначениеСвойства = Запись.НормативПоДням;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НормативПоЧасам", "Доступность", ЗначениеСвойства);
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти






