#Область ПрограммныйИнтерфейс

// Процедура - Открыть форму нового документа по виду операции
//
// Параметры:
//  ИмяДокумента - Строка 
//  ВидОперации	 - ПеречислениеСсылка.бестВидыОпераций 
//  ПрефиксФормы - Строка 
//  Параметры	 - Структура - Основание, ЗначенияЗаполнения, ЗаполнитьДокумент 
//
Процедура ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента,ВидОперации,ПрефиксФормы,Параметры) Экспорт 
	ИмяФормы  	= "Документ." + ИмяДокумента + ".Форма." + "ФормаДокумента" + ПрефиксФормы;
	Форма 		= ПолучитьФорму(ИмяФормы,Параметры);
	ДанныеФормы = ЗаполнитьДанныеФормы(Форма.объект,Новый Структура("ВидОперации",ВидОперации));
	КопироватьДанныеФормы(ДанныеФормы,Форма.объект);
	Форма.открыть();
КонецПроцедуры

// Процедура - При изменении вида операции
//
// Параметры:
//  ТипДокументаСтрока	 - Строка 
//  ОбъектФормы			 - ДанныеФормыСтруктура 
//  Ключ				 - ДокументСсылка
//
Процедура ПриИзмененииВидаОперации(ТипДокументаСтрока,ОбъектФормы,Ключ) Экспорт  
	ПрефиксФормы  			= бестРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ТипДокументаСтрока,ОбъектФормы.ВидОперации);	
	ИмяФормы				= "Документ." + ТипДокументаСтрока + ".Форма." + "ФормаДокумента" + ПрефиксФормы;
	Форма 					= ПолучитьФорму(ИмяФормы,Новый Структура("Ключ",Ключ));
	ДанныеФормы 			= ЗаполнитьДанныеФормы(Форма.объект,ОбъектФормы);
	КопироватьДанныеФормы(ДанныеФормы,Форма.объект);
	Форма.открыть();
КонецПроцедуры

#Область ВспомогательныеПроцедурыФункции

Функция ЗаполнитьДанныеФормы(Знач ДанныеФормы,Источник)
	если типЗнч(Источник) = тип("ДанныеФормыСтруктура") тогда
		Возврат Источник;
	иначе
		ЗаполнитьЗначенияСвойств(ДанныеФормы,Источник);
		Возврат ДанныеФормы;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
