#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора  		= Параметры.РежимВыбораФормы;
	Элементы.Список.МножественныйВыбор 	= Параметры.МножественныйВыборФормы;
	ЗакрыватьПриВыборе 					= не Параметры.МножественныйВыборФормы;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если  Элементы.Список.РежимВыбора тогда
		СтандартнаяОбработка 	= ложь;
		ДанныеСтроки  			= Новый Структура("Период,ПриборУчета,Показание,СостояниеПоказаний,Переворот");
		ТекСтрока  				= Элементы.Список.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
		ОповеститьОВыборе(Новый Структура("Регистратор,ДанныеСтроки",ТекСтрока.Регистратор,ДанныеСтроки));
	КонецЕсли; 	
КонецПроцедуры


#КонецОбласти
