#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаТочкиПоставкиСтроений(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаТочкиПоставкиСтроений(Схема, Регистры)
	
	ИмяРегистра = "энргТочкиПоставкиСтроений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьТочкиПоставкиНаСтроение.Дата КАК Период,
	|	энргУстановитьТочкиПоставкиНаСтроение.Район КАК Район,
	|	энргУстановитьТочкиПоставкиНаСтроение.Организация КАК Организация,
	|	энргУстановитьТочкиПоставкиНаСтроениеТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргУстановитьТочкиПоставкиНаСтроение.МКД КАК Строение
	|ИЗ
	|	Документ.энргУстановитьТочкиПоставкиНаСтроение.ТочкиПоставки КАК энргУстановитьТочкиПоставкиНаСтроениеТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьТочкиПоставкиНаСтроение КАК энргУстановитьТочкиПоставкиНаСтроение
	|		ПО энргУстановитьТочкиПоставкиНаСтроениеТочкиПоставки.Ссылка = энргУстановитьТочкиПоставкиНаСтроение.Ссылка
	|ГДЕ
	|	энргУстановитьТочкиПоставкиНаСтроение.Ссылка В(&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли