#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	бестБизнесПроцессДоговорногоБлока.ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, Ссылка);
КонецПроцедуры

Процедура ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	бестБизнесПроцессДоговорногоБлока.ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат, Ссылка);
КонецПроцедуры

Процедура ПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	бестБизнесПроцессДоговорногоБлока.ПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ, Ссылка);
КонецПроцедуры

Процедура ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	бестБизнесПроцессДоговорногоБлока.ПриВыполненииЗадачи(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти