#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет схему текущее значение порядка погашения услуг.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуТекущееЗначениеПорядкаПогашенияУслуг(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  = Новый СхемаЗапроса;
		Пакет  = Схема.ПакетЗапросов[0];
	Иначе
		Пакет  = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТекущееЗначениеПорядкаПогашенияУслуг());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Организация, Услуга";
		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1], 
			ПараметрыОтбора.ПараметрыВТ, 
			ДоступныеПараметры);		
	КонецЕсли;	
	
	ВыбиратьВсеПоля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "ВыбиратьВсеПоля", Ложь);
	Если ВыбиратьВсеПоля Тогда
		
		ВспомогательныеПоля  = "Период,НомерСтроки,Активность";
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСПоследовательностью

// Получает актуальный порядок последовательности взаиморасчетов.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция РезультатАктуальныйПорядокВзаиморасчетыПоследовательность() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАктуальныйПорядокВзаиморасчетыПоследовательность();
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТекущееЗначениеПорядкаПогашенияУслуг()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Организация КАК Организация,
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Услуга КАК Услуга,
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПорядокПогашенияУслуг
	|ИЗ
	|	РегистрСведений.энргПорядокПогашенияЗадолженности.СрезПоследних КАК энргПорядокПогашенияЗадолженностиСрезПоследних";	
	
	Возврат Текст;
	
КонецФункции

#Область РаботаСПоследовательностью

Функция ТекстЗапросаАктуальныйПорядокВзаиморасчетыПоследовательность()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Организация КАК Организация,
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Услуга КАК Услуга,
	|	энргПорядокПогашенияЗадолженностиСрезПоследних.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.энргПорядокПогашенияЗадолженности.СрезПоследних КАК энргПорядокПогашенияЗадолженностиСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ";	
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли