#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет средний объем потребления абонентов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СреднийОбъемПотребленияАбонентов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСреднийОбъемПотребленияАбонентов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ИменаТаблиц 				= Новый Структура("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		ДоступныеПараметры 				= Новый Структура;
		ДоступныеПараметры.Вставить("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		ДоступныеПараметры.Вставить("КлючиПомещений","КлючПомещения");		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"СреднийОбъемПотребления",ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет средний объем потребления абонентов коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СреднийОбъемПотребленияАбонентовКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаСреднийОбъемПотребленияАбонентовКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "СреднийОбъемПотребленияАбонентов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

// Актуализирует данные среднего объема.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ЧастныйСектор		-	Булево.
//  Строение			-	СправочникСсылка.энргСтроения.
//  Помещение			-	СправочникСсылка.энргПомещения.
//
Процедура АктуализироватьДанныеСреднегоОбъема(Организация, ПериодНачисления,Район,ЧастныйСектор=Неопределено,Строение=Неопределено,Помещение=Неопределено) Экспорт 
	
	Набор  		= СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Если НЕ ЧастныйСектор = Неопределено Тогда
		Набор.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	КонецЕсли;
	
	Если НЕ Строение = Неопределено Тогда
		Набор.Отбор.Строение.установить(Строение);
	КонецЕсли;
	
	Если НЕ Помещение = Неопределено Тогда 
		Набор.Отбор.Помещение.установить(Помещение);
	КонецЕсли;  
	
	//Набор.Записать();
	
	Результат   = РегистрыСведений.энргРасчетСреднегоОбъема.РезультатРассчетаСреднегоОбъемаПотребленияАбонентов(Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение);
	//Выборка 	= Результат.Выбрать();
	//Набор  		= СоздатьНаборЗаписей();
	//Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	//Пока Выборка.следующий() цикл
	//	ЗаполнитьЗначенияСвойств(Набор.Добавить(),Выборка);		
	//КонецЦикла;
	//Набор.Записать(Ложь);
	
	Набор.Загрузить(Результат.Выгрузить());
	Набор.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса на получение среднего объема потребления абонентов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСреднийОбъемПотребленияАбонентов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребления.Организация КАК Организация,
	|	СреднийОбъемПотребления.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребления.Район КАК Район,
	|	КлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	СреднийОбъемПотребления.ЧастныйСектор КАК ЧастныйСектор,
	|	СреднийОбъемПотребления.Строение КАК Строение,
	|	СреднийОбъемПотребления.Помещение КАК Помещение,
	|	СреднийОбъемПотребления.Услуга КАК Услуга,
	|	СреднийОбъемПотребления.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребления.Шкала КАК Шкала,
	|	СреднийОбъемПотребления.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребления.Объем КАК Объем,
	|	СреднийОбъемПотребления.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК СреднийОбъемПотребления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|		ПО СреднийОбъемПотребления.Строение = КлючиПомещений.Строение
	|			И СреднийОбъемПотребления.Помещение = КлючиПомещений.Помещение";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса на получение среднего объема потребления абонентов коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТексЗапросаСреднийОбъемПотребленияАбонентовКоллекцияПериодов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	СреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	СреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	СреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	СреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	СреднийОбъемПотребленияАбонентов.Услуга КАК Услуга,
	|	СреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	СреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребленияАбонентов.Объем КАК Объем,
	|	СреднийОбъемПотребленияАбонентов.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК СреднийОбъемПотребленияАбонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО СреднийОбъемПотребленияАбонентов.Организация = ТаблицаПериодов.Организация
	|			И СреднийОбъемПотребленияАбонентов.Район = ТаблицаПериодов.Район
	|			И СреднийОбъемПотребленияАбонентов.ПериодНачисления = ТаблицаПериодов.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли