#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный		= Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",Истина);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",Истина);
	ДополнительныеСвойства.Вставить("ПараметрыПроведения",Новый Структура());
	// ДополнительныеСвойства.вставить("ДанныеОплаты",ДанныеОплаты());
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если не ДополнительныеСвойства.ЭтоНовый и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		НаборОтложенныхДвижений  			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();	
		НаборОтложенныхДвижений.Отбор.Докрегистратор.установить(Ссылка);
		НаборОтложенныхДвижений.Записать();
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли