
#Область СобытияЭлементовШапки

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ТочкиПоставки.Очистить();
	Схема  							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("МКД", 			"МКД"), 		Неопределено));
	
	пПараметрыВыбора	 				= Новый Структура("ПараметрыВТ", ПараметрыВТ);
	
	пПараметрыВыбора.Вставить("Период", Новый Структура("ИмяПараметра","Период"));

	
	РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,пПараметрыВыбора);
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Объект.Дата);
	ПараметрыЗапроса.Вставить("Район",			Объект.Район);
	ПараметрыЗапроса.Вставить("Организация",	Объект.Организация);  
	ПараметрыЗапроса.Вставить("МКД",			Объект.МКД);

	РезультатЗапроса 					= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.ТочкиПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти
