#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область Проведение
 
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  	= Новый Структура;
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаНастройкиДиапазоновДифференцированногоТарифа(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры = Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры
 	
#КонецОбласти

Процедура ЕстьДубликатДокумента(ОсновныеРеквизиты) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргУстановитьДиапазоныДифференцированногоТарифа.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргУстановитьДиапазоныДифференцированногоТарифа КАК энргУстановитьДиапазоныДифференцированногоТарифа
		|ГДЕ
		|	энргУстановитьДиапазоныДифференцированногоТарифа.Дата = &Дата
		|	И энргУстановитьДиапазоныДифференцированногоТарифа.Организация = &Организация
		|	И энргУстановитьДиапазоныДифференцированногоТарифа.Район = &Район
		|	И энргУстановитьДиапазоныДифференцированногоТарифа.Услуга = &Услуга
		|	И НЕ энргУстановитьДиапазоныДифференцированногоТарифа.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОсновныеРеквизиты.Ссылка);
	Запрос.УстановитьПараметр("Дата", ОсновныеРеквизиты.Дата);
	Запрос.УстановитьПараметр("Организация", ОсновныеРеквизиты.Организация);
	Запрос.УстановитьПараметр("Район", ОсновныеРеквизиты.Район);
	Запрос.УстановитьПараметр("Услуга", ОсновныеРеквизиты.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = НЕ РезультатЗапроса.Пустой();
	
	Если Результат Тогда 
		Комментарий = "Документ с такими параметрами уже существует";
		
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаНастройкиДиапазоновДифференцированногоТарифа(Схема, Регистры)
	
	ИмяРегистра = "энргНастройкаДиапазоновДифференцированногоТарифа";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Услуга КАК Услуга,
	|	ТаблицаДиапазоныДифференцированныхТарифов.Диапазон.Приоритет КАК ИдентификаторСтроки,
	|	ТаблицаРазрезыДиапазонов.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ТаблицаДиапазоныДифференцированныхТарифов.Диапазон КАК Диапазон,
	|	ТаблицаДиапазоныДифференцированныхТарифов.От КАК От,
	|	ТаблицаДиапазоныДифференцированныхТарифов.До КАК До
	|ИЗ
	|	Документ.энргУстановитьДиапазоныДифференцированногоТарифа КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДиапазоныДифференцированногоТарифа.РазрезыДиапазонов КАК ТаблицаРазрезыДиапазонов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДиапазоныДифференцированногоТарифа.ДиапазоныДифференцированныхТарифов КАК ТаблицаДиапазоныДифференцированныхТарифов
	|			ПО ТаблицаРазрезыДиапазонов.Ссылка = ТаблицаДиапазоныДифференцированныхТарифов.Ссылка
	|				И ТаблицаРазрезыДиапазонов.ИдентификаторСтроки = ТаблицаДиапазоныДифференцированныхТарифов.ИдентификаторСтроки
	|				И (ТаблицаДиапазоныДифференцированныхТарифов.Ссылка В (&мДокументы))
	|		ПО Шапка.Ссылка = ТаблицаРазрезыДиапазонов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаРазрезыДиапазонов.Ссылка В (&мДокументы))");
				
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти  

#КонецЕсли