#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргИзменитьТипСтроения(ЭтотОбъект);
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			УстановитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьПараметрыВыбораСтроения(); 	 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитов

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьПредыдущийТипСтроения();
КонецПроцедуры
	
#КонецОбласти 

#Область ВспомогательныеМетоды

&НаСервере
Процедура УстановитьПараметрыВыбораСтроения()
	МассивДоступныхСтроений = Новый Массив;	
	ТипыСтроений 			= Перечисления.энргТипыСтроений;
	ЗначениеМКД				= ТипыСтроений.МКД;
	
	Для Каждого ТекЗначение из ТипыСтроений Цикл
		Если ТекЗначение = ЗначениеМКД Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивДоступныхСтроений.Добавить(ТекЗначение);
	КонецЦикла; 	
	
	НовыеЗначения 		= Новый ФиксированныйМассив(МассивДоступныхСтроений);	
	НовыйПараметр	 	= Новый ПараметрВыбора("Отбор.ТипСтроения", НовыеЗначения);
	
	НовыйМассив 		= Новый Массив;	
	НовыйМассив.Добавить(НовыйПараметр);
	
	ЗначениеСвойства 	= Новый ФиксированныйМассив(НовыйМассив);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Строение", "ПараметрыВыбора", ЗначениеСвойства);
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодНачисления()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПредыдущийТипСтроения()	
	Результат 						= Обработки.энргСтроенияМенеджер.ЗначенияСвойствОбъекта(Объект.МКД, "ТипСтроения");
	Объект.ПредыдущийТипСтроения 	= Результат.ТипСтроения;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти