#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСПоследовательностью

Функция ИзменитьЗадолженность(Знач ТекущееСостояниеЗадолженности, Знач ДанныеДокумента) Экспорт 
	СостояниеЗадолженности = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ТекущееСостояниеЗадолженности);
	Возврат СостояниеЗадолженности; 
КонецФункции

Функция СформироватьНаборыДляЗаписи(Знач ИсходноеСостояние, Знач ТекущееСостояниеЗадолженности) Экспорт 
	
КонецФункции

Процедура ЗаполнитьЗадолженностьНаГраницуНарушенияПоследовательности(МВТ,СостояниеЗадолженностиВсехАбонентов, Знач ИмяТаблицы, Знач ОписаниеСостояниеЗадолженности) Экспорт  
	Результат   			= МВТ.Таблицы[ИмяТаблицы].ПолучитьДанные();
	Выборка 				= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СостояниеЗадолженностиВсехАбонентов[Выборка.Абонент] = Неопределено Тогда
			СостояниеЗадолженностиВсехАбонентов.Вставить(Выборка.Абонент, ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ОписаниеСостояниеЗадолженности));			
		КонецЕсли;
		
		ПеняПоМесяцам 	= СостояниеЗадолженностиВсехАбонентов[Выборка.Абонент].ПеняПоМесяцам;
		ЗаполнитьЗначенияСвойств(ПеняПоМесяцам.Добавить(), Выборка);		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеВсехДокументовИзмененияЗадолженности(МВТ, ДанныеИзмененияЗадолженностиВсехДокументов, Знач ИмяТаблицы, Знач ДанныеДокументаИзмененияЗадолженности) Экспорт  
	Результат   					= МВТ.Таблицы[ИмяТаблицы].ПолучитьДанные();
	Выборка 						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент] = Неопределено Тогда
			СоотвествиеРегистратор  = Новый Соответствие;
			СоотвествиеРегистратор.Вставить(Выборка.Регистратор,  ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеДокументаИзмененияЗадолженности));
			ДанныеИзмененияЗадолженностиВсехДокументов.Вставить(Выборка.Абонент, СоотвествиеРегистратор);		
		ИначеЕсли ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент][Выборка.Регистратор] = Неопределено Тогда
			 ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент].Вставить(Выборка.Регистратор, ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеДокументаИзмененияЗадолженности));
		КонецЕсли;		
		НачисленияПени 				= ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент][Выборка.Регистратор].НачисленияПени;
		ЗаполнитьЗначенияСвойств(НачисленияПени.Добавить(), Выборка);		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти