#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗначениеФункциональнойОпции(ИмяОпции, Параметры = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКонстантыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКонстантыМенеджер"].ЗначениеФункциональнойОпции(ИмяОпции, Параметры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= энргОбщегоНазначения.ЗначениеФункциональнойОпции(ИмяОпции,Параметры);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат("ЗначениеФункциональнойОпции." + ИмяОпции, Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКонстантыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКонстантыМенеджер"].ЗначениеКонстанты(ИмяКонстанты);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= энргОбщегоНазначения.ЗначениеКонстанты(ИмяКонстанты);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат("ЗначениеКонстанты." + ИмяКонстанты + "", Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли