#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСУслугамиМКД(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		ИспользоватьШкалыПриборовУчета 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		
		ЗаполнитьПризнакРаспределения();
		ПоказатьУзлы();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	

	// СтандартныеПодсистемы.ДатыЗапретаИзменения 	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ЗаполнитьСвойстваТочекУчета(ТекущийОбъект); 	
		ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	иначе
		энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	КонецЕсли; 	
	
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	
	ЗаполнитьПризнакРаспределения();
	ПоказатьУзлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалитьНезначащиеСтрокиВТочкахПоставок();
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);		
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект); 	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);		
		энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			
			// Теперь это для узлов --
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			// --Теперь это для узлов					
			
		КонецЦикла;
		
		Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
			
			Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
				СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
			КонецЕсли;			
			
		КонецЦикла;
		 		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		
		////БЫЛО-->
		//НовыеТочкиУчета						= Новый Массив;
		//НовыеПриборыУчета 					= Новый Массив;
		//
		//Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
		//	Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
		//		СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;
		//	
		//	Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
		//		СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;			
		//КонецЦикла;
		//
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
	//	НЗаписиТЧ=Объект.ТочкиУчета.Количество();
	//
	//Если НЗаписиТЧ=0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Табличная часть должна содержать как минимум одну запись");
	//	Отказ=Истина;		
	//КонецЕсли;
	
	//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета",Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	 		
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ЗаполнитьСвойстваТочекУчета(ТекущийОбъект); 	
		ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	иначе
		энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	КонецЕсли;
	
	ПоказатьУзлы();
	
КонецПроцедуры

//УЗЛЫ 

&НаСервере
Процедура ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СоответствиеСтрок 				= Новый Соответствие; 
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		
		СоответвиеПрибора 					= Новый Соответствие;
		
		Сч 									= 0;
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			СтрокаОбъекта 	= Объект.ТочкиУчета[Сч];
			
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;			
			
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответвиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
			
			Сч 				= Сч + 1;
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответвиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;				
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда				
		НовыеТочкиУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеТочкиУчета") Тогда
			НовыеТочкиУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеТочкиУчета;
		КонецЕсли;
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			ЗаполнитьДанныеТочкиВСтроке(Отказ, НовыеТочкиУчета, СтрокаТочки.ТочкаУчета, СтрокаТочки.ОписаниеТочки, СтрокаТочки.НомерСтроки);
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла; 		
	КонецЕсли;
	
КонецПроцедуры

//УЗЛЫ

#КонецОбласти

#Область РаботаСТочкамиУчета

Процедура УдалитьНезначащиеСтрокиВТочкахПоставок()
	энргРаботаСТочкамиУчетаСервер.УдалитьНезначащиеСтрокиВТочкахПоставок(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваТочекУчета(Знач ТекущийОбъект)
		
	ПолучаемыеСвойстваТочекУчета 	= ПолучаемыеСвойстваТочекУчета();
	//"
	//|Наименование,Расположение";
	мТочкиУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
	СвойстваТочекУчета 				= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов(мТочкиУчета, ПолучаемыеСвойстваТочекУчета);
	
	СоотвествиеРеквизитовСвойств 	= СоотвествиеРеквизитовСвойствамТочкиУчета();
	//Новый Структура("НаименованиеТочки, Расположение", "Наименование", "Расположение");
	
	ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Объект.ТочкиУчета,"Объект.ТочкиУчета", СвойстваТочекУчета, ПолучаемыеСвойстваТочекУчета,СоотвествиеРеквизитовСвойств);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Коллекция, ПутьКРеквизитуКоллекции, СвойстваТочекУчета, ЗаполняемыеСвойства, СоотвествиеРеквизитовСвойств)
					
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ТочкаУчета) Тогда
			СвойстваТочкиУчета 									= СвойстваТочекУчета[СтрокаКоллекции.ТочкаУчета];		
		Иначе
			СвойстваТочкиУчета 									= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеТочки);
		КонецЕсли; 
		
		Если СвойстваТочкиУчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваТочкиУчета.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваТочкиУчета[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучаемыеСвойстваТочекУчета() 
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение,Головная";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамТочкиУчета()
	Возврат Новый Структура("НаименованиеТочки,Расположение,Головная","Наименование","Расположение","Головная");
КонецФункции


&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);	
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТочкиВСтроке(Отказ,Знач НовыеТочкиУчета, Знач ТочкаУчета, Знач ОписаниеТочки, Знач НомерСтроки)
		
	ЭтоНоваяТочка 										= НЕ НовыеТочкиУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаТочкиУчета 							= Обработки.энргТочкиУчетаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовТочкиУчета						= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеТочки);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовТочкиУчета Цикл
		Если ОписаниеОбъектаТочкиУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаТочкиУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаТочкиУчета.Ссылка 					= ТочкаУчета;
	Если НЕ Обработки.энргТочкиУчетаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаТочкиУчета,ЭтоНоваяТочка) Тогда
		Отказ											= Истина;
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область РаботаСПриборамиУчета 

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета()
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции


&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();
	//"
	//|Код,ТипПрибораУчета,ВидКанальности,ТипУзлаУчета,РегистрируетОбъем,
	//|КодАСКУЭ,СобственникАСКУЭ,СобственникСИ,РасположениеИзмерителя,СистемаУчетаЭлектроэнергии";
	СоотвествиеРеквизитовСвойств 	=  СоотвествиеРеквизитовСвойствамПрибораУчета();
	//Новый Структура("ЗаводскойНомер, ТипПрибораУчета, ВидКанальности, РасположениеИзмерителя", "Код", "ТипПрибораУчета", "ВидКанальности", "РасположениеИзмерителя");
		
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,"Объект.ТочкиУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);
	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ПриборыУзловУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ПриборыУзловУчета,"Объект.ПриборыУзловУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, "Объект.Измерители", СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,ПутьКРеквизитуКоллекции ,СвойстваПриборовУчета, ЗаполняемыеСвойства, СоотвествиеРеквизитовСвойств) 
		
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора = СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора = Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьПризнакРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
	
	ЗаполнитьПризнакРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОперацияСУслугамиМКД",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаРаспределятьНаАбонентовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРаспределятьНаАбонентовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент) Экспорт 
	 ТочкиУчетаПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер() 	
	энргРаботаСЛицевымСчетомСервер.ОбновитьВидыБлагоустройстваТарифныеКатегории(ЭтотОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ОбновитьЗначениеПлощадей(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	//
	//энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	
	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);


	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	ДопПараметры.Вставить("IDСтроки", ТекущиеДанные.IDСтроки);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ДополнительныеПараметры.ТекущиеДанные);
			энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ДополнительныеПараметры.IDСтроки,Объект);
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);
			ТочкиУчетаПриИзмененииСервер();
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		//ТекущиеДанные  							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные  							= Элементы.ТочкиУчета.ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";// + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
	
	ТекущиеДанные.РаспределятьНаАбонентов = ПолучитьПризнакРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыВидыБлагоустройстваТарифныеКатегории

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаименование(ТекДанные)		
	ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЗаполнитьПризнакРаспределения()
	ПризнакРаспределенияНаАбонентов = ПолучитьПризнакРаспределения();
КонецФункции

&НаСервере
Функция ПолучитьПризнакРаспределения()
	Возврат РегистрыСведений.энргФормыУправленияМКД.ПолучитьПризнакРаспределения(Объект.Дата, Новый Структура("Организация, Район, МКД", Объект.Организация, Объект.Район, Объект.МКД));
КонецФункции

#КонецОбласти

#Область РаботаСУзлами

&НаКлиенте
Процедура РедактироватьТочкиУчета(Команда)
	энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуРедактированияУслугМКД(энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияУслугМКД(ЭтотОбъект));
КонецПроцедуры

// В дальнейшем удалится 
&НаСервере
Процедура ПоказатьУзлы()
	Если НЕ энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		Возврат
	КонецЕсли;
	
	ПрефиксТочекУчета = "";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДанныеУзла", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьТочкиУчета", "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДобавитьПриборыУчета", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныГруппа2", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа2", "Видимость", Ложь); 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа1", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныГруппа1", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаТипУзлаУчета", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДобавить", "Видимость", Ложь);
	
	// ДОП
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаНетШкалНетТарифныхЗонГруппа7", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаНетШкалНетТарифныхЗонГруппа9", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаНетШкалНетТарифныхЗонГруппа9", "Видимость", Ложь);
	
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстовыеПоляКоллекцииМКД(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти


#Область РаботаСТочкамиПоставок

&НаКлиенте
Процедура ТочкиПоставокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекущиеДанные.IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите точку учета");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТаблицаТочкиПоставок	= Элементы.ТочкиПоставок;	
	ТекущиеДанные 			= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаТочкиПоставок,"IDСтроки",ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокТочкаПоставкиПриИзменении(Элемент)
	ИмяТаблицыТочек = "ТочкиУчета";
	ТекущиеДанные 	= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДанныеРасположения = энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстДанныеРасположения(ТекущиеДанные);
КонецПроцедуры 

#КонецОбласти

#Область Работа_с_благоустройством

////////////////////////////////////////////////////////////////////////////
/////// ВЫБОР ВИДА БЛАГОУСТРОЙСТВ

//&НаКлиенте
//Процедура ВидыБлагоустройстваТарифныеКатегорииВидБлагоустройстваИндивидуальный5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	ВыбратьВидыБлагоустройстваНачалоВыбора(СтандартнаяОбработка, Элемент, Элементы.ВидыБлагоустройстваТарифныеКатегории5.ТекущиеДанные, "ВидБлагоустройстваИндивидуальный");
//КонецПроцедуры

//&НаКлиенте
//Процедура ВидыБлагоустройстваТарифныеКатегорииВидБлагоустройстваОбщедомовой5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	ВыбратьВидыБлагоустройстваНачалоВыбора(СтандартнаяОбработка, Элемент, Элементы.ВидыБлагоустройстваТарифныеКатегории5.ТекущиеДанные, "ВидБлагоустройстваОбщедомовой");
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьВидыБлагоустройстваНачалоВыбора(СтандартнаяОбработка, Элемент, ТекущиеДанные, ИмяРеквизита)
//	СтандартнаяОбработка 	= Ложь;
//	
//	Если ИмяРеквизита = "ВидБлагоустройстваИндивидуальный" Тогда
//		Поиск = ВидыБлагоустройствДляОтбора.НайтиСтроки(Новый Структура("ТипВидаБлагоустройства", ПредопределенноеЗначение("Перечисление.рксТипыВидовБлагоустройства.Индивидуальный")));
//	Иначе
//		Поиск = ВидыБлагоустройствДляОтбора.НайтиСтроки(Новый Структура("ТипВидаБлагоустройства", ПредопределенноеЗначение("Перечисление.рксТипыВидовБлагоустройства.Общедомовой")));
//	КонецЕсли;
//	
//	Массив					= новый Массив;
//	//Для Каждого ТекСтр из ВидыБлагоустройствДляОтбора Цикл
//	Для Каждого ТекСтр из Поиск Цикл
//		Массив.Добавить(ТекСтр.ВидБлагоустройства);
//	КонецЦикла;
//	
//	ЗначениеОтбора 		= Новый Структура("Ссылка"	, Массив);
//	ПараметрыДляОтбора 	= Новый Структура("Отбор"	, ЗначениеОтбора); 

//	ДопПараметры 		= Новый Структура("ТекущиеДанные, ИмяРеквизита", ТекущиеДанные, ИмяРеквизита);
//	Оповещение 			= Новый ОписаниеОповещения("ВыборВидБлагоустройстваЗавершение", ЭтотОбъект, ДопПараметры);
//	ОткрытьФорму("Справочник.энргВидыБлагоустройств.ФормаВыбора", ПараметрыДляОтбора, Элемент,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборВидБлагоустройстваЗавершение(Результат, ДопПараметры) Экспорт
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;	
//	
//	ДопПараметры.ТекущиеДанные[ДопПараметры.ИмяРеквизита] = Результат;
//	
//КонецПроцедуры

//&НаСервере
// Процедура УстановитьДоступныеВидыБлагоустройств() //khavin 16.11.20
//	Запрос = Новый Запрос;
//	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	                |	рксВидыБлагоустройствДополнительныеРеквизиты.ВидБлагоустройства КАК ВидБлагоустройства,
//	                |	рксВидыБлагоустройствДополнительныеРеквизиты.ТипБлагоустройства КАК ТипВидаБлагоустройства
//	                |ИЗ
//	                |	РегистрСведений.рксВидыБлагоустройствДополнительныеРеквизиты КАК рксВидыБлагоустройствДополнительныеРеквизиты
//	                |ГДЕ
//	                |	рксВидыБлагоустройствДополнительныеРеквизиты.ТипСтроения.Ссылка = &Ссылка
//	                |	И рксВидыБлагоустройствДополнительныеРеквизиты.ВидБлагоустройства В(&ВидБлагоустройства)";
//	Запрос.УстановитьПараметр("Ссылка", Перечисления.энргТипыСтроений.МКД);
//	Запрос.УстановитьПараметр("ВидБлагоустройства", ВидыБлагоустройствДляОтбора.Выгрузить().ВыгрузитьКолонку("ВидБлагоустройства"));
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	ВидыБлагоустройствДляОтбора.Загрузить(РезультатЗапроса);
//КонецПроцедуры

////////////////////////////////////////////////////////////////////////////
/////// ВЫБОР ТАРИФНОЙ КАТЕГОРИИ

//&НаКлиенте
//Процедура ВидыБлагоустройстваТарифныеКатегорииТарифнаяКатегория5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка 	= Ложь;
//	ТекущиеДанные 			= Элементы.ВидыБлагоустройстваТарифныеКатегории5.ТекущиеДанные;
//	
//	ЗначениеОтбора 		= Новый Структура("Ссылка"	, ПолучитьТарифныеКатегорииПоВидуБлагоустройства(ТекущиеДанные.ВидБлагоустройстваОбщедомовой));
//	ПараметрыДляОтбора 	= Новый Структура("Отбор, РежимОтображения"	, ЗначениеОтбора, ОтображениеТаблицы.Список); 

//	ДопПараметры 		= Новый Структура("ТекущиеДанные, ИмяРеквизита", ТекущиеДанные, "ТарифнаяКатегория");
//	Оповещение 			= Новый ОписаниеОповещения("ВыборТарифныеКатегорииЗавершение", ЭтотОбъект, ДопПараметры);
//	ОткрытьФорму("Справочник.энргГруппыПотребителей.ФормаВыбора", ПараметрыДляОтбора, Элемент,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборТарифныеКатегорииЗавершение(Результат, ДопПараметры) Экспорт
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;	
//	
//	ДопПараметры.ТекущиеДанные[ДопПараметры.ИмяРеквизита] = Результат;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьТарифныеКатегорииПоВидуБлагоустройства(ВидБлагоустройства)
//	
//	РезультатЗапроса 	= РегистрыСведений.энргТарифныеКатегорииВидовБлагоустройств.ПолучитьДанныеПоОтборам(Новый Структура("ВидБлагоустройства", ВидБлагоустройства));
//	Массив				= Новый Массив;
//	Выборка				= РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Массив.Добавить(Выборка.ТарифнаяКатегория);
//	КонецЦикла;
//	
//	Возврат Массив;
//	
//КонецФункции

////////////////////////////////////////////////////////////////////////////
/////// При изменении списка благоустройств

//&НаКлиенте
//Процедура БлагоустройстваПослеУдаления(Элемент)
//	ПриИзмененииСпискаБлагоустройствНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура БлагоустройстваБлагоустройствоПриИзменении(Элемент)
//	ПриИзмененииСпискаБлагоустройствНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииСпискаБлагоустройствНаСервере()
//	Справочники.энргВидыБлагоустройств.ЗаполнитьВидыБлагоустройств(ЭтотОбъект, "Благоустройства", "ВидыБлагоустройствДляОтбора");
//	УстановитьДоступныеВидыБлагоустройств(); //khavin 16.11.20
//КонецПроцедуры

////////////////////////////////////////////////////////////////////////////
/////// Проверка соответствий благоустройств

//&НаСервере
//Процедура ПроверитьСоответствияБлагоустройств(Отказ)
//	
//	МассивИдивидуальных 	= Новый Массив;
//	МассивОбщедомовых 		= Новый Массив;
//	МассивБлагоустройств 	= Новый Массив;
//	
//	Для Каждого ТекВид Из Объект.ВидыБлагоустройстваТарифныеКатегории Цикл
//		МассивИдивидуальных.Добавить(ТекВид.ВидБлагоустройстваИндивидуальный);
//		МассивОбщедомовых.Добавить(ТекВид.ВидБлагоустройстваОбщедомовой);
//	КонецЦикла;
//	
//	Для Каждого ТекБлаго Из Благоустройства Цикл
//		МассивБлагоустройств.Добавить(ТекБлаго.Благоустройство);
//	КонецЦикла;
//	
//	Справочники.энргВидыБлагоустройств.ПроверитьСоответствияБлагоустройств(Отказ, МассивБлагоустройств, МассивИдивидуальных);
//	Если НЕ Отказ Тогда
//		Справочники.энргВидыБлагоустройств.ПроверитьСоответствияБлагоустройств(Отказ, МассивБлагоустройств, МассивОбщедомовых);
//	КонецЕсли;
//	
//	Если Отказ Тогда 
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Виды благоустройства не соответствуют благоустройствам");
//	КонецЕсли;
//	
//КонецПроцедуры


#КонецОбласти
