#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗадолженности = Неопределено;
	СписокПараметры		= Новый Структура;
	Список.Параметры.УстановитьЗначениеПараметра("Организация",	Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Район",		Параметры.Район);
	Список.Параметры.УстановитьЗначениеПараметра("Задача",		Параметры.Задача);
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата",		ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("МКД",		Параметры.МКД);
	Список.Параметры.УстановитьЗначениеПараметра("Абонент",	Параметры.Абонент);

	Если Не Параметры.Свойство("СписокЗадолженности", СписокЗадолженности) Или Не ЗначениеЗаполнено(СписокЗадолженности)  Тогда
		Список.ПарамеЕтры.УстановитьЗначениеПараметра("ПериодНачисления_1",	NULL);
		Список.Параметры.УстановитьЗначениеПараметра("Услуга_1",			NULL);
	Иначе
		Сч = 1;
		ДополнениеЗапроса = Символы.ПС;
		
		Для каждого ТекДолг Из СписокЗадолженности Цикл
			Постфикс = "_" + Формат(Сч, "ЧГ=0");
			
			СписокПараметры.Вставить("ПериодНачисления" + Постфикс,	ТекДолг.ПериодНачисления);
			СписокПараметры.Вставить("Услуга" + Постфикс,			ТекДолг.Услуга);
			
			Если Сч > 1 Тогда
			
				ДополнениеЗапроса = ДополнениеЗапроса + Символы.ПС +
					"ОБЪЕДИНИТЬ ВСЕ
					|
					|	ВЫБРАТЬ
					|		&ПериодНачисления" + Постфикс + ",
					|		&Услуга" + Постфикс;
			КонецЕсли;
			
			Сч = Сч + 1;
		КонецЦикла;
		
	    СтрЗамены = "ПОМЕСТИТЬ ВТ_ЗадолженностьЗадачи";
		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, СтрЗамены, СтрЗамены + ДополнениеЗапроса);		
	КонецЕсли;
	
	Для каждого ТекПарам Из СписокПараметры Цикл
		Список.Параметры.УстановитьЗначениеПараметра(ТекПарам.Ключ, ТекПарам.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбраннаяЗадолженность = Новый Массив;
	
	Для каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Долг = Новый Структура("Услуга, ПериодНачисления, Задолженность");
	    ЗаполнитьЗначенияСвойств(Долг, ТекСтрока);
		
		ВыбраннаяЗадолженность.Добавить(Долг);
	КонецЦикла;
	
	Закрыть(ВыбраннаяЗадолженность);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраннаяЗадолженность = Новый Массив;
	
	Долг = Новый Структура("Услуга, ПериодНачисления, Задолженность");
	ЗаполнитьЗначенияСвойств(Долг, ВыбраннаяСтрока);
	ВыбраннаяЗадолженность.Добавить(Долг);
	Закрыть(ВыбраннаяЗадолженность);
КонецПроцедуры

#КонецОбласти