#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает тарифные группы текущии значения.
//
// Параметры:
//  СвойстваОтбора	-	Структура.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргГруппыПотребителей.
//
Функция ТарифныеГруппыТекущийЗначений(СвойстваОтбора) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжЗначениеТарифовМенеджер") = Неопределено Тогда
				Возврат Обработки["слжЗначениеТарифовМенеджер"].ТарифныеГруппыТекущийЗначений(СвойстваОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Схема  							= Неопределено;
	
	ПараметрыЗапроса 				= Новый Структура;	
	СоотвествиеПолей 				= Новый Структура;
	
	Если СвойстваОтбора.Свойство("Организация") Тогда
		СоотвествиеПолей.Вставить("Организация", "Организация");
		ПараметрыЗапроса.Вставить("Организация", СвойстваОтбора.Организация);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Район") Тогда
		СоотвествиеПолей.Вставить("Район", "Район");
		ПараметрыЗапроса.Вставить("Район", СвойстваОтбора.Район);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("ГруппаПотребителей") Тогда
		СоотвествиеПолей.Вставить("ГруппаПотребителей", "ГруппаПотребителей");
		ПараметрыЗапроса.Вставить("ГруппаПотребителей", СвойстваОтбора.ГруппаПотребителей);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Услуга") Тогда
		СоотвествиеПолей.Вставить("Услуга", "Услуга");
		ПараметрыЗапроса.Вставить("Услуга", СвойстваОтбора.Услуга);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Поставщик")  Тогда
		СоотвествиеПолей.Вставить("Поставщик", "Поставщик");
		ПараметрыЗапроса.Вставить("Поставщик", СвойстваОтбора.Поставщик);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("ТарифнаяЗона") Тогда
		СоотвествиеПолей.Вставить("ТарифнаяЗона", "ТарифнаяЗона");
		ПараметрыЗапроса.Вставить("ТарифнаяЗона", СвойстваОтбора.ТарифнаяЗона);
	КонецЕсли;

	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрыСхемы 					= Новый Структура("ПараметрыВТ", ПараметрыВТ);
	Если СвойстваОтбора.Свойство("Период") Тогда
		ПараметрыСхемы.Вставить("Период",энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
		ПараметрыЗапроса.Вставить("Период", СвойстваОтбора.Период);
	КонецЕсли;
	
	РегистрыСведений.энргЗначенияТарифов.ЗаполнитьСхемуТарифныеГруппыТекущийЗначений(Схема,ПараметрыСхемы,"");
	  	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Результат 						= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппаПотребителей");	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "слжЗначениеТарифовМенеджер.ТарифныеГруппыТекущийЗначений";
		ПараметрыМетода 			= Новый Структура("СвойстваОтбора", СвойстваОтбора);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли