#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район);
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
	ЗаполнитьДокумент  								= Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент 						= истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) тогда
		ЗаполнитьДокумент 						= истина;		  
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Абонент") тогда
		ЗаполнитьДокумент 							= истина;
		ДанныеАбонента								= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Абонент,Новый ФиксированнаяСтруктура("Район,Организация,МКД,ЛицевойСчет"));
		
		Объект.Район 								= ДанныеАбонента.Район;
		Объект.Организация 							= ДанныеАбонента.Организация;
		Объект.МКД 									= ДанныеАбонента.МКД;
		Объект.ЛицевойСчет							= ДанныеАбонента.ЛицевойСчет;
		Объект.АдресОбъекта 						= УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Объект.Абонент,Справочники.ВидыКонтактнойИнформации.АдресОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Абонент) и ЗаполнитьДокумент тогда
		Если не ЗначениеЗаполнено(Объект.Дата) тогда
			Объект.Дата 							= ТекущаяДата();
		КонецЕсли;		
		ЗаполнитьДанныеАбонентаСервер();
	КонецЕсли; 		
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) тогда
		//Объект.ВидОплаты 							= Перечисления.ФормыОплаты.Наличные;
	КонецЕсли;      	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
		
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПересчитатьСуммуКОплате();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.МКД,Объект.Абонент);
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли;

	ЗаполнитьДанныеПриборовУчета();	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(Объект);
	иначе
		Объект.МКД 			= ПредопределенноеЗначение("Справочник.энргМногоквартирныеДома.ПустаяСсылка");
		Объект.ЛицевойСчет 	="";
		Объект.АдресОбъекта ="";
	КонецЕсли;
	
	ЗаполнитьДанныеАбонентаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент,Объект.Организация,Объект.Район,Объект.МКД,СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ФискальнаяОперацияСтатусОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета,Неопределено,ТекДанные); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,Объект.Дата,Объект.Район,Объект.Абонент,СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(ТекущаяСтрока.IDСтроки, ТекущаяСтрока.ВидДифференцированности);
	ОтборВТарифныхЗонах(ТекущаяСтрока.IDСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаНовыеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура ВыбратьПериодОплаты(Команда)
	
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыбратьПериодОплатыЗавершение",ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = Объект.ПериодОплатыНачало;
	Диалог.Период.ДатаОкончания = Объект.ПериодОплатыКонец;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодОплатыЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт 
	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодОплатыНачало 	= ИнтервалУстановлен.ДатаНачала;
	Объект.ПериодОплатыКонец 	= ИнтервалУстановлен.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеАбонентаСервер(); 	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначения(Команда)
	ЗаполнитьДанныеПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплату(Команда)
	РаспределитьОплатуСервер();
КонецПроцедуры

#КонецОбласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец МенюОтчеты

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(Ключ, ВидДифференцированности)
	УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ);
	ЗаполнитьТарифныеЗоныПоВидуДифференцированности(Объект.ПоказанияПриборовУчета, Ключ, ВидДифференцированности);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//ФискальнаяОперацияОбновитьСтатус();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	текСтрока 								= Элементы.ПоказанияПриборовУчета.ТекущиеДанные;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер()
	ЗаполнитьДанныеДляОплаты();	
	ЗаполнитьДанныеПриборовУчета();
	ЗаполнитьСведенияОРассрочке();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляОплаты()
	// очищаем табличную часть оплаты
	Объект.Услуги.Очистить();
	
	// выводим данные по подключенным услугам и задолженности
	Результат = энргРаботаСТочкамиУчетаСервер.ДанныеДляОплатыАбонента(Объект.Дата,Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.МКД,Объект.Абонент);
	Выборка  = Результат.выбрать();
	Пока Выборка.следующий() цикл
		 СтрокаУслуги  								= Объект.Услуги.Добавить();
		 СтрокаУслуги.ПредставлениеПериодаОплаты 	= Формат(Выборка.периодНачисления,"ДФ='ММММ гггг'");
		 ЗаполнитьЗначенияСвойств(СтрокаУслуги,Выборка); 		 
	 КонецЦикла; 
	 
	СуммаКОплате = энргРаботаСТочкамиУчетаСервер.ЗадолженностьАбонента(Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Объект.Абонент);		 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета()
	
	ТаблицаТЧ 								= Объект.ПоказанияПриборовУчета.Выгрузить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	
	Результат 								= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаАбонента(Объект.Дата,Объект.Район,Объект.Организация,Объект.Абонент); 
	Выборка  								= Результат.выбрать();
	Пока Выборка.следующий() цикл
		СтрокаПриборов  					= Объект.ТочкиУчета.Добавить();
		СтрокаПриборов.IDСтроки 			= Новый УникальныйИдентификатор;
		ЗаполнитьЗначенияСвойств(СтрокаПриборов,Выборка); 		 
	КонецЦикла; 
	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчета(Объект.ТочкиУчета,Объект.ПоказанияПриборовУчета,ТаблицаТЧ,Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Объект.Абонент,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьОплатуСервер()
	
	ТекОбъект  		= РеквизитФормыВЗначение("Объект");
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ТекПериодНачисления",	Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("ДанныеТЧ",				ТекОбъект.услуги.выгрузить());
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргКвитанцияУслуги.Услуга,
	|	энргКвитанцияУслуги.ПериодНачисления,
	|	энргКвитанцияУслуги.Задолженность,
	|	энргКвитанцияУслуги.НачисленоПоКвитанции,
	|	энргКвитанцияУслуги.НомерСтроки
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	&ДанныеТЧ КАК энргКвитанцияУслуги
	|ГДЕ
	|	энргКвитанцияУслуги.Задолженность > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПорядокПогашенияЗадолженности.Услуга,
	|	энргПорядокПогашенияЗадолженности.Порядок
	|ПОМЕСТИТЬ ПорядокРаспределения
	|ИЗ
	|	РегистрСведений.энргПорядокПогашенияЗадолженности КАК энргПорядокПогашенияЗадолженности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Услуга,
	|	ДанныеТЧ.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеТЧ.Задолженность  КАК Задолженность,
	|	ДанныеТЧ.НомерСтроки,
	|	ПорядокРаспределения.Порядок КАК Порядок,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.ПериодНачисления = &ТекПериодНачисления
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПериодНачисления
	|ИЗ
	|	ПорядокРаспределения КАК ПорядокРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТЧ КАК ДанныеТЧ
	|		ПО ПорядокРаспределения.Услуга = ДанныеТЧ.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокПериодНачисления,
	|	ПериодНачисления,
	|	Порядок";
	
	
	НадоРаспределить  					= Объект.СуммаОплаты;
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		СтрокаУслуг 					= Объект.Услуги[Выборка.НомерСтроки - 1];
		Оплачиваем  					= Мин(НадоРаспределить,Выборка.Задолженность);
		СтрокаУслуг.Оплачено 			= Оплачиваем;
		НадоРаспределить 				= НадоРаспределить -  Оплачиваем;		
	КонецЦикла; 	
	
	Если НадоРаспределить > 0 тогда
		для Каждого стр из Объект.ОплатаПоРассрочке цикл
			Оплачиваем  				= Мин(НадоРаспределить,стр.СуммаНеОплаченныхПроцентов);
			СтрокаУслуг.Оплачено 		= Оплачиваем;
			НадоРаспределить 			= НадоРаспределить -  Оплачиваем;
		КонецЦикла;  		
	КонецЕсли;
	
	Если НадоРаспределить > 0 тогда
		Оплачиваем  					= Мин(НадоРаспределить,Объект.СуммаОсновногоДолгаРассрочки);
		ОплатаОсновногоДолгаРассрочки 	= Оплачиваем;
		НадоРаспределить 				= НадоРаспределить -  Оплачиваем; 		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОРассрочке()
	
	Объект.ОплатаПоРассрочке.Очистить();
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Период",		Объект.Дата);
	Запрос.УстановитьПараметр("Район",		Объект.Район);
	Запрос.УстановитьПараметр("МКД",		Объект.МКД);
	Запрос.УстановитьПараметр("Абонент",	Объект.Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргПроцентыПоРассрочкеОстатки.ПериодНачисления,
	|	энргПроцентыПоРассрочкеОстатки.СуммаЗадолженностиОстаток КАК СуммаНеОплаченныхПроцентов
	|ИЗ
	|	РегистрНакопления.энргПроцентыПоРассрочке.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПроцентыПоРассрочкеОстатки";
	Результат  = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		СтрокаТЧ 							= Объект.ОплатаПоРассрочке.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",		Объект.Дата);
	Запрос.УстановитьПараметр("Район",		Объект.Район);
	Запрос.УстановитьПараметр("МКД",		Объект.МКД);
	Запрос.УстановитьПараметр("Абонент",	Объект.Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргЗадолженностьПоРассрочкеОстатки.СуммаЗадолженностиОстаток
	|ИЗ
	|	РегистрНакопления.энргЗадолженностьПоРассрочке.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргЗадолженностьПоРассрочкеОстатки";
	Результат  								= Запрос.Выполнить();
	Выборка  								= Результат.Выбрать();
	Если не Результат.Пустой() тогда
		Выборка  							= Результат.Выбрать();
		Выборка.Следующий();
		Объект.СуммаОсновногоДолгаРассрочки = Выборка.СуммаЗадолженностиОстаток;
	КонецЕсли;
	
КонецПроцедуры

#Область ФискальнаяОперация

&НаСервере
Процедура ФискальнаяОперацияОбновитьСтатус()
	
	ФискальнаяОперацияПодключенноеОборудование = энргПодключаемоеОборудованиеБиллингВызовСервера.ОборудованиеПодключенноеККассе(Объект.Касса);
	ИмяКоманды = "ПробитьЧек";
	
	Элементы.ФискальнаяОперацияСтатус.Видимость = (ФискальнаяОперацияПодключенноеОборудование <> Неопределено);
	Если ФискальнаяОперацияПодключенноеОборудование = Неопределено Тогда
		ФискальнаяОперацияСтатус = "";
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФискальнаяОперацияДанныеЖурнала = энргПодключаемоеОборудованиеБиллингВызовСервера.ДанныеЖурналаФискальныхОпераций(Объект.Ссылка);
	Иначе
		ФискальнаяОперацияДанныеЖурнала = Неопределено;
	КонецЕсли;
	
	Строки = Новый Массив;
	Если ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.ККТ) Тогда
			
			Строки.Добавить(
			Новый ФорматированнаяСтрока(
			НСтр("ru = 'Пробить чек'"),,
			ЦветаСтиля.энргЦветГиперссылки,,
			ИмяКоманды));
			
		Иначе
			
			Строки.Добавить(
			Новый ФорматированнаяСтрока(
			НСтр("ru = 'Чек не пробит'"),,
			ЦветаСтиля.энргЦветГиперссылки,,
			"НастроитьОборудование"));
			
		КонецЕсли;
		
	Иначе
		
		
		Строки.Добавить(
		Новый ФорматированнаяСтрока(
		СтрШаблон(
		НСтр("ru = 'Пробит чек №%1'"),
		ФискальнаяОперацияДанныеЖурнала.НомерЧекаККМ),,
		ЦветаСтиля.энргЦветГиперссылки,,
		"ОткрытьЗаписьЖурналаФискальныхОпераций"));
		
	КонецЕсли;
	
	ФискальнаяОперацияСтатус = Новый ФорматированнаяСтрока(Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	ТорговыйОбъект = Объект.Касса;
	
	Если "ПробитьЧек" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
		ПараметрыОперации.Вставить("Партнер",                  Объект.Абонент);
		ПараметрыОперации.Вставить("Организация",              Объект.Организация);
		ПараметрыОперации.Вставить("ТорговыйОбъект",           ТорговыйОбъект);
		ПараметрыОперации.Вставить("ПодключенноеОборудование", ФискальнаяОперацияПодключенноеОборудование);
		
		энргПодключаемоеОборудованиеБиллингКлиент.ПробитьЧек(
		ЭтотОбъект,
		ПараметрыОперации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", ЭтотОбъект));
		
	ИначеЕсли "ПробитьЧекИнкассация" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("Сумма",                    Объект.СуммаДокумента);
		ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
		ПараметрыОперации.Вставить("Организация",              Объект.Организация);
		ПараметрыОперации.Вставить("ТорговыйОбъект",           ТорговыйОбъект);
		ПараметрыОперации.Вставить("ПодключенноеОборудование", ПараметрыКассыККМ.ИдентификаторУстройства);
		
		ПараметрыОперации.Вставить("ВыемкаДенежныхСредствИзКассыККМ", Неопределено);
		
		энргПодключаемоеОборудованиеБиллингКлиент.ПробитьЧекВыемкаДенежныхСредств(
		ЭтотОбъект,
		ПараметрыОперации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", ЭтотОбъект));
		
	ИначеЕсли "ОткрытьЗаписьЖурналаФискальныхОпераций" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		энргПодключаемоеОборудованиеБиллингКлиент.ОткрытьЗаписьЖурналаФискальныхОпераций(ЭтотОбъект, ФискальнаяОперацияДанныеЖурнала);
		
	ИначеЕсли "НастроитьОборудование" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ОткрытьФорму("Обработка.ПредпросмотрЧека.Форма.ОшибкаПодключенияККТ");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальнаяОперацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФискальнаяОперацияОбновитьСтатус();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ)
	энргРаботаСПриборамиУчетаСервер.УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ, Объект.ПоказанияПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТарифныеЗоныПоВидуДифференцированности(ТЧ, Ключ, ВидДифференцированности)
	
	СписокТарифныхЗон = энргРаботаСПриборамиУчетаСервер.ПолучитьТарифныеЗоныПоВидуДифференцированности(ВидДифференцированности);
	
	Для каждого стр из СписокТарифныхЗон Цикл
		НовСтрока 				= ТЧ.Добавить();
		НовСтрока.IDСтроки	= Ключ;
		НовСтрока.ТарифнаяЗона 	= стр.ТарифнаяЗона;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВТарифныхЗонах(КлючСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("IDСтроки", КлючСтроки);
	Элементы.ПоказанияПриборовУчета.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКОплате()
	// СуммаКОплате = Объект.Услуги.Итог("Задолженность") +Объект.ПоказанияПриборовУчета.Итог("Сумма") ;      
	// выводим данные по задолженности
	// Результат = энргРаботаСТочкамиУчетаСервер.ЗадолженностьАбонента(Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Объект.Абонент);
	// Выборка  = Результат.выбрать();
	// Если Выборка.следующий() Тогда
	//	  СуммаКОплате = Выборка.Задолженность;		 
	// КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти