#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетГосПошлины

Функция ГосПошлина(Период,СуммаЗадолженности) Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("Период",				Период);
	Запрос.УстановитьПараметр("СуммаЗадолженности",	СуммаЗадолженности);
	Запрос.Текст 		="ВЫБРАТЬ
	|	энргРазмерыГосПошлиныСрезПоследних.Период,
	|	энргРазмерыГосПошлиныСрезПоследних.СуммаЗадолженность,
	|	энргРазмерыГосПошлиныСрезПоследних.Процент,
	|	энргРазмерыГосПошлиныСрезПоследних.ФиксированнаяСумма,
	|	энргРазмерыГосПошлиныСрезПоследних.СуммаДоПревышения,
	|	энргРазмерыГосПошлиныСрезПоследних.МаксимальнаяСумма,
	|	энргРазмерыГосПошлиныСрезПоследних.МинимальнаяСумма
	|ПОМЕСТИТЬ Набор
	|ИЗ
	|	РегистрСведений.энргРазмерыГосПошлины.СрезПоследних(&Период, ) КАК энргРазмерыГосПошлиныСрезПоследних
	|ГДЕ
	|	энргРазмерыГосПошлиныСрезПоследних.Актуальность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.СуммаЗадолженность,
	|	ВложенныйЗапрос.Процент,
	|	ВложенныйЗапрос.ФиксированнаяСумма,
	|	ВложенныйЗапрос.СуммаДоПревышения,
	|	ВложенныйЗапрос.МаксимальнаяСумма,
	|	ВложенныйЗапрос.СуммаГраница,
	|	ВложенныйЗапрос.МинимальнаяСумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборМинСумма.СуммаЗадолженность КАК СуммаЗадолженность,
	|		НаборМинСумма.Процент КАК Процент,
	|		НаборМинСумма.ФиксированнаяСумма КАК ФиксированнаяСумма,
	|		НаборМинСумма.СуммаДоПревышения КАК СуммаДоПревышения,
	|		НаборМинСумма.МаксимальнаяСумма КАК МаксимальнаяСумма,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА НаборМаксСумма.СуммаЗадолженность ЕСТЬ NULL 
	|					ТОГДА 10000000000000000000000000000000
	|				ИНАЧЕ НаборМаксСумма.СуммаЗадолженность - 1
	|			КОНЕЦ) КАК СуммаГраница,
	|		НаборМинСумма.МинимальнаяСумма КАК МинимальнаяСумма
	|	ИЗ
	|		Набор КАК НаборМинСумма
	|			ЛЕВОЕ СОЕДИНЕНИЕ Набор КАК НаборМаксСумма
	|			ПО НаборМинСумма.СуммаЗадолженность < НаборМаксСумма.СуммаЗадолженность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборМинСумма.СуммаЗадолженность,
	|		НаборМинСумма.Процент,
	|		НаборМинСумма.ФиксированнаяСумма,
	|		НаборМинСумма.СуммаДоПревышения,
	|		НаборМинСумма.МаксимальнаяСумма,
	|		НаборМинСумма.МинимальнаяСумма) КАК ВложенныйЗапрос
	|ГДЕ
	|	&СуммаЗадолженности МЕЖДУ ВложенныйЗапрос.СуммаЗадолженность И ВложенныйЗапрос.СуммаГраница";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить процентные ставки расчета госпошлины");
	КонецЕсли;
	
	Выборка  = Результат.Выбрать();
	Выборка.Следующий();	
	
	Процент  		= Выборка.Процент;
	Если не ЗначениеЗаполнено(Выборка.СуммаДоПревышения) тогда
		СуммаГоспошлины = СуммаЗадолженности * Выборка.Процент /100;
	иначе
		СуммаГоспошлины = (СуммаЗадолженности-Выборка.СуммаДоПревышения) * Выборка.Процент /100
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.МинимальнаяСумма) тогда
		СуммаГоспошлины = Макс(Выборка.МинимальнаяСумма,СуммаГоспошлины);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МаксимальнаяСумма) тогда
		СуммаГоспошлины = Мин(Выборка.МаксимальнаяСумма,СуммаГоспошлины);
	КонецЕсли;
	
	Возврат СуммаГоспошлины;
	
КонецФункции

#КонецОбласти

#Область Отправка_писем

// Рег задание без параметров
Процедура УведомитьПользователяЮрОтделаРегЗадание() Экспорт
	
	УведомитьПользователяЮрОтдела();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Уведомление с параметрами на случай если необходимы отборы
Процедура УведомитьПользователяЮрОтдела(Организация = Неопределено,Район = Неопределено, Пользователь = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргНастройкиЮрОтдела.Организация КАК Организация,
		|	энргНастройкиЮрОтдела.Район КАК Район,
		|	энргНастройкиЮрОтдела.Начальник КАК Начальник
		|ПОМЕСТИТЬ ВТ_Начальники
		|ИЗ
		|	РегистрСведений.энргНастройкиЮрОтдела КАК энргНастройкиЮрОтдела
		|ГДЕ
		|	1 = 1
		|	И энргНастройкиЮрОтдела.Организация = &Организация
		|	И энргНастройкиЮрОтдела.Район = &Район
		|	И энргНастройкиЮрОтдела.Начальник = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Почта КАК Почта,
		|	энргЗадачаПИДЗадачиПоИсполнителю.Абонент КАК Абонент,
		|	энргЗадачаПИДЗадачиПоИсполнителю.ЛицевойСчет КАК ЛицевойСчет,
		|	ВложенныйЗапрос.Начальник КАК Начальник
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """") КАК Почта,
		|		ВТ_Начальники.Начальник КАК Начальник,
		|		ВТ_Начальники.Организация КАК Организация,
		|		ВТ_Начальники.Район КАК Район
		|	ИЗ
		|		ВТ_Начальники КАК ВТ_Начальники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|			ПО ВТ_Начальники.Начальник = ПользователиКонтактнаяИнформация.Ссылка
		|				И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMAILПользователя))
		|				И (ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.ЗадачиПоИсполнителю КАК энргЗадачаПИДЗадачиПоИсполнителю
		|		ПО ВложенныйЗапрос.Организация = энргЗадачаПИДЗадачиПоИсполнителю.Организация
		|			И ВложенныйЗапрос.Район = энргЗадачаПИДЗадачиПоИсполнителю.Район
		|			И ВложенныйЗапрос.Начальник = энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель
		|			И (НЕ энргЗадачаПИДЗадачиПоИсполнителю.Выполнена)
		|			И (НЕ энргЗадачаПИДЗадачиПоИсполнителю.ПометкаУдаления)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Этап = &Этап)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.ДатаУчётаНачислений МЕЖДУ &НП И &КП)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Организация = &Организация)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Район = &Район)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель = &Пользователь)
		|ИТОГИ
		|	МАКСИМУМ(Почта)
		|ПО
		|	Начальник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Отправитель
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка = ЗНАЧЕНИЕ(Справочник.УчетныеЗАписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)";
	
	КП = НачалоДня(ТекущаяДата()) - 1;
	
	Запрос.УстановитьПараметр("Этап"	,Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_РешениеСуда);
	Запрос.УстановитьПараметр("НП"		,НачалоДня(КП));
	Запрос.УстановитьПараметр("КП"		,КП);
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Организация = &Организация","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Организация = &Организация)","");
	Иначе 
		Запрос.УстановитьПараметр("Организация"	,Организация);
	КонецЕсли;
	Если Район = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Район = &Район","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Район = &Район)","");
	Иначе 
		Запрос.УстановитьПараметр("Район"	,Район);
	КонецЕсли;
	Если Пользователь = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Начальник = &Пользователь","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель = &Пользователь)","");
	Иначе 
		Запрос.УстановитьПараметр("Пользователь"	,Пользователь);
	КонецЕсли;
	
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();	
	ВыборкаНачальник 	= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОтправитель 	= РезультатЗапроса[2].Выбрать();
	ВыборкаОтправитель.следующий();
	Отправитель 		= ВыборкаОтправитель.Отправитель;
	Если не ЗначениеЗаполнено(Отправитель) Тогда
		ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурналаРегистрации.Ошибка,,,"Не заполнена системная учетная запись.");
		Возврат;
	КонецЕсли;
	
	
	Пока ВыборкаНачальник.Следующий() Цикл
		Попытка			
			
			Если не ЗначениеЗаполнено(СокрЛП(ВыборкаНачальник.Почта)) Тогда
				ВызватьИсключение "Не указана почта у пользователя: " + ВыборкаНачальник.Начальник;
			КонецЕсли;
			
			Тело 		= "Переданы пакеты документов по следующим абонентам:" + Символы.ПС;
			
			Выборка 	= ВыборкаНачальник.Выбрать();
			Пока Выборка.Следующий() Цикл
				Тело = Тело + СокрЛП(Выборка.Абонент) + "(" + СокрЛП(Выборка.ЛицевойСчет) + ")" + Символы.ПС;		
			КонецЦикла;
			
			ПараметрыОтправки = Новый Структура("Кому, Тема, Тело", ВыборкаНачальник.Почта, "Переданные пакеты документов", Тело);
			
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Отправитель, ПараметрыОтправки);
			
			УровеньЖурнала 	 = УровеньЖурналаРегистрации.Информация;
			ТекстДляЖурнала  = "Успешно отправлено по начальнику: " + ВыборкаНачальник.Начальник;
		Исключение
			УровеньЖурнала 	 = УровеньЖурналаРегистрации.Ошибка;
			ТекстДляЖурнала  = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
		
		ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурнала,,,ТекстДляЖурнала);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
