#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьНачалоВыбора(Знач Оповещение, Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Путь = Неопределено;

	бестПользовательскийВводКлиент.РаботаСДиалогомВыбора(Новый ОписаниеОповещения("ПутьНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), РежимДиалогаВыбораФайла.Открытие,"Выберите файл","Текстовый документ(*.txt)|*.txt");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)	
	
	Если не ЗначениеЗаполнено(Путь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните реквизит ""Путь к файлу""");
		Возврат;
	КонецЕсли;
	
	ДокументыКИмпорту.Очистить();
	
	Попытка
		ДвоичныеДанные 	= Новый ДвоичныеДанные(Путь);
		Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	Исключение 			
		ОписаниеОшибки  = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		Возврат;
	КонецПопытки;

	ЗагрузитьНаСервере(Адрес);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Оповещение = ДополнительныеПараметры.Оповещение;
	
	
	Путь = Результат;
	ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Адрес)	
	
	бестВзаиморасчетыВызовСервера.ЗагрузитьОплату(Адрес,Путь,ДокументыКИмпорту);   
	Элементы.ДокументыКИмпортуСуммаДокумента.ТекстПодвала = "Всего поступило: " + Формат(ДокументыКИмпорту.Итог("СуммаДокумента"),"ЧДЦ=2");
		
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ЗаписьЖурналаРегистрации("Создание документов оплаты",УровеньЖурналаРегистрации.Информация,
	,,"Начало создания документов");
	бестВзаиморасчетыВызовСервера.СоздатьДокументыОплат(Путь,ДокументыКИмпорту);
КонецПроцедуры

#КонецОбласти