#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрацииЛьготы) Тогда
		Объект.ПериодРегистрацииЛьготы = ДобавитьМесяц(Объект.ПериодНачисления, -1);
	КонецЕсли; 	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	УстановитьСлужебныеДанные();
	
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "ЗагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "НезагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "ЖильцыЗакрытиеЛьготы");
	//
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ЗагруженныеДанные");
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "НезагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ЖильцыЗакрытиеЛьготы");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"НезагруженныеДанныеНенайденныеЛьготники");

	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КопияНеЗагруженные = ТекущийОбъект.НезагруженныеДанные.Выгрузить();
	КопияНеЗагруженные.Индексы.Добавить("КодСоциальнойЗащиты");
	
	ОсновнаяТаблица = ТекущийОбъект.НезагруженныеДанные;
	ОсновнаяТаблица.Очистить();
	
	ДополнитьТаблицу(НезагруженныеДанныеНенайденныеЛьготники, ОсновнаяТаблица, КопияНеЗагруженные);
	ДополнитьТаблицу(НезагруженныеДанныеНесоответствиеАдреса, ОсновнаяТаблица, КопияНеЗагруженные);
	ДополнитьТаблицу(НезагруженныеДанныеВнеЗоныГП, ОсновнаяТаблица, КопияНеЗагруженные);
	
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НезагруженныеДанныеНенайденныеЛьготники, ОсновнаяТаблица);
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НезагруженныеДанныеНесоответствиеАдреса, ОсновнаяТаблица);
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НезагруженныеДанныеВнеЗоныГП, ОсновнаяТаблица);  		
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСлужебныеДанные();
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "ЗагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "НезагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(ТекущийОбъект, "ЖильцыЗакрытиеЛьготы");
	//
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ЗагруженныеДанные");
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "НезагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ЖильцыЗакрытиеЛьготы");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"НезагруженныеДанныеНенайденныеЛьготники");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УставновитьПериодНачисленияИРегистрацииЛьготы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УставновитьПериодНачисленияИРегистрацииЛьготы();
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	УставновитьПериодНачисленияИРегистрацииЛьготы();
	
КонецПроцедуры

&НаКлиенте
Процедура УставновитьПериодНачисленияИРегистрацииЛьготы()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район); 		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрацииЛьготы) Тогда
		Объект.ПериодРегистрацииЛьготы = ДобавитьМесяц(Объект.ПериодНачисления, -1);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПериодРегистрацииЛьготыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяДата = Объект.ПериодРегистрацииЛьготы;
	Подсказка 	= "Введите период регистрации льготы";
	ЧастьДаты 	= ЧастиДаты.Дата;
	Оповещение	= Новый ОписаниеОповещения("ПослеВводаПериодаРегистрацииЛьготы", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ТекущаяДата, Подсказка, ЧастьДаты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтраницаНезагруженныеДанные

&НаКлиенте
Процедура НезагруженныеДанныеНенайденныеЛьготникиСтроениеБиллингПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НезагруженныеДанныеНенайденныеЛьготники.ТекущиеДанные;
	ДействияПриИзмененииСтроения(ТекущиеДанные, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НезагруженныеДанныеНенайденныеЛьготникиПомещениеБиллингПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НезагруженныеДанныеНенайденныеЛьготники.ТекущиеДанные;
	ОпределитьКлючПомещенияАбонента(ТекущиеДанные, СоответствиеПолейОпределенияКлючаПомещения(Ложь));

КонецПроцедуры


&НаКлиенте
Процедура НезагруженныеДанныеНесоответствиеАдресаСтроениеБиллингСталоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НезагруженныеДанныеНесоответствиеАдреса.ТекущиеДанные;
	ДействияПриИзмененииСтроения(ТекущиеДанные, Истина); 	
		
КонецПроцедуры

&НаКлиенте
Процедура НезагруженныеДанныеНесоответствиеАдресаПомещениеБиллингСталоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НезагруженныеДанныеНесоответствиеАдреса.ТекущиеДанные;
	ОпределитьКлючПомещенияАбонента(ТекущиеДанные, СоответствиеПолейОпределенияКлючаПомещения(Истина));	
	
КонецПроцедуры


&НаКлиенте
Процедура ДействияПриИзмененииСтроения(ТекущиеДанные, ЭтоСтало)
	
	СоответствиеПолей = СоответствиеПолейОпределенияКлючаПомещения(ЭтоСтало);
	ДобавитьЗаписьВРССоответствиеСтроенийЕИРЦ(ТекущиеДанные[СоответствиеПолей.Строение], ТекущиеДанные.РайонЕИРЦ, ТекущиеДанные.НаселенныйПунктЕИРЦ, ТекущиеДанные.УлицаЕИРЦ, ТекущиеДанные.ДомЕИРЦ, ТекущиеДанные.КорпусЕИРЦ);		
	ОпределитьКлючПомещенияАбонента(ТекущиеДанные, СоответствиеПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьКлючПомещенияАбонента(ТекущиеДанные, СоответствиеПолей)
	
	Строение 		= ТекущиеДанные[СоответствиеПолей.Строение];
	Помещение 		= ТекущиеДанные[СоответствиеПолей.Помещение];
	Если ЗначениеЗаполнено(Строение) Тогда 
		КлючПомещения 	= ПолучитьКлючПомещенияСервер(Строение, Помещение);
	Иначе 		
		КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
	ТекущиеДанные[СоответствиеПолей.КлючПомещения] = КлючПомещения;
	ТекущиеДанные.Абонент  		= ПолучитьАбонентаПоКлючуПомещения(Объект.Организация, Объект.Район, КлючПомещения);
	ТекущиеДанные.ЛицевойСчет  	= ПолучитьЛицевойСчетАбонента(ТекущиеДанные.Абонент);
	
	МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначенияКлиент.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
	
	ПараметрыКлючаПомещения = МодульэнргРаботаСЛьготникамиЕИРЦ.НоваяСтруктураПараметровПолученияЛьготника();
	ПараметрыКлючаПомещения.Организация 	= Объект.Организация;
	ПараметрыКлючаПомещения.Район 			= Объект.Район;
	ПараметрыКлючаПомещения.КлючПомещения 	= КлючПомещения;
	
	Если ЗначениеЗаполнено(КлючПомещения) Тогда
		ТекущиеДанные.Жилец = ПолучитьЖильцаАбонента(Объект.Дата, ПараметрыКлючаПомещения, ТекущиеДанные.Абонент,
		ТекущиеДанные.ФИОПоРеестру, ТекущиеДанные.КодСоциальнойЗащиты);
	Иначе 
		ТекущиеДанные.Жилец = ПредопределенноеЗначение("Справочник.энргКонтрагенты.ПустаяСсылка");
	КонецЕсли;
	
	НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(Новый Структура("КодСоциальнойЗащиты", ТекущиеДанные.КодСоциальнойЗащиты));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаДанных = НайденныеСтроки[0];
		СтрокаДанных[СоответствиеПолей.КлючПомещения] = КлючПомещения;
		СтрокаДанных[СоответствиеПолей.Строение]      = Строение;
		СтрокаДанных[СоответствиеПолей.Помещение]     = Помещение;
		СтрокаДанных.Абонент     = ТекущиеДанные.Абонент;
		СтрокаДанных.ЛицевойСчет = ТекущиеДанные.ЛицевойСчет;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция СоответствиеПолейОпределенияКлючаПомещения(ЭтоСтало)
	Результат = Новый Структура;
	Результат.Вставить("КлючПомещения"	, ?(ЭтоСтало, "КлючПомещенияСтало", "КлючПомещения"));
	Результат.Вставить("Строение"		, ?(ЭтоСтало, "СтроениеБиллингСтало", "Строение"));
	Результат.Вставить("Помещение"		, ?(ЭтоСтало, "ПомещениеБиллингСтало", "Помещение"));
	
	Возврат Результат;
КонецФункции


#Область ПоискСвязанныхДанных

&НаСервереБезКонтекста
Функция ПолучитьКлючПомещенияСервер(Знач Строение, Знач Помещение) 
	
	ДанныеКлючаПомещения = Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);	
	Возврат ДанныеКлючаПомещения.КлючПомещения;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьАбонентаПоКлючуПомещения(Организация, Район, КлючПомещения) 
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	энргАбонентыПомещений.Абонент КАК Абонент
		|ИЗ
		|	РегистрСведений.энргАбонентыПомещений КАК энргАбонентыПомещений
		|ГДЕ
		|	энргАбонентыПомещений.КлючПомещения = &КлючПомещения
		|	И энргАбонентыПомещений.Организация = &Организация
		|	И энргАбонентыПомещений.Район = &Район";
	
	Если Не ЗначениеЗаполнено(Район) Тогда
		  ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "энргАбонентыПомещений.Район = &Район", "ИСТИНА");
	  КонецЕсли;
	  
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Абонент;
	Иначе
		Возврат Справочники.энргАбоненты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьЛицевойСчетАбонента(Абонент)	
	Возврат энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "ЛицевойСчет");	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьЖильцаАбонента(Период, ПараметрыКлючаПомещения, Абонент, ФИОПоРеестру, КодСоциальнойЗащиты) 
	
	МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначения.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
	
	Возврат МодульэнргРаботаСЛьготникамиЕИРЦ.ПолучитьЛьготникаПоКлючам(Период, ПараметрыКлючаПомещения, Абонент, ФИОПоРеестру, КодСоциальнойЗащиты);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьЗаписьВРССоответствиеСтроенийЕИРЦ(СтроениеБиллинг, РайонЕИРЦ, НаселенныйПунктЕИРЦ, УлицаЕИРЦ, ДомЕИРЦ, КорпусЕИРЦ);
	
	ДанныеРегистрации = РегистрыСведений.энргСоответствиеСтроенийЕИРЦ.ПолучитьОписаниеОбъекта();
	ДанныеРегистрации.Строение 				= СтроениеБиллинг;
	ДанныеРегистрации.РайонЕИРЦ 			= РайонЕИРЦ;
	ДанныеРегистрации.НаселенныйПунктЕИРЦ 	= НаселенныйПунктЕИРЦ;
	ДанныеРегистрации.УлицаЕИРЦ 			= УлицаЕИРЦ;
	ДанныеРегистрации.ДомЕИРЦ				= ДомЕИРЦ;
	ДанныеРегистрации.КорпусЕИРЦ 			= КорпусЕИРЦ;
	
	МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначения.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
	
	МодульэнргРаботаСЛьготникамиЕИРЦ.ЗарегистрироватьСоответствиеАдреса(ДанныеРегистрации);	
		
КонецФункции
	
#КонецОбласти

#Область РегистрацияДанных

&НаКлиенте
Процедура СоздатьКонтрагентов(Команда)
	СписокКонтрагентов 		 = Новый Массив;
	
	МодульэнргРаботаСЛьготникамиЕИРЦ	= ОбщегоНазначенияКлиент.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
	НовоеОписаниеКонтрагента			= МодульэнргРаботаСЛьготникамиЕИРЦ.НоваяСтруктураПолейКонтрагента();
	
	Для Каждого Стр Из НезагруженныеДанныеНесоответствиеАдреса Цикл
		Создавать = НЕ ЗначениеЗаполнено(Стр.Жилец) И ЗначениеЗаполнено(Стр.КлючПомещенияСтало) 
						И ЗначениеЗаполнено(Стр.ФИОПоРеестру) И ЗначениеЗаполнено(Стр.Абонент) И ЗначениеЗаполнено(Стр.КодСоциальнойЗащиты);
		
		Если НЕ Создавать Тогда 
			Продолжить;
		КонецЕсли; 			
		 
		ОписаниеКонтрагента = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(НовоеОписаниеКонтрагента);
		ОписаниеКонтрагента.бестФамилия 	 = Стр.ФамилияЕИРЦ;
		ОписаниеКонтрагента.бестИмя 		 = Стр.ИмяЕИРЦ;
		ОписаниеКонтрагента.бестОтчество 	 = Стр.ОтчествоЕИРЦ;
		ОписаниеКонтрагента.Наименование 	 = Стр.ФИОПоРеестру;
		ОписаниеКонтрагента.бестДатаРождения = Стр.ДатаРожденияЕИРЦ;
		
		ОписаниеКонтрагента.Вставить("Идентификатор"		, Стр.НомерСтроки);
		ОписаниеКонтрагента.Вставить("КодСоциальнойЗащиты"	, Стр.КодСоциальнойЗащиты);
		ОписаниеКонтрагента.Вставить("Жилец"				, "");	
		
		СписокКонтрагентов.Добавить(ОписаниеКонтрагента);
	КонецЦикла;
	
	Если СписокКонтрагентов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;   	
	
	ЭтотОбъект.Модифицированность = Истина;
	
	МодульэнргРаботаСЛьготникамиЕИРЦ.СоздатьСписокКонтрагентов(СписокКонтрагентов, ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ФизЛицо"));
	
	ДобавитьСозданныхЖильцовВТаблицу(СписокКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСозданныхЖильцовВТаблицу(СписокКонтрагентов)
	
	Для Каждого СтрокаНабора Из СписокКонтрагентов Цикл
		
		//НайденныеСтроки = НезагруженныеДанныеНесоответствиеАдреса.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаНабора.Идентификатор));
		НайденныеСтроки = НезагруженныеДанныеНесоответствиеАдреса.НайтиСтроки(Новый Структура("КодСоциальнойЗащиты", СтрокаНабора.КодСоциальнойЗащиты));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Жилец = СтрокаНабора.Жилец;
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Ошибки = ПроверитьВозможностьЗагрузки();
	Если НЕ ПустаяСтрока(Ошибки) Тогда 
		НовоеОписаниеОповощение = Новый ОписаниеОповещения("ЗаполнитьДанныеПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(НовоеОписаниеОповощение,Ошибки,РежимДиалогаВопрос.ДаНет,,,,);
		Возврат;
	КонецЕсли;
	Если ЕстьНеЗагруженныеДанные() Тогда 
		НовоеОписаниеОповощение = Новый ОписаниеОповещения("ЗаполнитьДанныеПослеВопросаОчистки", ЭтотОбъект);
		ПоказатьВопрос(НовоеОписаниеОповощение, "Данные табличных частей документа будут очищены. Продолжить загрузку?", РежимДиалогаВопрос.ДаНет,,, "Очистка данных");
	Иначе 
		ЗагрузитьДанныеОбработкой();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаДанных

&НаКлиенте
Процедура ВыгрузитьДанныеВРеестр(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выгрузкой документ необходимо записать");
		Возврат;
	КонецЕсли;
	КаталогВыгрузки 		= ПолучитьКаталогВыгрузки();
	ИмяФайла                = ПолучитьИмяФайлаЗагрузки();
	ЗапуститьФоновоеЗаданиеФормированияДанныхВыгрузкиКлиент(КаталогВыгрузки, ИмяФайла);
		
КонецПроцедуры


&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеФормированияДанныхВыгрузкиКлиент(КаталогВыгрузки, ИмяФайла)
	
	ИмяОбработкиВыгрузки = ИмяФайлаВыгрузкиДанных(Объект.ВидРеестра);
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("Ссылка"				, Объект.Ссылка);
	ПараметрыФункции.Вставить("Дата"				, Объект.Дата);
	ПараметрыФункции.Вставить("ПериодНачисления"	, Объект.ПериодРегистрацииЛьготы);
	ПараметрыФункции.Вставить("Организация"			, Объект.Организация);
	ПараметрыФункции.Вставить("Район"				, Объект.Район);
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеФормированияДанныхВыгрузки(УникальныйИдентификатор, ИмяОбработкиВыгрузки, ПараметрыФункции);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ДополнительныеПараметры = Новый Структура("КаталогВыгрузки, ИмяФайла", КаталогВыгрузки, ИмяФайла);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииПодготовкиДанныхВыгрузки", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеФормированияДанныхВыгрузки(УникальныйИдентификатор, ИмяОбработкиВыгрузки, ПараметрыФункции)
	
	ИмяФункции = ИмяОбработкиВыгрузки + ".ПолучитьДанныеВыгрузки";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		ИмяФункции,
		ПараметрыФункции);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииПодготовкиДанныхВыгрузки(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		УдалитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		
		Возврат;
	КонецЕсли;
	
	Файл = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);  	
	Файл.Записать(ДополнительныеПараметры.КаталогВыгрузки + ДополнительныеПараметры.ИмяФайла + ".dbf");	
	УдалитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);                                 	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл успешно выгружен");
	
КонецПроцедуры

#КонецОбласти 


#Область ВводНаОсновании

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

#КонецОбласти

#Область ПодключаемыеКомандыФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПереносАбонентовНаВкладкуВнеЗоныГП

&НаКлиенте
Процедура ПеренестиЖильцовВнеЗоныГП(Команда)
	
	ПеренестиЖильцовВнеЗоныГПНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТипЛьготы(ВидРеестра)
	
	Если ЗначениеЗаполнено(ВидРеестра) Тогда
		Возврат ВидРеестра.ТипЛьготы;
	Иначе 
		Возврат Перечисления.бестТипыЛьгот.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗаполнитьДанныеПослеВопросаОчистки(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТЧ();
	ЗагрузитьДанныеОбработкой();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПослеВопроса(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();    
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеОбработкой()
	ЭтотОбъект.Модифицированность = Истина;
	АдресВХ = УпаковатьВоВременноеХранилище(объект.ФайлДляЧтения);
	ОбработатьФайлНаСервере(АдресВХ);
	Записать();
КонецПроцедуры

&НаКлиенте
Функция УпаковатьВоВременноеХранилище(ФайлДляЧтения)
	Файл 	= Новый ДвоичныеДанные(ФайлДляЧтения);
	Адрес 	= ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат Адрес;
КонецФункции 

&НаСервере
Процедура ОбработатьФайлНаСервере(АдресВХ)
	
	ОбработкаЗагрузки 	= ПолучитьОбработкуЗагрузки();
	ВидЛьготы           = ПолучитьТипЛьготы(Объект.ВидРеестра);
	ОбработкаЗагрузки.ЗагрузитьДанные(Объект, АдресВХ, ВидЛьготы);
	
	УстановитьСлужебныеДанные();
	
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ЗагруженныеДанные");
	//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"НезагруженныеДанные");
	////энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ЖильцыЗакрытиеЛьготы");
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект); 	

КонецПроцедуры 

#КонецОбласти

#Область ИсправлениеДанныхЗагруженных

&НаКлиенте
Процедура ИсправитьДанные(Команда)
	ИсправитьДанныеНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьАдрес(Команда)
	ИсправитьАдресНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
	Записать();
КонецПроцедуры

&НаСервере
Процедура ИсправитьДанныеНаСервере()
	
	Для Каждого Стр из НезагруженныеДанныеНенайденныеЛьготники Цикл
		Если Стр.Исправлен ИЛИ НЕ ЗначениеЗаполнено(Стр.КодСоциальнойЗащиты) ИЛИ НЕ ЗначениеЗаполнено(Стр.КлючПомещения) 
			ИЛИ НЕ ЗначениеЗаполнено(Стр.Абонент) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Стр.Жилец) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не выбран жилец по абоненту с кодом соцзащиты " + Стр.КодСоциальнойЗащиты); 
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", Стр.КодСоциальнойЗащиты);
		НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0  Тогда
			
			СтрокаДанных = НайденныеСтроки[0];
			
			МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначения.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
			
			МодульэнргРаботаСЛьготникамиЕИРЦ.ЗарегистрироватьСоответствиеКодаСоцЗащитыИЛьготника(Стр.КодСоциальнойЗащиты, Стр.Жилец);
			
			ЗаполнитьЗначенияСвойств(СтрокаДанных, Стр,, "НомерСтроки"); 
			СтрокаДанных.Исправлен = Истина;
			
			СтрЗагруженныеДанные = Объект.ЗагруженныеДанные.Добавить();			
			ЗаполнитьЗначенияСвойств(СтрЗагруженныеДанные, СтрокаДанных,, "НомерСтроки");
			
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);
		
КонецПроцедуры

&НаСервере
Процедура ИсправитьАдресНаСервере()
	
	Для Каждого Стр из НезагруженныеДанныеНесоответствиеАдреса Цикл
		Если Стр.Исправлен ИЛИ НЕ ЗначениеЗаполнено(Стр.КодСоциальнойЗащиты) ИЛИ НЕ ЗначениеЗаполнено(Стр.КлючПомещенияСтало) ИЛИ НЕ ЗначениеЗаполнено(Стр.Абонент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.Жилец) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не выбран жилец по абоненту с кодом соцзащиты " + Стр.КодСоциальнойЗащиты); 
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		//ПараметрыОтбора.Вставить("НомерСтроки", Стр.НомерСтроки);
		ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", Стр.КодСоциальнойЗащиты);
		НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
		
		Если НайденныеСтроки.Количество() > 0  Тогда
			
			Стр.Исправлен = Истина;
			
			СтрокаДанных = НайденныеСтроки[0];
			
			МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначения.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
			
			МодульэнргРаботаСЛьготникамиЕИРЦ.ЗарегистрироватьСоответствиеКодаСоцЗащитыИЛьготника(Стр.КодСоциальнойЗащиты, Стр.Жилец);
			
			ЗаполнитьЗначенияСвойств(СтрокаДанных, Стр,, "НомерСтроки");
			СтрокаДанных.Исправлен = Истина;			
			
			СтрЗагруженныеДанные = Объект.ЗагруженныеДанные.Добавить();			
			ЗаполнитьЗначенияСвойств(СтрЗагруженныеДанные, СтрокаДанных,, "НомерСтроки");			
			СтрЗагруженныеДанные.КлючПомещения = СтрокаДанных.КлючПомещенияСтало;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОперацииСОбработкойЗагрузки

&НаСервереБезКонтекста
Функция СсылкаНаОбработкуЗагрузки(ВидРеестра)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРеестра, "ОбработкаЗагрузки");
КонецФункции

&НаСервере
Функция ПолучитьОбработкуЗагрузки()
	СсылкаНаОбработкуЗагрузки = СсылкаНаОбработкуЗагрузки(Объект.ВидРеестра);
	Возврат Обработки[СсылкаНаОбработкуЗагрузки.Имя].Создать();
КонецФункции

&НаСервереБезКонтекста
Функция ИмяФайлаВыгрузкиДанных(ВидРеестра)
	
	СсылкаНаОбработкуЗагрузки = СсылкаНаОбработкуЗагрузки(ВидРеестра);
	ПолноеИмя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбработкуЗагрузки, "ПолноеИмя");
	ИмяОбработкиВыгрузки = СтрЗаменить(ПолноеИмя, "Обработка", "Обработки");
	
	Возврат ИмяОбработкиВыгрузки;
	
КонецФункции

&НаСервере
Функция ПолучитьФильтрФайлов()
	ОбработкаЗагрузки = ПолучитьОбработкуЗагрузки();
	Возврат ОбработкаЗагрузки.ФильтрФайлов();
КонецФункции

#КонецОбласти

#Область ПроверкаДанных

&НаКлиенте
Функция ПроверитьВозможностьЗагрузки(ПроверятьМодифицированность = Ложь)
	Результат = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Результат.Добавить("Перед загрузкой необходимо записать документ. Записать данный документ?");
	КонецЕсли;
	Если ПроверятьМодифицированность И Модифицированность Тогда 
		Результат.Добавить("Документ изменен. Перед исправлением данных необходимо записать документ. Записать данный документ?");
	КонецЕсли;		
	
	ПроверитьОбработкуЗагрузки(Результат);
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлДляЧтения) Тогда
		Результат.Добавить("Укажите файл для чтения");
	КонецЕсли; 	
	
	Возврат СтрСоединить(Результат, ". ");
КонецФункции

&НаКлиенте
Функция ПроверитьОбработкуЗагрузки(Результат)
	Если ЗначениеЗаполнено(Объект.ВидРеестра) Тогда 		
		ОбработкаЗагрузки = СсылкаНаОбработкуЗагрузки(Объект.ВидРеестра);
		Если ОбработкаЗагрузки = ПредопределенноеЗначение("Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка") Тогда 
			Результат.Добавить("У вида реестра не указана обработка загрузки");
		КонецЕсли;
	Иначе 
		Результат.Добавить("Укажите вид реестра");
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

#Область РаботаСПериодомРегистрации

&НаКлиенте
Процедура ПослеВводаПериодаРегистрацииЛьготы(ДатаВвода, Параметры) Экспорт
	
	Если ДатаВвода = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.ПериодРегистрацииЛьготы = НачалоМесяца(ДатаВвода);
	
КонецПроцедуры 

#КонецОбласти

#Область ПереносАбонентовНаВкладкуВнеЗоныГП

&НаСервере
Процедура ПеренестиЖильцовВнеЗоныГПНаСервере()
	
	Для Каждого СтрокаНабора из НезагруженныеДанныеНесоответствиеАдреса Цикл
		
		Если НЕ СтрокаНабора.ВнеЗоныГП Тогда 
			Продолжить;
		КонецЕсли; 		
		
		ПараметрыОтбора = Новый Структура;
		//ПараметрыОтбора.Вставить("НомерСтроки", СтрокаНеЗагружено.НомерСтроки);
		ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", СтрокаНабора.КодСоциальнойЗащиты);
		НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
		Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
			НайденнаяСтрока.ВнеЗоныГП = Истина;
		КонецЦикла;	
		
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);

КонецПроцедуры  
	
#КонецОбласти

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ошибки = Новый Массив;
	ПроверитьОбработкуЗагрузки(Ошибки); 	
	Если Ошибки.Количество() > 0 Тогда
		ТекстПредупреждение = СтрСоединить(Ошибки, ". ");
		ПоказатьПредупреждение(, ТекстПредупреждение);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка 		= Ложь;
	Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 				= ПолучитьФильтрФайлов();
	Если Диалог.Выбрать() тогда
		Объект.ФайлДляЧтения 	= Диалог.ПолноеИмяФайла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТЧ()
	Объект.ЗагруженныеДанные.Очистить();
	Объект.НезагруженныеДанные.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ЕстьНеЗагруженныеДанные()
	
	ЕстьДанные = Ложь;
	Для Каждого СтрокаНабора из Объект.НезагруженныеДанные Цикл 
		ЕстьДанные = Истина;
		Прервать;
	КонецЦикла;
	
	Возврат ЕстьДанные;
	
КонецФункции

&НаКлиенте
Процедура НезагруженныеДанныеНенайденныеЛьготникиЛицевойСчетПриИзменении(Элемент)
	
	ТекДанные 						= Элементы.НезагруженныеДанныеНенайденныеЛьготники.ТекущиеДанные;	
	ОтветАбонентИСвязанныеСвойства 	= ОтветАбонентИСвязанныеСвойства();
	Если ПустаяСтрока(ТекДанные.ЛицевойСчет) Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ОтветАбонентИСвязанныеСвойства);		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан лицевой счет");
		Возврат;
	КонецЕсли;
	
	ОпределитьАбонентаИСвязанныеСвойства(ТекДанные.ЛицевойСчет, ОтветАбонентИСвязанныеСвойства);
	ЗаполнитьЗначенияСвойств(ТекДанные, ОтветАбонентИСвязанныеСвойства);

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОпределитьАбонентаИСвязанныеСвойства(ЛицевойСчет, Результат)
	Результат.Абонент 	= Справочники.энргАбоненты.НайтиПоРеквизиту("ЛицевойСчет", ЛицевойСчет);	
	
	РеквизитыАбонента	= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Результат.Абонент, "Район, КлючПомещения");
	Результат.КлючПомещения	= РеквизитыАбонента.КлючПомещения;
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Результат.КлючПомещения);
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат,ДанныеПомещенияВыборка,"Строение,Помещение");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтветАбонентИСвязанныеСвойства()
	Результат = Новый Структура;
	Результат.Вставить("Абонент"		, Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("КлючПомещения"	, Справочники.энргКлючиПомещений.ПустаяСсылка());
	Результат.Вставить("Строение"		, Справочники.энргСтроения.ПустаяСсылка());
	Результат.Вставить("Помещение"		, Справочники.энргПомещения.ПустаяСсылка());
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьКаталогВыгрузки()
	ТекКаталогВыгрузки	= ""; 
	#Если ВебКлиент Тогда

		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	    
	    ДиалогВыбораФайла.Каталог = ТекКаталогВыгрузки;
	    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	    
	    ПараметрыСценария = Новый Структура;
	    Оповещение = Новый ОписаниеОповещения("КаталогНачалоВыбораЗавершение", ЭтаФорма);
	    ПараметрыСценария.Вставить("Оповещение_ПослеЗакрытияДиалогаВыбораФайла", Оповещение);
	    ПараметрыСценария.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	#Иначе
		Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
		ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
		СтандартнаяОбработка = Ложь;
		ДиалогОткрытия.Каталог = ""; 
		ДиалогОткрытия.МножественныйВыбор = Ложь; 
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			ТекКаталогВыгрузки = ДиалогОткрытия.Каталог + "\"; 
		КонецЕсли;
	#КонецЕсли	
	
	Возврат ТекКаталогВыгрузки;	
КонецФункции

&НаСервере
Функция ПолучитьИмяФайлаЗагрузки()
	
	ПолноеИмяФайла = Объект.ФайлДляЧтения;
	НовыйФайл = Новый Файл(ПолноеИмяФайла);
	ИмяФайла = "ВыгрузкаЕИРЦ";
	Если НовыйФайл.Существует() Тогда
		ИмяФайла = НовыйФайл.ИмяБезРасширения;
		Возврат ИмяФайла;
	КонецЕсли;
	
	МассивСтрок = СтрРазделить(ПолноеИмяФайла, "\", Ложь);
	Если МассивСтрок.Количество() > 0 Тогда
		ПоследняяСтрока = МассивСтрок[МассивСтрок.Количество()- 1];
		
		МассивСтрок = СтрРазделить(ПоследняяСтрока, ".", Ложь);
		Если МассивСтрок.Количество() > 0 Тогда
			ИмяФайла = МассивСтрок[0];
			Возврат ИмяФайла;
		КонецЕсли;
		
	КонецЕсли; 	
		
	Возврат ИмяФайла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Знач ТекущийОбъект)
	
	НезагруженныеДанныеНенайденныеЛьготники.Очистить();
	НезагруженныеДанныеНесоответствиеАдреса.Очистить();
	НезагруженныеДанныеВнеЗоныГП.Очистить();
	
	Для Каждого СтрокаНеЗагружено Из ТекущийОбъект.НезагруженныеДанные Цикл
		
		Если СтрокаНеЗагружено.Исправлен Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаНеЗагружено.ВнеЗоныГП Тогда
			СтрокаТаблицы			= НезагруженныеДанныеВнеЗоныГП.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаНеЗагружено,, "НомерСтроки");	
		ИначеЕсли СтрокаНеЗагружено.КодОшибки = 1 Тогда	
			СтрокаТаблицы			= НезагруженныеДанныеНенайденныеЛьготники.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаНеЗагружено,, "НомерСтроки");	
		ИначеЕсли СтрокаНеЗагружено.КодОшибки = 2 Тогда	
			СтрокаТаблицы			= НезагруженныеДанныеНесоответствиеАдреса.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаНеЗагружено,, "НомерСтроки");	
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоНомеруДомаИКвартире(Команда)
	ОбработатьДанныеПоНомеруДомаИКвартиреНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеПоНомеруДомаИКвартиреНаСервере()
	
	Для Каждого Стр из НезагруженныеДанныеНесоответствиеАдреса Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Жилец) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НРег(Стр.ДомЕИРЦ) = ПолучитьНомерДома(Строка(Стр.Строение)) 
			И Стр.ПомещениеЕИРЦ = ПолучитьНомерПомещения(Строка(Стр.Помещение)) Тогда				
			
			ПараметрыОтбора = Новый Структура;
			//ПараметрыОтбора.Вставить("НомерСтроки", СтрокаНеЗагружено.НомерСтроки);
			ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", Стр.КодСоциальнойЗащиты);
			НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Стр.Исправлен = Истина;
				
				НайденнаяСтрока = НайденныеСтроки[0];
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Стр,, "НомерСтроки");
				НайденнаяСтрока.Исправлен = Истина;
				
				СтрЗагруженныеДанные = Объект.ЗагруженныеДанные.Добавить();				
				ЗаполнитьЗначенияСвойств(СтрЗагруженныеДанные, НайденнаяСтрока,, "НомерСтроки");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);

КонецПроцедуры

&НаСервере
Функция ПолучитьНомерДома(НаименованиеСтроения)
	
	Разделитель = ",";
	
	ПозицияНомерДома =  СтрНайти(НаименованиеСтроения, "Дом № "); 
	
	Если ПозицияНомерДома > 0 Тогда
		ПозицияРазделителя = СтрНайти(НаименованиеСтроения,Разделитель, НаправлениеПоиска.СНачала, ПозицияНомерДома + 6);
		
		Если ПозицияРазделителя > 0 Тогда
		СтрНомерДома = Сред(НаименованиеСтроения, ПозицияНомерДома + 6, ПозицияРазделителя - (ПозицияНомерДома + 6));
	Иначе
		  СтрНомерДома = Прав(НаименованиеСтроения, СтрДлина(НаименованиеСтроения) -  (ПозицияНомерДома + 6) + 1);
		  КонецЕсли;
		
		Возврат НРег(СтрНомерДома);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерПомещения(НаименованиеПомещения)
	
	ПозицияНомерКвартиры =  СтрНайти(НаименованиеПомещения, "Квартира "); 
	
	Если ПозицияНомерКвартиры > 0 Тогда
		
		СтрНомерКвартиры = Сред(НаименованиеПомещения, ПозицияНомерКвартиры + 9, СтрДлина(НаименованиеПомещения) - ПозицияНомерКвартиры);
		
		Возврат СокрЛП(СтрНомерКвартиры);
	Иначе
		Возврат НаименованиеПомещения;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОпределитьЖильцовВнеЗоныГП(Команда)
	ОпределитьЖильцовВнеЗоныГПНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОпределитьЖильцовВнеЗоныГПНаСервере()
	
	МассивНаселенныхПунктовБиллинг = ПолучитьМассивНаселенныхПунктовБиллинг();
	
	Если МассивНаселенныхПунктовБиллинг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНеЗагружено из НезагруженныеДанныеНенайденныеЛьготники Цикл
		
		Если СтрокаНеЗагружено.ВнеЗоныГП = Истина Тогда 
			
			ПараметрыОтбора = Новый Структура;
			//ПараметрыОтбора.Вставить("НомерСтроки", СтрокаНеЗагружено.НомерСтроки);
			ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", СтрокаНеЗагружено.КодСоциальнойЗащиты);
			НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
			
			Если НайденныеСтроки.Количество() > 0  Тогда
				Если НайденныеСтроки[0].ВнеЗоныГП = Истина Тогда
					Продолжить;
				Иначе
					ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрокаНеЗагружено,, "НомерСтроки");
					НайденныеСтроки[0].ВнеЗоныГП = Истина;				
				КонецЕсли;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если МассивНаселенныхПунктовБиллинг.Найти(СтрокаНеЗагружено.НаселенныйПунктЕИРЦ) = Неопределено Тогда 
			
			ПараметрыОтбора = Новый Структура;
			//ПараметрыОтбора.Вставить("НомерСтроки", СтрокаНеЗагружено.НомерСтроки);
			ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", СтрокаНеЗагружено.КодСоциальнойЗащиты);
			НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
			
			Если НайденныеСтроки.Количество() > 0  Тогда
				Если НайденныеСтроки[0].ВнеЗоныГП = Истина Тогда
					Продолжить;
				Иначе
					ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрокаНеЗагружено,, "НомерСтроки");
					НайденныеСтроки[0].ВнеЗоныГП = Истина;				
				КонецЕсли;
			КонецЕсли;

			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивНаселенныхПунктовБиллинг()
	
	МассивНП = Новый Массив;
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтроения.Ссылка КАК Ссылка,
		|	энргСтроенияКонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
		|		ПО энргСтроенияКонтактнаяИнформация.Ссылка = энргСтроения.Ссылка
		|			И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|ГДЕ
		|	НЕ энргСтроения.ПометкаУдаления
		|	И энргСтроения.Район = &Район";
	
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		СтруктураJSON			= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ВыборкаДетальныеЗаписи.Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Город			= СтруктураJSON.City;
		ГородТип		= НРег(СтруктураJSON.CityType);
		
		НаселПункт      = СтруктураJSON.Locality;
		НаселПунктТип   = НРег(СтруктураJSON.LocalityType);

		
		Если ЗначениеЗаполнено(Город) Тогда
			
			СтрГород = ВРег(ГородТип + " " + Город);
			НайденныйИндекс = МассивНП.Найти(СтрГород);
			Если НайденныйИндекс = Неопределено Тогда
				МассивНП.Добавить(СтрГород);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаселПункт) Тогда
			
			СтрНаселПункт = ВРег(НаселПунктТип + " " + НаселПункт);
			НайденныйИндекс = МассивНП.Найти(СтрНаселПункт);
			Если НайденныйИндекс = Неопределено Тогда
				МассивНП.Добавить(СтрНаселПункт);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Возврат МассивНП;
	
КонецФункции


&НаКлиенте
Процедура ВернутьЛьготникаНаОбработку(Команда)
	ВернутьЛьготникаНаОбработкуНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ВернутьЛьготникаНаОбработкуНаСервере()
	
	Для Каждого СтрокаНеЗагружено из НезагруженныеДанныеВнеЗоныГП Цикл
		
		Если СтрокаНеЗагружено.ВнеЗоныГП = Ложь Тогда 
			
			ПараметрыОтбора = Новый Структура;
			//ПараметрыОтбора.Вставить("НомерСтроки", СтрокаНеЗагружено.НомерСтроки);
			ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", СтрокаНеЗагружено.КодСоциальнойЗащиты);
			НайденныеСтроки = Объект.НеЗагруженныеДанные.НайтиСтроки(ПараметрыОтбора);   
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Если НайденныеСтроки[0].ВнеЗоныГП = Ложь Тогда
					Продолжить;
				Иначе
					ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрокаНеЗагружено,, "НомерСтроки");
					НайденныеСтроки[0].ВнеЗоныГП = Ложь;				
				КонецЕсли;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ЗаполнитьПредставлениеНеЗагруженныхДанныхСервер(Объект);

КонецПроцедуры    

#КонецОбласти

Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник, КопияНеЗагруженные)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КодСоциальнойЗащиты", Неопределено);
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		НоваяСтрока = ТаблицаПриемник.Добавить();	
		
		ПараметрыОтбора.КодСоциальнойЗащиты = СтрокаТаблицыИсточник.КодСоциальнойЗащиты;
		НайденныеСтроки = КопияНеЗагруженные.НайтиСтроки(ПараметрыОтбора);		
		Если НайденныеСтроки.Количество() > 0 Тогда		
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0],, "НомерСтроки");
		КонецЕсли; 		
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник,, "НомерСтроки");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСлужебныеДанные()
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ЗагруженныеДанные");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "НезагруженныеДанные");
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АбонентыСОтлюченнойЛьготой, "Регистратор", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти