#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает приоритеты видов дифференцированности.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ПолучитьПриоритетыВидовДифференцированности() Экспорт
	
	ПриоритетыВидовДифференцированности = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПриоритетыВидовДифференцированностиТекстЗапроса(); 
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПриоритетыВидовДифференцированности.Вставить(ВыборкаДетальныеЗаписи.ВидДифференцированности, ВыборкаДетальныеЗаписи.Приоритет);
	КонецЦикла;
		
	Возврат ПриоритетыВидовДифференцированности;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПриоритетыВидовДифференцированностиТекстЗапроса()
	
	Возврат "ВЫБРАТЬ
	|	энргПриоритетыВидовДифференцированности.ВидДифференцированности КАК ВидДифференцированности,
	|	энргПриоритетыВидовДифференцированности.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.энргПриоритетыВидовДифференцированности КАК энргПриоритетыВидовДифференцированности";
	
КонецФункции

#КонецОбласти

#КонецЕсли