#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги, Истина, Ложь));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОперацияСУслугами.Ссылка КАК Ссылка,
	|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	ВЫБОР
	|		КОГДА энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|			ТОГДА ИСТИНА
	|		КОГДА энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОРП,
	|	ВЫБОР
	|		КОГДА энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги)
	|				И энргОперацияСУслугами.ДатаФактическогоСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|	КОНЕЦ КАК СостояниеПроведения
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|ГДЕ
	|	энргОперацияСУслугами.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПриборов.ПриборУчета КАК ПриборУчета,
	|	ШапкаДокумента.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ШапкаДокумента.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ШапкаДокумента.Разделитель КАК Разделитель,
	|	ШапкаДокумента.СостояниеПроведения КАК СостояниеПроведения
	|ИЗ
	|	ШапкаДокумента КАК ШапкаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаПриборов
	|		ПО ШапкаДокумента.Ссылка = ТаблицаПриборов.Ссылка
	|			И (ТаблицаПриборов.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (ШапкаДокумента.ЭтоОРП = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаПриборов.ПриборУчета,
	|	ШапкаДокумента.ВыводПрибораУчета,
	|	ШапкаДокумента.ИмяТабЧасти,
	|	ШапкаДокумента.Разделитель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ)
	|ИЗ
	|	ШапкаДокумента КАК ШапкаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаПриборов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалыПриборовУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|				ПО (ТаблицаПоказанияПриборовУчета.Ссылка = &Ссылка)
	|					И ТаблицаШкалыПриборовУчета.Ссылка = ТаблицаПоказанияПриборовУчета.Ссылка
	|					И ТаблицаШкалыПриборовУчета.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|			ПО (ТаблицаШкалыПриборовУчета.Ссылка = &Ссылка)
	|				И ТаблицаПриборов.Ссылка = ТаблицаШкалыПриборовУчета.Ссылка
	|				И ТаблицаПриборов.IDСтроки = ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета
	|		ПО ШапкаДокумента.Ссылка = ТаблицаПриборов.Ссылка
	|			И (ТаблицаПриборов.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (ШапкаДокумента.ЭтоОРП)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриборов.ПриборУчета,
	|	ШапкаДокумента.ВыводПрибораУчета,
	|	ШапкаДокумента.ИмяТабЧасти,
	|	ШапкаДокумента.Разделитель";
	
	ДополнительныеСвойства.Вставить("МассивПриборов", Запрос.Выполнить());
	
КонецПроцедуры


// Получает абонентов плательщиков.
// 
// Возвращаемое значение:
//   Массив из Структура.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДатаФактическогоСобытия) Тогда
		Возврат МассивПлательщиков;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",		Ссылка);
	Запрос.УстановитьПараметр("ДатаФакта",	ДатаФактическогоСобытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОперацияСУслугами.Ссылка КАК Ссылка,
	|	энргОперацияСУслугами.ВидОперации КАК ВидОперации,
	|	энргОперацияСУслугами.Абонент КАК Абонент
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|ГДЕ
	|	энргОперацияСУслугами.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПриборов.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаПриборов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	|		ПО ТаблицаПриборов.Ссылка = ШапкаДокумента.Ссылка
	|			И (ТаблицаПриборов.Ссылка = &Ссылка)
	|			И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Плательщик КАК Плательщик,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТУ КАК ВТ_ТУ
	|		ПО энргСтабильныеПериоды.ТочкаУчета = ВТ_ТУ.ТочкаУчета
	|			И (энргСтабильныеПериоды.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И (энргСтабильныеПериоды.ПериодНачисления >= &ДатаФакта)
	|			И (энргСтабильныеПериоды.Абонент <> энргСтабильныеПериоды.Плательщик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргСтабильныеПериоды.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Плательщик,
	|	энргАбоненты.КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик,
	|	энргАбоненты.КлючПомещения
	|ИЗ
	|	Документ.энргОперацияСУслугами.ПоставщикиСоставныхУслуг КАК энргОперацияСУслугамиПоставщикиСоставныхУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	|		ПО энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка = ШапкаДокумента.Ссылка
	|			И (энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка = &Ссылка)
	|			И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик <> ШапкаДокумента.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик,
	|	энргАбоненты.КлючПомещения";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивПлательщиков.Добавить(Новый Структура("Абонент,КлючПомещения", Результат.Плательщик, Результат.КлючПомещения));
	КонецЦикла;
	
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда		
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТочкиУчета.ТочкаУчета");
		//для Каждого СтрокаТЧ из ТочкиУчета цикл
		//	Если ЗначениеЗаполнено(СтрокаТЧ.УдалитьЗаводскойНомер) и Не ЗначениеЗаполнено(СтрокаТЧ.УдалитьВидДифференцированности) тогда
		//		Отказ 		= истина;
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Вид дифференцированности",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ВидДифференцированности");
		//	КонецЕсли; 			
		//КонецЦикла;
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь(); 		
	энргРаботаСТочкамиУчетаСервер.УстановитьНаправлениеИспользованияТочекУчетаПоУмолчанию(ТочкиУчета);
	ДополнительныеСвойства.Вставить("ПроверятьСостояниеПоследовательностиВПолеВыборки", Ложь);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если НЕ ДополнительныеСвойства.Свойство("НеЗаполнятьДанныеПоПотерям") тогда
		энргРаботаСТочкамиУчетаСервер.ОчиститьДанныеПоПотерям(Потери);
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеПоПотерям(Потери);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЕстьПринятыеПоказанияДатойПозже() Тогда  
		Отказ = Истина;
		Комментарий = НСтр("ru = 'В системе зарегистрированы показания со статусом ""Приняты"" датой позже текущего документа'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги И Не ДополнительныеСвойства.Свойство("НеПроверятьТочкиСОРП") Тогда
 
		Если Документы.энргОперацияСУслугами.ЕстьТочкиСОРП(Дата, Организация, Район, КлючПомещения) Тогда
			Отказ = Истина;
			Комментарий = НСтр("ru = 'У Абонента введено ОРП, проведение данного документа невозможно. Создайте документ ВРП'");
			ОбщегоНазначения.СообщитьПользователю(Комментарий);
			ВызватьИсключение Комментарий;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.энргОперацияСУслугами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргОперацияСУслугами.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);  	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПринятыеПоказанияДатойПозже()
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги
			Или ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ПараметрыПроверки = Новый Структура("Дата, Организация, Район, КлючПомещения, Ссылка");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект); 
	
	ТЗ = ТочкиУчета.Выгрузить(, "ПриборУчета");	
	Возврат энргРаботаСПоказаниямиПриборовУчетаСервер.ЕстьПринятыеПоказанияДатойПозже(ТЗ.ВыгрузитьКолонку("ПриборУчета"), ПараметрыПроверки);
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли