
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
		//Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата);
		Объект.Дата = ТекущаяДата();
		//Объект.ДатаФактическогоСобытия = Объект.Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
	
	ЗаполнитьДокумент  = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли; 
	Если ЗаполнитьДокумент И ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		ЗаполнитьДанныеДоговораСервер();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, яИспользоватьТарифныеЗоны, яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("Контрагент"), Метаданные.Документы.бестОперацияСУслугамиНП);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());

	бестЛокализацияСервер.ПриСозданииНаСервере_бестОперацияСУслугамиНП(ЭтотОбъект, Объект.Ссылка);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	Если ДопСвойства.свойство("ДанныеДляФормулы") тогда
		ДанныеДляФормулы = ДопСвойства.ДанныеДляФормулы;		 
	иначе
		ДанныеДляФормулы = Неопределено;
	КонецЕсли;
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестОперацияСУслугамиНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ЕстьРасчетныеТочки = ПроверитьТочкиУчетаВРСРасчетныеФормулы();
		Если ЕстьРасчетныеТочки Тогда
			ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияУстановкиФормулы",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"В списке присутствуют принимающие участие в расчетах точки учета! Открыть документ установки формулы расчета?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия тогда
			ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСУслугамиНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьДанныеДоговораСервер();
	ЗаполнитьАдресОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекущиеДанные			= Элементы["ТочкиУчета"				+ ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТаблицаФормыШкал		= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета];
	
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,		"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомКанальности }
	
	Если ИспользоватьТарифныеЗоны Тогда
		ТаблицаФормыПоказания = Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета];
		СтрокиШкал = Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки));
		Если ЗначениеЗаполнено(СтрокиШкал) Тогда
			ТаблицаФормыШкал.ТекущаяСтрока = СтрокиШкал[0].ПолучитьИдентификатор();
			ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(ТаблицаФормыШкал);
			IDСтроки = СтрокиШкал[0].IDСтроки;
		Иначе
			IDСтроки = Неопределено;
		КонецЕсли;
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания, Неопределено, IDСтроки); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета");

	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");

	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета",ТаблицыФормыВторогоУровня);
	
	ТаблицыФормы				= Новый Массив;	

	ТаблицыФормы.Добавить("ШкалыУслуг");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,,ТаблицыФормыВторогоУровня);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, Объект, ТаблицыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ВыборПростыеУслугиИТочкиУчета(ТекДанные, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));

КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияУстановкиФормулы(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаУстановкаФормулыРасчета(ДанныеДляФормулы);
		иначе
			ДанныеДляФормулы = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказанияПУСервер(ИмяКоллекции) 
	
	ТаблицаПоказаний 						= Объект.ПоказанияПриборовУчета.Выгрузить();
	Объект.ПоказанияПриборовУчета.Очистить();
	
	//СтрокиСПрибором  						= Новый Массив;
	//Для Каждого СтрокаТочки из Объект.ТочкиУчета цикл
	//	Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) тогда
	//		СтрокиСПрибором.Добавить(СтрокаТочки);
	//	КонецЕсли;		
	//КонецЦикла;
	//ДанныеТочекУчета  						= Объект.ТочкиУчета.Выгрузить(СтрокиСПрибором);
	//////энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчета(Объект.ТочкиУчета,Объект.ПоказанияПриборовУчета,ТаблицаПоказаний,Объект.Дата,Объект.Район,Объект.МКД,Объект.Абонент,Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТочкиУчетаВРСРасчетныеФормулы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	энргОперацияСУслугамиТочкиУчета.ТочкаУчета
	|ПОМЕСТИТЬ ВрТ
	|ИЗ
	|	Документ.энргОперацияСУслугами.ТочкиУчета КАК энргОперацияСУслугамиТочкиУчета
	|ГДЕ
	|	энргОперацияСУслугамиТочкиУчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОперацияСУслугамиТочкиУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка, ЛОЖЬ) КАК Рассчитываемая
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник, ЛОЖЬ)
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия,Объект.Дата));
	Запрос.УстановитьПараметр("ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер()
		
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета,Истина,Истина); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	ТекШкала 									= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Шкала) И (НоваяТочка Или НЕ ТекШкала = Выборка.Шкала) Тогда
			
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла;
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

	
	//Результат 									= бестРаботаСприборамиУчетаСервер.ПриборыВсехТочекУчетаПоДоговору(Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор); 
	//Результат 									= бестРаботаСприборамиУчетаСервер.АктивныеТочкиИИхПриборыПоДоговору(Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор); 
	//Выборка  									= Результат.выбрать();
	//ТекТочкаУчета 								= Неопределено;
	//ТекПрибор 									= Неопределено;
	//ТекШкала 									= Неопределено;
	//IDСтрокиТочки 								= Неопределено;
	//IDСтрокиШкалы 								= Неопределено;
	//Пока Выборка.следующий() цикл
	//	НоваяТочка = Ложь;
	//	Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета или НЕ ТекПрибор = Выборка.ПриборУчета Тогда
	//		НоваяТочка = Истина;
	//		СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
	//		IDСтрокиТочки 						= Новый УникальныйИдентификатор;
	//		ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
	//		СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Выборка.Шкала) И (НоваяТочка Или НЕ ТекШкала = Выборка.Шкала) Тогда
	//	//Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
	//		СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
	//		IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
	//		СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
	//		СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
	//		СтрокаШкалы.Шкала 					= Выборка.Шкала;
	//		СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
	//		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
	//		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
	//		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
	//	КонецЕсли;
	//	
	//	ТекТочкаУчета 							= Выборка.ТочкаУчета;
	//	ТекШкала 								= Выборка.Шкала;
	//	ТекПрибор 								= Выборка.ПриборУчета;
	//КонецЦикла;
	//

	//бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор,Ложь);
	//
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ВыборПростыеУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета, ПростыеУслуги",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	СтруктураОтбора.ПростыеУслуги = ЛОЖЬ;	
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		
		//ЗаполнитьТабличныеЧастиПоТочкеИУслуге(РезультатЗакрытия.ТочкаУчета, РезультатЗакрытия.Услуга);
		//ТекДанные.ТочкаУчета = ;
		//ТекДанные.Услуга = ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПоказанияТУ(Команда) 	
	ОбновитьПоказанияПУСервер("ТочкиУчета");	
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти







