#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьСвойстваЭлементаРолиСогласующих();
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ТребуетСогласованияПриИзменении(Элемент)
	УстановитьСвойстваЭлементаРолиСогласующих();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды

&НаСервере
Процедура УстановитьСвойстваЭлементаРолиСогласующих()
	ЗначениеСвойства = Объект.ТребуетСогласования;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РолиСогласующих", "Видимость", ЗначениеСвойства);
КонецПроцедуры

#КонецОбласти

