#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры = Неопределено) Экспорт
	
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	//	
	//бестВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	//Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьФормулуРасчетаТочекУчета(КомандыСоздатьНаОсновании);
	
КонецФункции

// Функция - Получает данные структуры сети по точке
//
// Параметры:
//  ДолеваяТочкаУчета	 - СправочникСсылка.энргТочкиУчета
//  Услуга				 - СправочникСсылка.энргВидыУслуг 
//  ОбъектРасчета		 - СправочникСсылка.бестОбъектыРасчета 
//  Район				 - СправочникСсылка.энргЗоныОтвественности
//  Организация			 - СправочникСсылка.Организации
//  Период				 - Дата
// 
// Возвращаемое значение:
//   - РезультатЗапроса
//
Функция ПолучитьДанныеСтруктурыСетиПоТочке(ДолеваяТочкаУчета, Услуга, ОбъектРасчета, Район, Организация, Период) Экспорт
	ГоловнаяСтруктураСети = ПолучитьГоловнуюСтруктуруСети(ДолеваяТочкаУчета,Услуга,ОбъектРасчета,Район,Организация,Период);
	Если ГоловнаяСтруктураСети <> Неопределено Тогда
		МассивПодчиненныхЭл = Новый Массив;
		МассивПодчиненныхЭл.Добавить(ГоловнаяСтруктураСети);
		ОбойтиПодчиненныеЭлементыСтруктурыСети(МассивПодчиненныхЭл, ГоловнаяСтруктураСети, Период);
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПодчиненныхЭл);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
		|ИЗ
		|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(&Период, СтруктураСети В (&мСтруктураСети)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних";
		
		Запрос.УстановитьПараметр("мСтруктураСети", МассивПодчиненныхЭл);
		Запрос.УстановитьПараметр("Период", Период);
		
		Возврат Запрос.Выполнить();
	КонецЕсли;
КонецФункции

// Функция - Получает головную структуру сети
//
// Параметры:
//  ДолеваяТочкаУчета	 - СправочникСсылка.энргТочкиУчета
//  Услуга				 - СправочникСсылка.энргВидыУслуг 
//  ОбъектРасчета		 - СправочникСсылка.бестОбъектыРасчета 
//  Район				 - СправочникСсылка.энргЗоныОтвественности
//  Организация			 - СправочникСсылка.Организации
//  Период				 - Дата 
// 
// Возвращаемое значение:
//   - СправочникСсылка.бестСтруктураСети
//
Функция ПолучитьГоловнуюСтруктуруСети(ДолеваяТочкаУчета, Услуга, ОбъектРасчета, Район, Организация, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети
		|ИЗ
		|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Услуга = &Услуга
		|				И ТочкаУчета = &ТочкаУчета) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ДолеваяТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтруктураСети;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

#Область РеализацияИнтерфейса_ДоступныеВидыОпераций

// Функция - Заполняет список возможных операций для формы списка
// 
// Возвращаемое значение:
//   - СписокЗначений
//
Функция ЗаполнитьСписокВозможныхОперацийФормаСписка() Экспорт 
	СписокОпераций = Новый СписокЗначений;
	СписокОпераций.Добавить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле, НСтр("ru = 'Начисление по формуле'"));
	СписокОпераций.Добавить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле, НСтр("ru = 'Отмена начислений по формуле'"));
		
	Возврат СписокОпераций;
КонецФункции

// Функция - Заполняет соответствие возможных операций и префиксов форм 
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ПрефиксФормы() Экспорт	
	Соотвествие = Новый Соответствие;
	Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле, "НачислениеПоФормуле");
	Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле, "ОтменаНачисленийПоФормуле");;
	
	Возврат Соотвествие;	
КонецФункции

// Функция - Заполняет массив возможных операций
// 
// Возвращаемое значение:
//   - Массив
//
Функция ВидыОпераций() Экспорт 
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле);
	ВидыОпераций.Добавить(Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле);
	
	Возврат ВидыОпераций;	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// TODO когда заказчикам понадобится операция отмены расчета по формулам, раскомментирую

//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
//	Поля.добавить("Номер");
//	Поля.добавить("Дата");
//	Поля.добавить("ВидОперации");
//	СтандартнаяОбработка = Ложь; 	
//КонецПроцедуры

//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
//	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
//	СтандартнаяОбработка 	= Ложь;
//КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестУстановитьФормулуРасчетаТочекУчетаНП", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестУстановитьФормулуРасчетаТочекУчетаНП", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестУстановитьФормулуРасчетаТочекУчетаНП", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента", "бестУстановитьФормулуРасчетаТочекУчетаНП");
			Параметры.вставить("ВыборОперации", Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбойтиПодчиненныеЭлементыСтруктурыСети(МассивПодчиненныхЭл, Источник, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСтруктураСетиСрезПоследних.Приемник КАК Приемник
		|ИЗ
		|	РегистрСведений.бестСтруктураСети.СрезПоследних(&Период, Источник = &Источник) КАК бестСтруктураСетиСрезПоследних
		|ГДЕ
		|	бестСтруктураСетиСрезПоследних.Актуальность";
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПодчиненныхЭл.Добавить(ВыборкаДетальныеЗаписи.Приемник);
		ОбойтиПодчиненныеЭлементыСтруктурыСети(МассивПодчиненныхЭл, ВыборкаДетальныеЗаписи.Приемник, Период);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли