#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПроцедурыОбновленияИнформационнойБазы

Процедура ОбновитьКонтрольныеСуммы() Экспорт 
	ПараметрыНорматива 						= Перечисления.энргКлючевыеПараметрыНорматива.КлючиПараметров();
	
	Запрос  = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.энргКлючиНормативов КАК энргКлючиНормативов";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			 
		ОписаниеЗначения 			= Новый Структура(ПараметрыНорматива);
		ЗаполнитьЗначенияСвойств(ОписаниеЗначения, Выборка);
		ЭлементОбъект  				= Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ХэшСумма 		= энргОбщегоНазначения.КонтрольнаяСумма(ОписаниеЗначения);
		ЭлементОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

Функция ДанныеКлючейНорматива() Экспорт 
	Запрос  = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргКлючиНормативов.Ссылка КАК Ссылка,
	|	энргКлючиНормативов.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргКлючиНормативов.ВидСобственности КАК ВидСобственности,
	|	энргКлючиНормативов.ГодПостройкиОт КАК ГодПостройкиОт,
	|	энргКлючиНормативов.ГодПостройкиДо КАК ГодПостройкиДо,
	|	энргКлючиНормативов.КоличествоКомнатОт КАК КоличествоКомнатОт,
	|	энргКлючиНормативов.КоличествоКомнатДо КАК КоличествоКомнатДо,
	|	энргКлючиНормативов.КоличествоЧеловекОт КАК КоличествоЧеловекОт,
	|	энргКлючиНормативов.КоличествоЧеловекДо КАК КоличествоЧеловекДо,
	|	энргКлючиНормативов.КоличествоПроживающихОт КАК КоличествоПроживающихОт,
	|	энргКлючиНормативов.КоличествоПроживающихДо КАК КоличествоПроживающихДо,
	|	энргКлючиНормативов.КоличествоПрописанныхОт КАК КоличествоПрописанныхОт,
	|	энргКлючиНормативов.КоличествоПрописанныхДо КАК КоличествоПрописанныхДо,
	|	энргКлючиНормативов.КоличествоЭтажейОт КАК КоличествоЭтажейОт,
	|	энргКлючиНормативов.КоличествоЭтажейДо КАК КоличествоЭтажейДо,
	|	энргКлючиНормативов.ИзмерительНаправленияИспользования КАК ИзмерительНаправленияИспользования
	|ИЗ
	|	Справочник.энргКлючиНормативов КАК энргКлючиНормативов";
	
	Результат  = Запрос.Выполнить();
	Возврат Результат; 
	
КонецФункции

Процедура КлючиПоСвойствамОбъекта(МоментВремени, Организация, Район, ТипНачисления,МВТ, ИмяТаблицы) Экспорт 
	ОписаниеПараметров 				= Перечисления.энргКлючевыеПараметрыНорматива.ОписаниеКлючевыхПараметров();
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("ТипНачисления", 	ТипНачисления);
	Текст 							= ТекстОпределенияКлючейНорматива();
	Текст 							= СтрЗаменить(Текст, "ПОМЕСТИТЬ КлючиНорматива", "ПОМЕСТИТЬ " + ИмяТаблицы + "");
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();	
КонецПроцедуры

Функция НайтиИлиСоздатьКлючПараметра(КлючевыеЗначений, Отказ = Ложь) Экспорт 
	
	ПоискКлючей  														= Новый ТаблицаЗначений;
	ПоискКлючей.Колонки.Добавить("Индекс",								Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(4,0)));
	ПоискКлючей.Колонки.Добавить("КонтрольнаяСумма",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("ВидБлагоустройства",					Новый ОписаниеТипов("СправочникСсылка.энргВидыБлагоустройств"));
	ПоискКлючей.Колонки.Добавить("ВидСобственности",					Новый ОписаниеТипов("ПеречислениеСсылка.энргТипыСобственниковЖилья"));
	ПоискКлючей.Колонки.Добавить("ГодПостройкиОт",						Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("ГодПостройкиДо",						Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("ИзмерительНаправленияИспользования",	Новый ОписаниеТипов("СправочникСсылка.энргНаправлениеИспользованияТочекУчета"));
	ПоискКлючей.Колонки.Добавить("КоличествоКомнатОт",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоКомнатДо",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоЧеловекОт",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоЧеловекДо",					Новый ОписаниеТипов("Число"));	
	ПоискКлючей.Колонки.Добавить("КоличествоПроживающихОт",				Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоПроживающихДо",				Новый ОписаниеТипов("Число"));	
	ПоискКлючей.Колонки.Добавить("КоличествоПрописанныхОт",				Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоПрописанныхДо",				Новый ОписаниеТипов("Число"));  	
	ПоискКлючей.Колонки.Добавить("КоличествоЭтажейОт",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоЭтажейДо",					Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоСобственниковОт",			Новый ОписаниеТипов("Число"));
	ПоискКлючей.Колонки.Добавить("КоличествоСобственниковДо",			Новый ОписаниеТипов("Число"));
	
	КлючиПараметров							= Новый Массив;
	
	ПараметрыНорматива 						= Перечисления.энргКлючевыеПараметрыНорматива.КлючиПараметров();
	
	Для Сч = 0 По КлючевыеЗначений.ВГраница() Цикл		 
		ОписаниеЗначения 					= Новый Структура(ПараметрыНорматива);
		ЗаполнитьЗначенияСвойств(ОписаниеЗначения, 	КлючевыеЗначений[Сч]);
		
		СтрокаПоиска 						= ПоискКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоиска, 		КлючевыеЗначений[Сч]);
		СтрокаПоиска.Индекс  				= Сч;
		СтрокаПоиска.КонтрольнаяСумма 		= энргОбщегоНазначения.КонтрольнаяСумма(ОписаниеЗначения);		 
	КонецЦикла;	
	
	// ищем ключи
	МВТ 									= Новый МенеджерВременныхТаблиц;
	Запрос									= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц			= МВТ;
	Запрос.УстановитьПараметр("ПоискКлючей", ПоискКлючей);
	Запрос.Текст 							=
	"ВЫБРАТЬ
	|	ПоискКлючей.Индекс КАК Индекс,
	|	ПоискКлючей.КонтрольнаяСумма КАК КонтрольнаяСумма,
	|	ПоискКлючей.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ПоискКлючей.ГодПостройкиОт КАК ГодПостройкиОт,
	|	ПоискКлючей.ВидСобственности КАК ВидСобственности,
	|	ПоискКлючей.ГодПостройкиДо КАК ГодПостройкиДо,
	|	ПоискКлючей.ИзмерительНаправленияИспользования КАК ИзмерительНаправленияИспользования,
	|	ПоискКлючей.КоличествоКомнатОт КАК КоличествоКомнатОт,
	|	ПоискКлючей.КоличествоКомнатДо КАК КоличествоКомнатДо,
	|	ПоискКлючей.КоличествоЧеловекОт КАК КоличествоЧеловекОт,
	|	ПоискКлючей.КоличествоЧеловекДо КАК КоличествоЧеловекДо,
	|	ПоискКлючей.КоличествоПроживающихОт КАК КоличествоПроживающихОт,
	|	ПоискКлючей.КоличествоПроживающихДо КАК КоличествоПроживающихДо,
	|	ПоискКлючей.КоличествоПрописанныхОт КАК КоличествоПрописанныхОт,
	|	ПоискКлючей.КоличествоПрописанныхДо КАК КоличествоПрописанныхДо,
	|	ПоискКлючей.КоличествоЭтажейОт КАК КоличествоЭтажейОт,
	|	ПоискКлючей.КоличествоЭтажейДо КАК КоличествоЭтажейДо,
	|	ПоискКлючей.КоличествоСобственниковОт КАК КоличествоСобственниковОт,
	|	ПоискКлючей.КоличествоСобственниковДо КАК КоличествоСобственниковДо
	|ПОМЕСТИТЬ ПоискКлючей
	|ИЗ
	|	&ПоискКлючей КАК ПоискКлючей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКлючиНормативов.Ссылка КАК Ссылка,
	|	ПоискКлючей.Индекс КАК Индекс
	|ИЗ
	|	ПоискКлючей КАК ПоискКлючей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
	|		ПО ПоискКлючей.ВидБлагоустройства = энргКлючиНормативов.ВидБлагоустройства
	|			И ПоискКлючей.ВидСобственности = энргКлючиНормативов.ВидСобственности
	|			И ПоискКлючей.ИзмерительНаправленияИспользования = энргКлючиНормативов.ИзмерительНаправленияИспользования
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.ГодПостройкиОт = 0
	|						И ПоискКлючей.ГодПостройкиДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.ГодПостройкиОт = 0
	|						И энргКлючиНормативов.ГодПостройкиДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.ГодПостройкиОт = энргКлючиНормативов.ГодПостройкиОт
	|						И ПоискКлючей.ГодПостройкиДо = энргКлючиНормативов.ГодПостройкиДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.ГодПостройкиОт >= энргКлючиНормативов.ГодПостройкиОт
	|						И ПоискКлючей.ГодПостройкиДо > энргКлючиНормативов.ГодПостройкиОт
	|						И энргКлючиНормативов.ГодПостройкиДо = 0
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.ГодПостройкиОт >= ПоискКлючей.ГодПостройкиОт
	|						И энргКлючиНормативов.ГодПостройкиДо > ПоискКлючей.ГодПостройкиОт
	|						И ПоискКлючей.ГодПостройкиДо = 0
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.ГодПостройкиОт < энргКлючиНормативов.ГодПостройкиДо
	|						И ПоискКлючей.ГодПостройкиОт >= энргКлючиНормативов.ГодПостройкиОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.ГодПостройкиОт < ПоискКлючей.ГодПостройкиДо
	|						И энргКлючиНормативов.ГодПостройкиОт >= ПоискКлючей.ГодПостройкиОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.ГодПостройкиДо < энргКлючиНормативов.ГодПостройкиДо
	|						И ПоискКлючей.ГодПостройкиДо > энргКлючиНормативов.ГодПостройкиОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.ГодПостройкиДо < ПоискКлючей.ГодПостройкиДо
	|						И энргКлючиНормативов.ГодПостройкиДо > ПоискКлючей.ГодПостройкиОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоКомнатОт = 0
	|						И ПоискКлючей.КоличествоКомнатДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоКомнатОт = 0
	|						И энргКлючиНормативов.КоличествоКомнатДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоКомнатОт = энргКлючиНормативов.КоличествоКомнатОт
	|						И ПоискКлючей.КоличествоКомнатДо = энргКлючиНормативов.КоличествоКомнатДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоКомнатОт >= энргКлючиНормативов.КоличествоКомнатОт
	|						И (ПоискКлючей.КоличествоКомнатДо > энргКлючиНормативов.КоличествоКомнатДо
	|							И энргКлючиНормативов.КоличествоКомнатДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоКомнатОт >= ПоискКлючей.КоличествоКомнатОт
	|						И (энргКлючиНормативов.КоличествоКомнатДо > ПоискКлючей.КоличествоКомнатДо
	|							И ПоискКлючей.КоличествоКомнатДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоКомнатОт < энргКлючиНормативов.КоличествоКомнатДо
	|						И ПоискКлючей.КоличествоКомнатОт >= энргКлючиНормативов.КоличествоКомнатОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоКомнатОт < ПоискКлючей.КоличествоКомнатДо
	|						И энргКлючиНормативов.КоличествоКомнатОт >= ПоискКлючей.КоличествоКомнатОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоКомнатДо < энргКлючиНормативов.КоличествоКомнатДо
	|						И ПоискКлючей.КоличествоКомнатДо > энргКлючиНормативов.КоличествоКомнатОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоКомнатДо < ПоискКлючей.КоличествоКомнатДо
	|						И энргКлючиНормативов.КоличествоКомнатДо > ПоискКлючей.КоличествоКомнатОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоЧеловекОт = 0
	|						И ПоискКлючей.КоличествоЧеловекДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоЧеловекОт = 0
	|						И энргКлючиНормативов.КоличествоЧеловекДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоЧеловекОт = энргКлючиНормативов.КоличествоЧеловекОт
	|						И ПоискКлючей.КоличествоЧеловекДо = энргКлючиНормативов.КоличествоЧеловекДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЧеловекОт >= энргКлючиНормативов.КоличествоЧеловекОт
	|						И (ПоискКлючей.КоличествоЧеловекДо > энргКлючиНормативов.КоличествоЧеловекДо
	|							И энргКлючиНормативов.КоличествоЧеловекДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЧеловекОт >= ПоискКлючей.КоличествоЧеловекОт
	|						И (энргКлючиНормативов.КоличествоЧеловекДо > ПоискКлючей.КоличествоЧеловекДо
	|							И ПоискКлючей.КоличествоЧеловекДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЧеловекОт < энргКлючиНормативов.КоличествоЧеловекДо
	|						И ПоискКлючей.КоличествоЧеловекОт >= энргКлючиНормативов.КоличествоЧеловекОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЧеловекОт < ПоискКлючей.КоличествоЧеловекДо
	|						И энргКлючиНормативов.КоличествоЧеловекОт >= ПоискКлючей.КоличествоЧеловекОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЧеловекДо < энргКлючиНормативов.КоличествоЧеловекДо
	|						И ПоискКлючей.КоличествоЧеловекДо > энргКлючиНормативов.КоличествоЧеловекОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЧеловекДо < ПоискКлючей.КоличествоЧеловекДо
	|						И энргКлючиНормативов.КоличествоЧеловекДо > ПоискКлючей.КоличествоЧеловекОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоПроживающихОт = 0
	|						И ПоискКлючей.КоличествоПроживающихДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоПроживающихОт = 0
	|						И энргКлючиНормативов.КоличествоПроживающихДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоПроживающихОт = энргКлючиНормативов.КоличествоПроживающихОт
	|						И ПоискКлючей.КоличествоПроживающихДо = энргКлючиНормативов.КоличествоПроживающихДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПроживающихОт >= энргКлючиНормативов.КоличествоПроживающихОт
	|						И (ПоискКлючей.КоличествоПроживающихДо > энргКлючиНормативов.КоличествоПроживающихДо
	|							И энргКлючиНормативов.КоличествоПроживающихДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПроживающихОт >= ПоискКлючей.КоличествоПроживающихОт
	|						И (энргКлючиНормативов.КоличествоПроживающихДо > ПоискКлючей.КоличествоПроживающихДо
	|							И ПоискКлючей.КоличествоПроживающихДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПроживающихОт < энргКлючиНормативов.КоличествоПроживающихДо
	|						И ПоискКлючей.КоличествоПроживающихОт >= энргКлючиНормативов.КоличествоПроживающихОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПроживающихОт < ПоискКлючей.КоличествоПроживающихДо
	|						И энргКлючиНормативов.КоличествоПроживающихОт >= ПоискКлючей.КоличествоПроживающихОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПроживающихДо < энргКлючиНормативов.КоличествоПроживающихДо
	|						И ПоискКлючей.КоличествоПроживающихДо > энргКлючиНормативов.КоличествоПроживающихОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПроживающихДо < ПоискКлючей.КоличествоПроживающихДо
	|						И энргКлючиНормативов.КоличествоПроживающихДо > ПоискКлючей.КоличествоПроживающихОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоСобственниковОт = 0
	|						И ПоискКлючей.КоличествоСобственниковДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоСобственниковОт = 0
	|						И энргКлючиНормативов.КоличествоСобственниковДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоСобственниковОт = энргКлючиНормативов.КоличествоСобственниковОт
	|						И ПоискКлючей.КоличествоСобственниковДо = энргКлючиНормативов.КоличествоСобственниковДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоСобственниковОт >= энргКлючиНормативов.КоличествоСобственниковОт
	|						И (ПоискКлючей.КоличествоСобственниковДо > энргКлючиНормативов.КоличествоСобственниковДо
	|							И энргКлючиНормативов.КоличествоПроживающихДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоСобственниковОт >= ПоискКлючей.КоличествоСобственниковОт
	|						И (энргКлючиНормативов.КоличествоСобственниковДо > ПоискКлючей.КоличествоСобственниковДо
	|							И ПоискКлючей.КоличествоСобственниковДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоСобственниковОт < энргКлючиНормативов.КоличествоСобственниковДо
	|						И ПоискКлючей.КоличествоСобственниковОт >= энргКлючиНормативов.КоличествоСобственниковОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоСобственниковОт < ПоискКлючей.КоличествоСобственниковДо
	|						И энргКлючиНормативов.КоличествоСобственниковОт >= ПоискКлючей.КоличествоСобственниковОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоСобственниковДо < энргКлючиНормативов.КоличествоСобственниковДо
	|						И ПоискКлючей.КоличествоСобственниковДо > энргКлючиНормативов.КоличествоСобственниковОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоСобственниковДо < ПоискКлючей.КоличествоСобственниковДо
	|						И энргКлючиНормативов.КоличествоСобственниковДо > ПоискКлючей.КоличествоСобственниковОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоПрописанныхОт = 0
	|						И ПоискКлючей.КоличествоПрописанныхДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоПрописанныхОт = 0
	|						И энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоПрописанныхОт = энргКлючиНормативов.КоличествоПрописанныхОт
	|						И ПоискКлючей.КоличествоПрописанныхДо = энргКлючиНормативов.КоличествоПрописанныхДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПрописанныхОт >= энргКлючиНормативов.КоличествоПрописанныхОт
	|						И (ПоискКлючей.КоличествоПрописанныхДо > энргКлючиНормативов.КоличествоПрописанныхДо
	|							И энргКлючиНормативов.КоличествоПрописанныхДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПрописанныхОт >= ПоискКлючей.КоличествоПрописанныхОт
	|						И (энргКлючиНормативов.КоличествоПрописанныхДо > ПоискКлючей.КоличествоПрописанныхДо
	|							И ПоискКлючей.КоличествоПрописанныхДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПрописанныхОт < энргКлючиНормативов.КоличествоПрописанныхДо
	|						И ПоискКлючей.КоличествоПрописанныхОт >= энргКлючиНормативов.КоличествоПрописанныхОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПрописанныхОт < ПоискКлючей.КоличествоПрописанныхДо
	|						И энргКлючиНормативов.КоличествоПрописанныхОт >= ПоискКлючей.КоличествоПрописанныхОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоПрописанныхДо < энргКлючиНормативов.КоличествоПрописанныхДо
	|						И ПоискКлючей.КоличествоПрописанныхДо > энргКлючиНормативов.КоличествоПрописанныхОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоПрописанныхДо < ПоискКлючей.КоличествоПрописанныхДо
	|						И энргКлючиНормативов.КоличествоПрописанныхДо > ПоискКлючей.КоличествоПрописанныхОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ПоискКлючей.КоличествоЭтажейОт = 0
	|						И ПоискКлючей.КоличествоЭтажейДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА энргКлючиНормативов.КоличествоЭтажейОт = 0
	|						И энргКлючиНормативов.КоличествоЭтажейДо = 0
	|					ТОГДА ЛОЖЬ
	|				КОГДА ПоискКлючей.КоличествоЭтажейОт = энргКлючиНормативов.КоличествоЭтажейОт
	|						И ПоискКлючей.КоличествоЭтажейДо = энргКлючиНормативов.КоличествоЭтажейДо
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЭтажейОт >= энргКлючиНормативов.КоличествоЭтажейОт
	|						И (ПоискКлючей.КоличествоЭтажейДо > энргКлючиНормативов.КоличествоЭтажейДо
	|							И энргКлючиНормативов.КоличествоЭтажейДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЭтажейОт >= ПоискКлючей.КоличествоЭтажейОт
	|						И (энргКлючиНормативов.КоличествоЭтажейДо > ПоискКлючей.КоличествоЭтажейДо
	|							И ПоискКлючей.КоличествоЭтажейДо = 0)
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЭтажейОт < энргКлючиНормативов.КоличествоЭтажейДо
	|						И ПоискКлючей.КоличествоЭтажейОт >= энргКлючиНормативов.КоличествоЭтажейОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЭтажейОт < ПоискКлючей.КоличествоЭтажейДо
	|						И энргКлючиНормативов.КоличествоЭтажейОт >= ПоискКлючей.КоличествоЭтажейОт
	|					ТОГДА ИСТИНА
	|				КОГДА ПоискКлючей.КоличествоЭтажейДо < энргКлючиНормативов.КоличествоЭтажейДо
	|						И ПоискКлючей.КоличествоЭтажейДо > энргКлючиНормативов.КоличествоЭтажейОт
	|					ТОГДА ИСТИНА
	|				КОГДА энргКлючиНормативов.КоличествоЭтажейДо < ПоискКлючей.КоличествоЭтажейДо
	|						И энргКлючиНормативов.КоличествоЭтажейДо > ПоискКлючей.КоличествоЭтажейОт
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ энргКлючиНормативов.ПометкаУдаления)
	|			И ПоискКлючей.КонтрольнаяСумма <> энргКлючиНормативов.ХэшСумма
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс";
	
	Результат 								= Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка  								= Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураДублей = Новый Структура;
			СтруктураДублей.Вставить("Индекс", Выборка.Индекс + 1);
			СтруктураДублей.Вставить("Дубль", Выборка.Ссылка);
			КлючиПараметров.Добавить(СтруктураДублей);
		КонецЦикла;
		
		Отказ = Истина;
		Возврат КлючиПараметров;
	Иначе
		
		
		Запрос									= Новый Запрос;
		Запрос.МенеджерВременныхТаблиц			= МВТ;
		Запрос.Текст 							=
		"ВЫБРАТЬ
		|	ПоискКлючей.Индекс КАК Индекс,
		|	ПоискКлючей.КонтрольнаяСумма КАК КонтрольнаяСумма,
		|	ЕСТЬNULL(энргКлючиНормативов.Ссылка, ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяСсылка)) КАК Ссылка
		|ИЗ
		|	ПоискКлючей КАК ПоискКлючей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
		|		ПО ПоискКлючей.КонтрольнаяСумма = энргКлючиНормативов.ХэшСумма
		|			И (НЕ энргКлючиНормативов.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс";
		Результат 								= Запрос.Выполнить();
		
		Выборка  								= Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Ссылка) Тогда 			 
				КлючиПараметров.Вставить(Выборка.Индекс,СоздатьЭлементПоПараметрам(КлючевыеЗначений[Выборка.Индекс], Выборка.КонтрольнаяСумма));
			Иначе
				КлючиПараметров.Вставить(Выборка.Индекс,Выборка.Ссылка);
			КонецЕсли;		
		КонецЦикла;
		
		Возврат КлючиПараметров;
	КонецЕсли;
КонецФункции

Функция ПараметрыНорматива(ДанныеЗаполнения) Экспорт 
	
	ПараметрыНорматива 							= Новый Структура("ВидБлагоустройства, ВидСобственности, ГодПостройки, КоличествоКомнат, КоличествоПроживающих, КоличествоПрописанных, КоличествоЧеловек, КоличествоЭтажей");
	Если ДанныеЗаполнения.Свойство("ВидБлагоустройства") Тогда
		ПараметрыНорматива.ВидБлагоустройства 	= ДанныеЗаполнения.ВидБлагоустройства;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ВидСобственности") Тогда
		ПараметрыНорматива.ВидСобственности 	= ДанныеЗаполнения.ВидСобственности;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ГодПостройки") Тогда
		ПараметрыНорматива.ГодПостройки 		= ДанныеЗаполнения.ГодПостройки;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("КоличествоКомнат") Тогда
		ПараметрыНорматива.КоличествоКомнат 	= ДанныеЗаполнения.КоличествоКомнат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("КоличествоПроживающих") Тогда
		ПараметрыНорматива.КоличествоПроживающих 	= ДанныеЗаполнения.КоличествоПроживающих;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("КоличествоПрописанных") Тогда
		ПараметрыНорматива.КоличествоПрописанных 	= ДанныеЗаполнения.КоличествоПрописанных;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("КоличествоЧеловек") Тогда
		ПараметрыНорматива.КоличествоЧеловек 	= ДанныеЗаполнения.КоличествоЧеловек;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("КоличествоЭтажей") Тогда
		ПараметрыНорматива.КоличествоЭтажей 	= ДанныеЗаполнения.КоличествоЭтажей;
	КонецЕсли;                       		

	Возврат Новый ФиксированнаяСтруктура(ПараметрыНорматива);	
	 	
КонецФункции

Функция ПолучаемыеСвойстваПомещения(СвойстваИсключая = "") Экспорт 
 	
	ПолучаемыеСвойства = 
	"ВидБлагоустройства,ВидСобственности,ГодПостройки,КоличествоКомнат,
	|КоличествоПрописанных,КоличествоПроживающих,КоличествоСобственников,КоличествоЭтажей,КоличествоЖильцов";
	
	Если НЕ ПустаяСтрока(СвойстваИсключая) Тогда
		яСвойстваИсключая 	= СтрЗаменить(СвойстваИсключая," ","");
		ПолучаемыеСвойства 	= СтрЗаменить(ПолучаемыеСвойства,яСвойстваИсключая,"");
	КонецЕсли;
	
	Возврат ПолучаемыеСвойства;
	
КонецФункции

Функция ТекстОпределенияКлючейНорматива(ЕстьИзмерители = Ложь, ИмяТаблицыВсеПараметрыРасчета = Неопределено) Экспорт 
	
	Схема 							= Неопределено;
	Постфикс 						= ?(ИмяТаблицыВсеПараметрыРасчета = Неопределено,"",ИмяТаблицыВсеПараметрыРасчета);
	РегистрыСведений.энргУстановленныеПараметрыРасчетаНорматива.ДействующуюРазрезыНорматива(Схема,Новый Структура,"ДействующуюРазрезыНорматива" + Постфикс);
		
	Пакет  							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗначенияРазрезов(ЕстьИзмерители));
	
	Если Не ИмяТаблицыВсеПараметрыРасчета = Неопределено Тогда
		Оператор 					= Пакет.Операторы[0];
		Источник 					= Оператор.Источники[0].Источник;
		Источник.ИмяТаблицы 		= ИмяТаблицыВсеПараметрыРасчета;
		Пакет.ТаблицаДляПомещения 	= Пакет.ТаблицаДляПомещения + Постфикс;
	КонецЕсли;
		
	Пакет  							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстКлючиНормативаПоРазрезам());
	Если Не ИмяТаблицыВсеПараметрыРасчета = Неопределено Тогда
		Пакет.ТаблицаДляПомещения 	= Пакет.ТаблицаДляПомещения + Постфикс;
		Источник 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник;
		Источник.ИмяТаблицы 		= Источник.ИмяТаблицы + Постфикс;
		
		Источник 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[1].Источник;
		Источник.ИмяТаблицы 		= Источник.ИмяТаблицы + Постфикс; 	
	КонецЕсли;
	Возврат Схема.ПолучитьТекстЗапроса();
		
КонецФункции

Функция ТекстОпределенияКлючейНормативаМКД() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.МКД КАК МКД,
	|	ВсеПараметрыРасчета.Услуга КАК Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидСобственности) КАК ВидСобственности,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ГодПостройки) КАК ГодПостройки,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВсеПараметрыРасчета.КоличествоПроживающих = 0
	|				ТОГДА ВсеПараметрыРасчета.КоличествоПроживающих
	|			КОГДА НЕ ВсеПараметрыРасчета.КоличествоПрописанных = 0
	|				ТОГДА ВсеПараметрыРасчета.КоличествоПрописанных
	|			ИНАЧЕ ВсеПараметрыРасчета.КоличествоСобственников
	|		КОНЕЦ) КАК КоличествоЧеловек,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоЭтажей) КАК КоличествоЭтажей,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК Измеритель
	|ПОМЕСТИТЬ ЗначенияРазрезов
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПараметрыРасчета.МКД,
	|	ВсеПараметрыРасчета.Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель КАК Измеритель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючНорматива,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючСоцНорматива,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства
	|ПОМЕСТИТЬ КлючиНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначенияРазрезов.МКД КАК МКД,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|		ВложенныйЗапрос.РазрезВидБлагоустройства КАК РазрезВидБлагоустройства,
	|		ВложенныйЗапрос.РазрезВидСобственности КАК РазрезВидСобственности,
	|		ВложенныйЗапрос.РазрезГодПостройки КАК РазрезГодПостройки,
	|		ВложенныйЗапрос.РазрезКоличествоКомнат КАК РазрезКоличествоКомнат,
	|		ВложенныйЗапрос.РазрезКоличествоЧеловек КАК РазрезКоличествоЧеловек,
	|		ВложенныйЗапрос.РазрезКоличествоПрописанных КАК РазрезКоличествоПрописанных,
	|		ВложенныйЗапрос.РазрезКоличествоПроживающих КАК РазрезКоличествоПроживающих,
	|		ВложенныйЗапрос.РазрезКоличествоЭтажей КАК РазрезКоличествоЭтажей,
	|		ВложенныйЗапрос.РазрезИзмерительНаправленияИспользования КАК РазрезИзмерительНаправленияИспользования,
	|		ЗначенияРазрезов.ВидБлагоустройства КАК ВидБлагоустройства,
	|		ЗначенияРазрезов.ВидСобственности КАК ВидСобственности,
	|		ЗначенияРазрезов.ГодПостройки КАК ГодПостройки,
	|		ЗначенияРазрезов.КоличествоКомнат КАК КоличествоКомнат,
	|		ЗначенияРазрезов.КоличествоЧеловек КАК КоличествоЧеловек,
	|		ЗначенияРазрезов.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ЗначенияРазрезов.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ЗначенияРазрезов.КоличествоЭтажей КАК КоличествоЭтажей,
	|		ЗначенияРазрезов.Измеритель КАК Измеритель
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезВидБлагоустройства,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезВидСобственности,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезГодПостройки,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоКомнат,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗАпрос.Услуга КАК Услуга,
	|				энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|				энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив
	|			ИЗ
	|				(ВЫБРАТЬ
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга КАК Услуга,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления КАК ТипНачисления,
	|					МАКСИМУМ(энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период) КАК Период,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив КАК СоциальныйНорматив
	|				ИЗ
	|					РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|							&МоментВремени,
	|							Организация = &Организация
	|								И Район = &Район
	|								И ТипНачисления = &ТипНачисления) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|				
	|				СГРУППИРОВАТЬ ПО
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|				
	|				ОБЪЕДИНИТЬ ВСЕ
	|				
	|				ВЫБРАТЬ
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|					МАКСИМУМ(энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период),
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|				ИЗ
	|					РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|							&МоментВремени,
	|							Организация = &Организация
	|								И Район = &Район
	|								И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|						ПО энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|							И (энргВидыУслуг.НормативДляИндивидуальных)
	|							И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|				
	|				СГРУППИРОВАТЬ ПО
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив) КАК ВложенныйЗАпрос
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|					ПО ВложенныйЗАпрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|						И ВложенныйЗАпрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|						И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|						И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|						И ВложенныйЗАпрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|						И ВложенныйЗАпрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|						И ВложенныйЗАпрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияРазрезов КАК ЗначенияРазрезов
	|			ПО ВложенныйЗапрос.Услуга = ЗначенияРазрезов.Услуга
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗначенияРазрезов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
	|		ПО (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидБлагоустройства
	|					ТОГДА ВложенныйЗапрос.ВидБлагоустройства = энргКлючиНормативов.ВидБлагоустройства
	|				ИНАЧЕ энргКлючиНормативов.ВидБлагоустройства = ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидСобственности
	|					ТОГДА ВложенныйЗапрос.ВидСобственности = энргКлючиНормативов.ВидСобственности
	|				ИНАЧЕ энргКлючиНормативов.ВидСобственности = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезИзмерительНаправленияИспользования
	|					ТОГДА ВложенныйЗапрос.Измеритель = энргКлючиНормативов.ИзмерительНаправленияИспользования
	|				ИНАЧЕ энргКлючиНормативов.ИзмерительНаправленияИспользования = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезГодПостройки
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.ГодПостройкиДо = 0
	|								ТОГДА ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|										И энргКлючиНормативов.ГодПостройкиОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|									И ВложенныйЗапрос.ГодПостройки < энргКлючиНормативов.ГодПостройкиДо
	|									И энргКлючиНормативов.ГодПостройкиОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.ГодПостройкиОт = 0
	|						И энргКлючиНормативов.ГодПостройкиДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоКомнат
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоКомнатДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|										И энргКлючиНормативов.КоличествоКомнатОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|									И ВложенныйЗапрос.КоличествоКомнат < энргКлючиНормативов.КоличествоКомнатДо
	|									И энргКлючиНормативов.КоличествоКомнатОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоКомнатОт = 0
	|						И энргКлючиНормативов.КоличествоКомнатДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЧеловек
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЧеловекДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоЧеловек >= энргКлючиНормативов.КоличествоЧеловекОт
	|										И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоЧеловек >= энргКлючиНормативов.КоличествоЧеловекОт
	|									И ВложенныйЗапрос.КоличествоЧеловек < энргКлючиНормативов.КоличествоЧеловекДо
	|									И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЧеловекОт = 0
	|						И энргКлючиНормативов.КоличествоЧеловекДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПрописанных
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|										И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|									И ВложенныйЗапрос.КоличествоПрописанных < энргКлючиНормативов.КоличествоПрописанныхДо
	|									И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПрописанныхОт = 0
	|						И энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПроживающих
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПроживающихДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|										И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|									И ВложенныйЗапрос.КоличествоПроживающих < энргКлючиНормативов.КоличествоПроживающихДо
	|									И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПроживающихОт = 0
	|						И энргКлючиНормативов.КоличествоПроживающихДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЭтажей
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЭтажейДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|										И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|									И ВложенныйЗапрос.КоличествоЭтажей < энргКлючиНормативов.КоличествоЭтажейДо
	|									И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЭтажейОт = 0
	|						И энргКлючиНормативов.КоличествоЭтажейДо = 0
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель,
	|	ВложенныйЗапрос.ВидБлагоустройства";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстОпределенияКлючейНормативаПерерасчет(ЕстьИзмерители = Ложь) Экспорт
	Текст = 
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ВсеПараметрыРасчета.НачалоОП КАК НачалоОП,
	|	ВсеПараметрыРасчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ВсеПараметрыРасчета.НачПер КАК НачПер,
	|	ВсеПараметрыРасчета.КонПер КАК КонПер,
	|	ВсеПараметрыРасчета.ДокРегистратор КАК ДокРегистратор,
	|	ВсеПараметрыРасчета.Услуга КАК Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидСобственности) КАК ВидСобственности,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ГодПостройки) КАК ГодПостройки,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоЭтажей) КАК КоличествоЭтажей,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК Измеритель
	|ПОМЕСТИТЬ ЗначенияРазрезов
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПараметрыРасчета.ПериодНачисления,
	|	ВсеПараметрыРасчета.НачалоОП,
	|	ВсеПараметрыРасчета.ЗавершениеОП,
	|	ВсеПараметрыРасчета.НачПер,
	|	ВсеПараметрыРасчета.КонПер,
	|	ВсеПараметрыРасчета.ДокРегистратор,
	|	ВсеПараметрыРасчета.Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ";
	
	Если ЕстьИзмерители Тогда
		Текст = Текст + 
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияИзмерителейНаправлений.ПериодНачисления КАК ПериодНачисления,
		|	ЗначенияИзмерителейНаправлений.НачалоОП КАК НачалоОП,
		|	ЗначенияИзмерителейНаправлений.ЗавершениеОП КАК ЗавершениеОП,
		|	ЗначенияИзмерителейНаправлений.НачПер КАК НачПер,
		|	ЗначенияИзмерителейНаправлений.КонПер КАК КонПер,
		|	ЗначенияИзмерителейНаправлений.ДокРегистратор КАК ДокРегистратор,
		|	ЗначенияИзмерителейНаправлений.Услуга,
		|	ЗначенияИзмерителейНаправлений.НаправлениеИспользованияТУ,
		|	ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗначенияИзмерителейНаправлений.Измеритель
		|ИЗ
		|	ЗначенияИзмерителейНаправлений КАК ЗначенияИзмерителейНаправлений";
	КонецЕсли;
	
	Текст = Текст +
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.НачПер КАК НачПер,
	|	ВложенныйЗапрос.КонПер КАК КонПер,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель КАК Измеритель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючНорматива,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючСоцНорматива
	|ПОМЕСТИТЬ КлючиНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ЗначенияРазрезов.НачалоОП КАК НачалоОП,
	|		ЗначенияРазрезов.ЗавершениеОП КАК ЗавершениеОП,
	|		ЗначенияРазрезов.НачПер КАК НачПер,
	|		ЗначенияРазрезов.КонПер КАК КонПер,
	|		ЗначенияРазрезов.ДокРегистратор КАК ДокРегистратор,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|		ВложенныйЗапрос.РазрезВидБлагоустройства КАК РазрезВидБлагоустройства,
	|		ВложенныйЗапрос.РазрезВидСобственности КАК РазрезВидСобственности,
	|		ВложенныйЗапрос.РазрезГодПостройки КАК РазрезГодПостройки,
	|		ВложенныйЗапрос.РазрезКоличествоКомнат КАК РазрезКоличествоКомнат,
	|		ВложенныйЗапрос.РазрезКоличествоЧеловек КАК РазрезКоличествоЧеловек,
	|		ВложенныйЗапрос.РазрезКоличествоПрописанных КАК РазрезКоличествоПрописанных,
	|		ВложенныйЗапрос.РазрезКоличествоПроживающих КАК РазрезКоличествоПроживающих,
	|		ВложенныйЗапрос.РазрезКоличествоЭтажей КАК РазрезКоличествоЭтажей,
	|		ВложенныйЗапрос.РазрезИзмерительНаправленияИспользования КАК РазрезИзмерительНаправленияИспользования,
	|		ЗначенияРазрезов.ВидБлагоустройства КАК ВидБлагоустройства,
	|		ЗначенияРазрезов.ВидСобственности КАК ВидСобственности,
	|		ЗначенияРазрезов.ГодПостройки КАК ГодПостройки,
	|		ЗначенияРазрезов.КоличествоКомнат КАК КоличествоКомнат,
	|		ЗначенияРазрезов.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ЗначенияРазрезов.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ЗначенияРазрезов.КоличествоЭтажей КАК КоличествоЭтажей,
	|		ЗначенияРазрезов.Измеритель КАК Измеритель
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезВидБлагоустройства,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезВидСобственности,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезГодПостройки,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоКомнат,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗАпрос.ПериодНачисления КАК ПериодНачисления,
	|				ВложенныйЗАпрос.Услуга КАК Услуга,
	|				энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|				энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.Услуга КАК Услуга,
	|					энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления КАК ТипНачисления,
	|					МАКСИМУМ(энргУстановленныеПараметрыРасчетаНорматива.Период) КАК Период,
	|					энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив
	|				ИЗ
	|					РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|						ПО энргУстановленныеПараметрыРасчетаНорматива.Период <= ГраницыОтчетногоПериода.ЗавершениеОП
	|							И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|							И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|							И (энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления = &ТипНачисления)
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ГраницыОтчетногоПериода.ПериодНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.Услуга,
	|					энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|				
	|				ОБЪЕДИНИТЬ ВСЕ
	|				
	|				ВЫБРАТЬ
	|					ГраницыОтчетногоПериода.ПериодНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.Услуга,
	|					энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					МАКСИМУМ(энргУстановленныеПараметрыРасчетаНорматива.Период),
	|					энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|				ИЗ
	|					РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|						ПО энргУстановленныеПараметрыРасчетаНорматива.Период <= ГраницыОтчетногоПериода.ЗавершениеОП
	|							И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|							И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|							И (энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|						ПО энргУстановленныеПараметрыРасчетаНорматива.Услуга = энргВидыУслуг.Ссылка
	|							И (энргВидыУслуг.НормативДляИндивидуальных)
	|							И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ГраницыОтчетногоПериода.ПериодНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.Услуга,
	|					энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗАпрос
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|					ПО ВложенныйЗАпрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|						И ВложенныйЗАпрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|						И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|						И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|						И ВложенныйЗАпрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|						И ВложенныйЗАпрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|						И ВложенныйЗАпрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.ПериодНачисления,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияРазрезов КАК ЗначенияРазрезов
	|			ПО ВложенныйЗапрос.ПериодНачисления = ЗначенияРазрезов.ПериодНачисления
	|				И ВложенныйЗапрос.Услуга = ЗначенияРазрезов.Услуга
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗначенияРазрезов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
	|		ПО (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидБлагоустройства
	|					ТОГДА ВложенныйЗапрос.ВидБлагоустройства = энргКлючиНормативов.ВидБлагоустройства
	|				ИНАЧЕ энргКлючиНормативов.ВидБлагоустройства = ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидСобственности
	|					ТОГДА ВложенныйЗапрос.ВидСобственности = энргКлючиНормативов.ВидСобственности
	|				ИНАЧЕ энргКлючиНормативов.ВидСобственности = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезИзмерительНаправленияИспользования
	|					ТОГДА ВложенныйЗапрос.Измеритель = энргКлючиНормативов.ИзмерительНаправленияИспользования
	|				ИНАЧЕ энргКлючиНормативов.ИзмерительНаправленияИспользования = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезГодПостройки
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.ГодПостройкиДо = 0
	|								ТОГДА ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|										И энргКлючиНормативов.ГодПостройкиОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|									И ВложенныйЗапрос.ГодПостройки < энргКлючиНормативов.ГодПостройкиДо
	|									И энргКлючиНормативов.ГодПостройкиОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.ГодПостройкиОт = 0
	|						И энргКлючиНормативов.ГодПостройкиДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоКомнат
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоКомнатДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|										И энргКлючиНормативов.КоличествоКомнатОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|									И ВложенныйЗапрос.КоличествоКомнат < энргКлючиНормативов.КоличествоКомнатДо
	|									И энргКлючиНормативов.КоличествоКомнатОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоКомнатОт = 0
	|						И энргКлючиНормативов.КоличествоКомнатДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЧеловек
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЧеловекДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоЧеловекОт
	|										И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоЧеловекОт
	|									И ВложенныйЗапрос.КоличествоПрописанных < энргКлючиНормативов.КоличествоЧеловекДо
	|									И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЧеловекОт = 0
	|						И энргКлючиНормативов.КоличествоЧеловекДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПрописанных
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|										И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|									И ВложенныйЗапрос.КоличествоПрописанных < энргКлючиНормативов.КоличествоПрописанныхДо
	|									И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПрописанныхОт = 0
	|						И энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПроживающих
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПроживающихДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|										И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|									И ВложенныйЗапрос.КоличествоПроживающих < энргКлючиНормативов.КоличествоПроживающихДо
	|									И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПроживающихОт = 0
	|						И энргКлючиНормативов.КоличествоПроживающихДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЭтажей
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЭтажейДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|										И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|									И ВложенныйЗапрос.КоличествоЭтажей < энргКлючиНормативов.КоличествоЭтажейДо
	|									И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЭтажейОт = 0
	|						И энргКлючиНормативов.КоличествоЭтажейДо = 0
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП,
	|	ВложенныйЗапрос.НачПер,
	|	ВложенныйЗапрос.КонПер,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗначенияРазрезов(ЕстьИзмерители)
	Текст = 
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.Строение КАК Строение,
	|	ВсеПараметрыРасчета.Помещение КАК Помещение,
	|	ВсеПараметрыРасчета.Услуга КАК Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ВидСобственности) КАК ВидСобственности,
	|	МАКСИМУМ(ВсеПараметрыРасчета.ГодПостройки) КАК ГодПостройки,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВсеПараметрыРасчета.КоличествоПроживающих = 0
	|				ТОГДА ВсеПараметрыРасчета.КоличествоПроживающих
	|			КОГДА НЕ ВсеПараметрыРасчета.КоличествоПрописанных = 0
	|				ТОГДА ВсеПараметрыРасчета.КоличествоПрописанных
	|			ИНАЧЕ ВсеПараметрыРасчета.КоличествоСобственников
	|		КОНЕЦ) КАК КоличествоЧеловек,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(ВсеПараметрыРасчета.КоличествоЭтажей) КАК КоличествоЭтажей,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК Измеритель
	|ПОМЕСТИТЬ ЗначенияРазрезов
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПараметрыРасчета.Строение,
	|	ВсеПараметрыРасчета.Помещение,
	|	ВсеПараметрыРасчета.Услуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ";
	
	Если ЕстьИзмерители Тогда
		Текст = Текст + 
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеПараметрыРасчетаСИзмерителями.Строение КАК Строение,
		|	ВсеПараметрыРасчетаСИзмерителями.Помещение КАК Помещение,
		|	ВсеПараметрыРасчетаСИзмерителями.Услуга,
		|	ВсеПараметрыРасчетаСИзмерителями.НаправлениеИспользованияТУ,
		|	ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВсеПараметрыРасчетаСИзмерителями.Измеритель
		|ИЗ
		|	ВсеПараметрыРасчетаСИзмерителями КАК ВсеПараметрыРасчетаСИзмерителями";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстКлючиНормативаПоРазрезам()
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель КАК Измеритель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючНорматива,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.СоциальныйНорматив
	|				ТОГДА энргКлючиНормативов.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяССылка)
	|		КОНЕЦ) КАК КлючСоцНорматива,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|ПОМЕСТИТЬ КлючиНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначенияРазрезов.Строение КАК Строение,
	|		ЗначенияРазрезов.Помещение КАК Помещение,
	|		ДействующуюРазрезыНорматива.Услуга КАК Услуга,
	|		ДействующуюРазрезыНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ДействующуюРазрезыНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|		ДействующуюРазрезыНорматива.РазрезВидБлагоустройства КАК РазрезВидБлагоустройства,
	|		ДействующуюРазрезыНорматива.РазрезВидСобственности КАК РазрезВидСобственности,
	|		ДействующуюРазрезыНорматива.РазрезГодПостройки КАК РазрезГодПостройки,
	|		ДействующуюРазрезыНорматива.РазрезКоличествоКомнат КАК РазрезКоличествоКомнат,
	|		ДействующуюРазрезыНорматива.РазрезКоличествоЧеловек КАК РазрезКоличествоЧеловек,
	|		ДействующуюРазрезыНорматива.РазрезКоличествоПрописанных КАК РазрезКоличествоПрописанных,
	|		ДействующуюРазрезыНорматива.РазрезКоличествоПроживающих КАК РазрезКоличествоПроживающих,
	|		ДействующуюРазрезыНорматива.РазрезКоличествоЭтажей КАК РазрезКоличествоЭтажей,
	|		ДействующуюРазрезыНорматива.РазрезИзмерительНаправленияИспользования КАК РазрезИзмерительНаправленияИспользования,
	|		ЗначенияРазрезов.ВидБлагоустройства КАК ВидБлагоустройства,
	|		ЗначенияРазрезов.ВидСобственности КАК ВидСобственности,
	|		ЗначенияРазрезов.ГодПостройки КАК ГодПостройки,
	|		ЗначенияРазрезов.КоличествоКомнат КАК КоличествоКомнат,
	|		ЗначенияРазрезов.КоличествоЧеловек КАК КоличествоЧеловек,
	|		ЗначенияРазрезов.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ЗначенияРазрезов.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ЗначенияРазрезов.КоличествоЭтажей КАК КоличествоЭтажей,
	|		ЗначенияРазрезов.Измеритель КАК Измеритель,
	|		ДействующуюРазрезыНорматива.ТипНачисления КАК ТипНачисления
	|	ИЗ
	|		ДействующуюРазрезыНорматива КАК ДействующуюРазрезыНорматива
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияРазрезов КАК ЗначенияРазрезов
	|			ПО ДействующуюРазрезыНорматива.Услуга = ЗначенияРазрезов.Услуга
	|				И ДействующуюРазрезыНорматива.НаправлениеИспользованияТУ = ЗначенияРазрезов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
	|		ПО (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидБлагоустройства
	|					ТОГДА ВложенныйЗапрос.ВидБлагоустройства = энргКлючиНормативов.ВидБлагоустройства
	|				ИНАЧЕ энргКлючиНормативов.ВидБлагоустройства = ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезВидСобственности
	|					ТОГДА ВложенныйЗапрос.ВидСобственности = энргКлючиНормативов.ВидСобственности
	|				ИНАЧЕ энргКлючиНормативов.ВидСобственности = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезИзмерительНаправленияИспользования
	|					ТОГДА ВложенныйЗапрос.Измеритель = энргКлючиНормативов.ИзмерительНаправленияИспользования
	|				ИНАЧЕ энргКлючиНормативов.ИзмерительНаправленияИспользования = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка)
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезГодПостройки
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.ГодПостройкиДо = 0
	|								ТОГДА ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|										И энргКлючиНормативов.ГодПостройкиОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.ГодПостройки >= энргКлючиНормативов.ГодПостройкиОт
	|									И ВложенныйЗапрос.ГодПостройки < энргКлючиНормативов.ГодПостройкиДо
	|									И энргКлючиНормативов.ГодПостройкиОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.ГодПостройкиОт = 0
	|						И энргКлючиНормативов.ГодПостройкиДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоКомнат
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоКомнатДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|										И энргКлючиНормативов.КоличествоКомнатОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоКомнат >= энргКлючиНормативов.КоличествоКомнатОт
	|									И ВложенныйЗапрос.КоличествоКомнат < энргКлючиНормативов.КоличествоКомнатДо
	|									И энргКлючиНормативов.КоличествоКомнатОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоКомнатОт = 0
	|						И энргКлючиНормативов.КоличествоКомнатДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЧеловек
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЧеловекДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоЧеловек >= энргКлючиНормативов.КоличествоЧеловекОт
	|										И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоЧеловек >= энргКлючиНормативов.КоличествоЧеловекОт
	|									И ВложенныйЗапрос.КоличествоЧеловек < энргКлючиНормативов.КоличествоЧеловекДо
	|									И энргКлючиНормативов.КоличествоЧеловекОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЧеловекОт = 0
	|						И энргКлючиНормативов.КоличествоЧеловекДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПрописанных
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|										И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПрописанных >= энргКлючиНормативов.КоличествоПрописанныхОт
	|									И ВложенныйЗапрос.КоличествоПрописанных < энргКлючиНормативов.КоличествоПрописанныхДо
	|									И энргКлючиНормативов.КоличествоПрописанныхОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПрописанныхОт = 0
	|						И энргКлючиНормативов.КоличествоПрописанныхДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоПроживающих
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоПроживающихДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|										И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоПроживающих >= энргКлючиНормативов.КоличествоПроживающихОт
	|									И ВложенныйЗапрос.КоличествоПроживающих < энргКлючиНормативов.КоличествоПроживающихДо
	|									И энргКлючиНормативов.КоличествоПроживающихОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоПроживающихОт = 0
	|						И энргКлючиНормативов.КоличествоПроживающихДо = 0
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.РазрезКоличествоЭтажей
	|					ТОГДА ВЫБОР
	|							КОГДА энргКлючиНормативов.КоличествоЭтажейДо = 0
	|								ТОГДА ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|										И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|							ИНАЧЕ ВложенныйЗапрос.КоличествоЭтажей >= энргКлючиНормативов.КоличествоЭтажейОт
	|									И ВложенныйЗапрос.КоличествоЭтажей < энргКлючиНормативов.КоличествоЭтажейДо
	|									И энргКлючиНормативов.КоличествоЭтажейОт > 0
	|						КОНЕЦ
	|				ИНАЧЕ энргКлючиНормативов.КоличествоЭтажейОт = 0
	|						И энргКлючиНормативов.КоличествоЭтажейДо = 0
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Измеритель,
	|	ВложенныйЗапрос.ВидБлагоустройства,
	|	ВложенныйЗапрос.ТипНачисления";
	
	Возврат Текст;
	
КонецФункции

Функция СоздатьЭлементПоПараметрам(ОписаниеЭлемента, КонтрольнаяСумма)
	 ЭлементОбъект 			= СоздатьЭлемент();	 
	 ЗаполнитьЗначенияСвойств(ЭлементОбъект, ОписаниеЭлемента);
	 ЭлементОбъект.ХэшСумма = КонтрольнаяСумма;
	 ЭлементОбъект.Записать();
	 Возврат ЭлементОбъект.Ссылка;
КонецФункции

#КонецОбласти

#КонецЕсли