#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Набор 						= РегистрыСведений.энргУникальныеКлючиНормативов.СоздатьНаборЗаписей();
	Набор.Отбор.ХэшСумма.Установить(ХэшСумма);
	Набор.Прочитать();
	ДобавитьСтроку 				= Истина;	
	Если Набор.Количество() > 0 и Не ПометкаУдаления Тогда
		Если НЕ Набор[0].КлючНорматива = Ссылка Тогда
			ВызватьИсключение "Обнаружен не уникальный ключ норматива, обратитесь к администратору системы";			
		Иначе
			ДобавитьСтроку 		= Ложь;
		КонецЕсли;		
	ИначеЕсли Набор.Количество() > 0 Тогда
		Набор.Очистить();
		Набор.Записать();
		ДобавитьСтроку 			= Ложь;		
	КонецЕсли; 
	
	Если ДобавитьСтроку Тогда	
		Строка		  			= Набор.Добавить();
		Строка.ХэшСумма 		= ХэшСумма;
		Строка.КлючНорматива 	= Ссылка;
		Набор.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли