#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает в дополнительных свойствах массив помещений и заполняет его.
//
Процедура МассивПомещений() Экспорт
	
	КлючиПомещений		= ТочкиУчета.ВыгрузитьКолонку("КлючПомещения");
	КлючиПомещений.Добавить(КлючПомещения);
	
	Запрос				= Новый Запрос;
	Запрос.УстановитьПараметр("КлючиПомещений",		КлючиПомещений);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.Текст		=
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	&ПериодРегистрации КАК ПериодРегистрации 
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.КлючПомещения В (&КлючиПомещений)";
	
	ДополнительныеСвойства.Вставить("МассивПомещений", Запрос.Выполнить());
		
КонецПроцедуры

// Получает пустой массив плательщиков.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	ДополнительныеСвойства.Вставить("ГруппаАбонентов", Истина);
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если не ЗначениеЗаполнено(Услуга) тогда 
		Отказ							= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга не выбрана");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 							= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 					= "На дату фактического события";
	иначе
		Момент 							= МоментВремени();
		СтрокаОтказа 					= "На дату операции";
	КонецЕсли;
	
	ЛСОТкрыт 							= энргПроверкаДанныхАбонентаСервер.СостояниеЛС(Момент,Абонент,Район,Организация);
	
	Если не ЛСОТкрыт тогда
		Отказ							= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " лицевой счет закрыт");
	КонецЕсли;
			
	Если Отказ тогда
		Возврат;
	КонецЕсли; 
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки 						= ДанныеШапки();
			
	энргРаботаСТочкамиУчетаСервер.УстановитьФормулуРасчетаТУ(ДанныеШапки, Движения);
 
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= ПолучитьТекстЗапросаФормулыРасчетаТочекУчета();
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", ДанныеШапки.Дата);
	Запрос.УстановитьПараметр("ПериодНачисления", ДанныеШапки.ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодРегистрации", ДанныеШапки.ПериодРегистрации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса,	Движения.энргФормулыРасчетаТочекУчета);
	
	Для Каждого СтрокаФормулы из ТочкиУчета Цикл 
		Если СтрокаФормулы.Коэффициент > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коэффициент больше 1");
			Отказ						= Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ТочкаУчета",				РассчитываемаяТочкаУчета);	
	ДанныеШапки.Вставить("ПрименятьФормулуВсегда",	ПрименятьВсегда);	
	Возврат ДанныеШапки;	
КонецФункции

Функция ПолучитьТекстЗапросаФормулыРасчетаТочекУчета()
	Текст = "ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	энргУстановитьФормулуРасчетаТочекУчета.Организация КАК Организация,
	        |	энргУстановитьФормулуРасчетаТочекУчета.Район КАК Район,
	        |	энргУстановитьФормулуРасчетаТочекУчета.КлючПомещения КАК КлючПомещения,
	        |	энргУстановитьФормулуРасчетаТочекУчета.РассчитываемаяТочкаУчета КАК РассчитываемаяТочкаУчета,
	        |	энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета.ТочкаУчета КАК ТочкаИсточник,
	        |	энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета.КлючПомещения КАК КлючПомещенияИсточник,
	        |	энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета.Коэффициент КАК Коэффициент,
	        |	энргУстановитьФормулуРасчетаТочекУчета.Дата КАК ПериодРегистрации,
	        |	энргУстановитьФормулуРасчетаТочекУчета.ПериодНачисления КАК ПериодНачисления
	        |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	        |ИЗ
	        |	Документ.энргУстановитьФормулуРасчетаТочекУчета КАК энргУстановитьФормулуРасчетаТочекУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргУстановитьФормулуРасчетаТочекУчета.ТочкиУчета КАК энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета
	        |		ПО (энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета.Ссылка = энргУстановитьФормулуРасчетаТочекУчета.Ссылка)
	        |			И (энргУстановитьФормулуРасчетаТочекУчетаТочкиУчета.Ссылка = &Ссылка)
	        |ГДЕ
	        |	энргУстановитьФормулуРасчетаТочекУчета.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.Организация КАК Организация,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.Район КАК Район,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка КАК РассчитываемаяТочка,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник КАК ТочкаИсточник,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.КлючПомещенияИсточник КАК КлючПомещенияИсточник,
	        |	энргФормулыРасчетаТочекУчетаСрезПоследних.Коэффициент КАК Коэффициент
	        |ПОМЕСТИТЬ ВТ_СтарыеФормулы
	        |ИЗ
	        |	РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(
	        |			&Дата,
	        |			(Организация, Район, КлючПомещения, РассчитываемаяТочка) В
	        |				(ВЫБРАТЬ
	        |					вт.Организация,
	        |					вт.Район,
	        |					вт.КлючПомещения,
	        |					вт.РассчитываемаяТочкаУчета
	        |				ИЗ
	        |					ВТ_ДанныеДокумента КАК вт)) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДанныеДокумента.Период КАК Период,
	        |	ВТ_ДанныеДокумента.Организация КАК Организация,
	        |	ВТ_ДанныеДокумента.Район КАК Район,
	        |	ВТ_ДанныеДокумента.КлючПомещения КАК КлючПомещения,
	        |	ВТ_ДанныеДокумента.РассчитываемаяТочкаУчета КАК РассчитываемаяТочка,
	        |	ВТ_ДанныеДокумента.ТочкаИсточник КАК ТочкаИсточник,
	        |	ВТ_ДанныеДокумента.КлючПомещенияИсточник КАК КлючПомещенияИсточник,
	        |	ИСТИНА КАК Актуальность,
	        |	ВТ_ДанныеДокумента.Коэффициент КАК Коэффициент,
	        |	ВТ_ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ДанныеДокумента.ПериодНачисления КАК ПериодНачисления
	        |ИЗ
	        |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ВТ_СтарыеФормулы.Организация,
	        |	ВТ_СтарыеФормулы.Район,
	        |	ВТ_СтарыеФормулы.КлючПомещения,
	        |	ВТ_СтарыеФормулы.РассчитываемаяТочка,
	        |	ВТ_СтарыеФормулы.ТочкаИсточник,
	        |	ВТ_СтарыеФормулы.КлючПомещенияИсточник,
	        |	ЛОЖЬ,
	        |	ВТ_СтарыеФормулы.Коэффициент,
	        |	&ПериодРегистрации,
	        |	&ПериодНачисления
	        |ИЗ
	        |	ВТ_СтарыеФормулы КАК ВТ_СтарыеФормулы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	        |		ПО (ВТ_ДанныеДокумента.Организация = ВТ_СтарыеФормулы.Организация)
	        |			И (ВТ_ДанныеДокумента.Район = ВТ_СтарыеФормулы.Район)
	        |			И (ВТ_ДанныеДокумента.КлючПомещения = ВТ_СтарыеФормулы.КлючПомещения)
	        |			И (ВТ_ДанныеДокумента.РассчитываемаяТочкаУчета = ВТ_СтарыеФормулы.РассчитываемаяТочка)
	        |			И (ВТ_ДанныеДокумента.ТочкаИсточник = ВТ_СтарыеФормулы.ТочкаИсточник)
	        |			И (ВТ_ДанныеДокумента.КлючПомещенияИсточник = ВТ_СтарыеФормулы.КлючПомещенияИсточник)
	        |ГДЕ
	        |	ВТ_ДанныеДокумента.ТочкаИсточник ЕСТЬ NULL";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли