#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Обновить" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ФормаНастройкаЭтаповОрганизации"), Метаданные.РегистрыСведений.энргСрокиЭтаповПИД);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаЭтаповОрганизации(Команда)
	ПарамФормы = Новый Структура("Организация, Схема, Район, Юридическая");
 	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПарамФормы, ТекСтрока); 
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.энргСрокиЭтаповПИД.Форма.НастройкаЭтаповОрганизации", ПарамФормы, ЭтаФорма);
	Модифицированность = Ложь;
КонецПроцедуры

#КонецОбласти
