
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("Организация",  		Параметры.Организация);
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("Район", 			 	Параметры.Район);
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета",		Параметры.ОбъектРасчета);
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("ТочкаУчета",		 	Параметры.ТочкаУчета);
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("ПриборУчета",		 	Параметры.ПриборУчета);
	ИсторияОбъемов.Параметры.УстановитьЗначениеПараметра("Услуга",				Параметры.Услуга);
КонецПроцедуры
