#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризированнаяЗадолженность,"Район", Параметры.Район);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризированнаяЗадолженность,"Организация", Параметры.Организация);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризированнаяЗадолженность,"Договор", Параметры.Договор);
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризированнаяЗадолженность,"КонецПериода", Параметры.КонецПериода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеструктуризированнаяЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаОбъекта", Новый Структура("Ключ", Элементы.РеструктуризированнаяЗадолженность.ТекущиеДанные.ПлатежныйДокумент));
КонецПроцедуры

#КонецОбласти
