#Область ПрограммныйИнтерфейс

// Функция - Получает данные договора для рабочего места оператора
//
// Параметры:
//  Договор - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//  Массив - массив пакетов запроса, содержащих данные договора
//
Функция ДанныеДоговораДляРабочегоМестаОператора(Договор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДоговора();
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Возврат Запрос.ВыполнитьПакет();

КонецФункции

// Функция - Заполняет данные объектов расчета
//
// Параметры:
//  ПоляДоговора							 - Структура 
//  ДеревоДанныеПоТУ						 - ДеревоЗначений 
//  ДеревоДанныеПоПУ						 - ДеревоЗначений
//  ДеревоДанныеПоИзмерительномуКомплексу	 - ДеревоЗначений 
//  ОбъектыРасчета							 - ТаблицаЗначений 
//  ТочкиПоставки							 - ТаблицаЗначений 
// 
// Возвращаемое значение:
//   - Структура
//
Функция ЗаполнитьДанныеОбъектовРасчета(ПоляДоговора, Знач ДеревоДанныеПоТУ, Знач ДеревоДанныеПоПУ, Знач ДеревоДанныеПоИзмерительномуКомплексу, Знач ОбъектыРасчета, Знач ТочкиПоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеОбъектовРасчета();
	Запрос.УстановитьПараметр("Организация", ПоляДоговора.Организация);
	Запрос.УстановитьПараметр("Район", ПоляДоговора.Район);
	Запрос.УстановитьПараметр("Договор", ПоляДоговора.Договор);
	Запрос.УстановитьПараметр("Контрагент", ПоляДоговора.Контрагент);
	Пакет = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = Пакет.ВГраница();
	
	ВыборкаТочкиПоставки = Пакет.Получить(6).Выбрать();
	ВыборкаОбъектыРасчета = Пакет.Получить(ИндексПоследнегоЗапроса - 2).Выбрать();
	ВыборкаТУ = Пакет.Получить(ИндексПоследнегоЗапроса - 1).Выбрать();
	ВыборкаПотери = Пакет.Получить(ИндексПоследнегоЗапроса - 5).Выбрать();
	ВыборкаВидыЭнергии = Пакет.Получить(ИндексПоследнегоЗапроса - 4).Выбрать();
	ВыборкаПломбы = Пакет.Получить(ИндексПоследнегоЗапроса - 3).Выбрать();
	ВыборкаИзмерительныйКомплекс = Пакет.Получить(ИндексПоследнегоЗапроса).Выбрать();
	
	ТЗСтруктураСети = Справочники.бестСтруктураСети.АктуальныеДанныеСтруктурыСети().Выгрузить();
	
	СоответствиеПотери = ЗаполнитьСоответствиеПотерь(ВыборкаПотери, ПоляДоговора.ИспользоватьТарифныеЗоны);
	СоответствиеВидыЭнергии = ЗаполнитьСоответствиеВидовЭнергии(ВыборкаВидыЭнергии);
	СоответствиеПломбы = ЗаполнитьСоответствиеПломб(ВыборкаПломбы);
	
	ЗаполнитьТЗОбъектыРасчета(ПоляДоговора, ВыборкаОбъектыРасчета, ОбъектыРасчета);
	
	ЗаполнитьТЗТочкиПоставки(ВыборкаТочкиПоставки, ТочкиПоставки, ТЗСтруктураСети);
	
	ДанныеПоУмолчанию = Новый Структура("Заполнено, ОбъектРасчета, ТочкаУчета, ПриборУчета", Ложь);
	
	ТекущиеДанные = Новый Структура("ТУ, Услуга, Шкала, ТарифнаяЗона");
	
	Пока ВыборкаТУ.Следующий() Цикл
		
		Если Не ДанныеПоУмолчанию.Заполнено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоУмолчанию, ВыборкаТУ);
			ДанныеПоУмолчанию.Заполнено = Истина;
		КонецЕсли;
		
		Если Не ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета Тогда
			СтрокиДерева = Новый Структура("СтрокаТУ, СтрокаУслуга, СтрокаШкала, СтрокаПоказания, СтрокаТипИзмерителя");
		
			ЗаполнитьОбщиеДанныеДереваТУ(ВыборкаТУ, ДеревоДанныеПоТУ, ПоляДоговора, СтрокиДерева);
			ЗаполнитьДеревоПоСоответствию(ВыборкаТУ, "ТочкаУчета", СоответствиеПотери, СтрокиДерева.СтрокаТУ, НСтр("ru = 'Потери'"));
			
			ЗаполнитьОбщиеДанныеДереваПУ(ВыборкаТУ, ДеревоДанныеПоПУ, ПоляДоговора, СоответствиеВидыЭнергии, СоответствиеПломбы);
			ЗаполнитьДеревоПоСоответствию(ВыборкаТУ, "ПриборУчета", СоответствиеПломбы, ДеревоДанныеПоПУ, НСтр("ru = 'Данные пломб'"));
		КонецЕсли;
		
		ЗаполнитьДанныеОбУслугеДереваТУ(ВыборкаТУ, СтрокиДерева.СтрокаТУ, СтрокиДерева.СтрокаУслуга, ПоляДоговора, ТекущиеДанные, СтрокиДерева);
		
		ЗаполнитьДанныеПоказанийПУ(ВыборкаТУ, ДеревоДанныеПоПУ, ПоляДоговора, ТекущиеДанные, СтрокиДерева);
		
		ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета;
		ТекущиеДанные.Услуга = ВыборкаТУ.Услуга;
		ТекущиеДанные.Шкала = ВыборкаТУ.Шкала;
		ТекущиеДанные.ТарифнаяЗона = ВыборкаТУ.ТарифнаяЗона;
			
	КонецЦикла;
	
	Пока ВыборкаИзмерительныйКомплекс.Следующий() Цикл
		ЗаполнитьОбщиеДанныеДереваИзмерительногоКомплекса(ВыборкаИзмерительныйКомплекс, ДеревоДанныеПоИзмерительномуКомплексу, СтрокиДерева);
		ЗаполнитьДеревоПоСоответствию(ВыборкаИзмерительныйКомплекс, "ПриборУчета", СоответствиеПломбы, ДеревоДанныеПоИзмерительномуКомплексу, НСтр("ru = 'Данные пломб'"));
	КонецЦикла;
	
	Возврат Новый Структура("ДанныеПоУмолчанию, ОбъектыРасчета, ТочкиПоставки, ДеревоДанныеПоТУ, ДеревоДанныеПоПУ, ДеревоДанныеПоИзмерительномуКомплексу", 
								ДанныеПоУмолчанию, ОбъектыРасчета, ТочкиПоставки, ДеревоДанныеПоТУ, ДеревоДанныеПоПУ, ДеревоДанныеПоИзмерительномуКомплексу);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

	Функция ДанныеОСуммахНачислений(Организация, Район, Договор) Экспорт

	СтруктураСумм = Новый Структура("СуммаБезНДС, СуммаНДС", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестОбъемНачисленийНП.Организация КАК Организация,
	               |	бестОбъемНачисленийНП.Район КАК Район,
	               |	бестОбъемНачисленийНП.Договор КАК Договор,
	               |	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления
	               |ПОМЕСТИТЬ ВТ_ПериодыНачислений
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	               |ГДЕ
	               |	НЕ бестОбъемНачисленийНП.Распределение
	               |	И бестОбъемНачисленийНП.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	               |	И бестОбъемНачисленийНП.Организация = &Организация
	               |	И бестОбъемНачисленийНП.Район = &Район
	               |	И бестОбъемНачисленийНП.Договор = &Договор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бестОбъемНачисленийЭлектроэнергии.Организация,
	               |	бестОбъемНачисленийЭлектроэнергии.Район,
	               |	бестОбъемНачисленийЭлектроэнергии.Договор,
	               |	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	               |ГДЕ
	               |	НЕ бестОбъемНачисленийЭлектроэнергии.Распределение
	               |	И бестОбъемНачисленийЭлектроэнергии.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	               |	И бестОбъемНачисленийЭлектроэнергии.Организация = &Организация
	               |	И бестОбъемНачисленийЭлектроэнергии.Район = &Район
	               |	И бестОбъемНачисленийЭлектроэнергии.Договор = &Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПериодыНачислений.Организация КАК Организация,
	               |	ВТ_ПериодыНачислений.Район КАК Район,
	               |	ВТ_ПериодыНачислений.Договор КАК Договор,
	               |	МАКСИМУМ(ВТ_ПериодыНачислений.ПериодНачисления) КАК ПериодНачисления
	               |ПОМЕСТИТЬ ВТ_ПоследнийПериод
	               |ИЗ
	               |	ВТ_ПериодыНачислений КАК ВТ_ПериодыНачислений
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПериодыНачислений.Район,
	               |	ВТ_ПериодыНачислений.Договор,
	               |	ВТ_ПериодыНачислений.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА бестОбъемНачисленийНП.НДСВнутри
	               |			ТОГДА бестОбъемНачисленийНП.Сумма - бестОбъемНачисленийНП.СуммаНДС
	               |		ИНАЧЕ бестОбъемНачисленийНП.Сумма
	               |	КОНЕЦ КАК СуммаБезНДС,
	               |	бестОбъемНачисленийНП.СуммаНДС КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_Суммы
	               |ИЗ
	               |	ВТ_ПоследнийПериод КАК ВТ_ПоследнийПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	               |		ПО ВТ_ПоследнийПериод.Организация = бестОбъемНачисленийНП.Организация
	               |			И ВТ_ПоследнийПериод.Район = бестОбъемНачисленийНП.Район
	               |			И ВТ_ПоследнийПериод.Договор = бестОбъемНачисленийНП.Договор
	               |			И ВТ_ПоследнийПериод.ПериодНачисления = бестОбъемНачисленийНП.ПериодНачисления
	               |			И (НЕ бестОбъемНачисленийНП.Распределение)
	               |			И (бестОбъемНачисленийНП.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА бестОбъемНачисленийЭлектроэнергии.НДСВнутри
	               |			ТОГДА бестОбъемНачисленийЭлектроэнергии.Сумма - бестОбъемНачисленийЭлектроэнергии.СуммаНДС
	               |		ИНАЧЕ бестОбъемНачисленийЭлектроэнергии.Сумма
	               |	КОНЕЦ,
	               |	бестОбъемНачисленийЭлектроэнергии.СуммаНДС
	               |ИЗ
	               |	ВТ_ПоследнийПериод КАК ВТ_ПоследнийПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	               |		ПО ВТ_ПоследнийПериод.Организация = бестОбъемНачисленийЭлектроэнергии.Организация
	               |			И ВТ_ПоследнийПериод.Район = бестОбъемНачисленийЭлектроэнергии.Район
	               |			И ВТ_ПоследнийПериод.Договор = бестОбъемНачисленийЭлектроэнергии.Договор
	               |			И ВТ_ПоследнийПериод.ПериодНачисления = бестОбъемНачисленийЭлектроэнергии.ПериодНачисления
	               |			И (НЕ бестОбъемНачисленийЭлектроэнергии.Распределение)
	               |			И (бестОбъемНачисленийЭлектроэнергии.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Суммы.СуммаБезНДС) КАК СуммаБезНДС,
	               |	СУММА(ВТ_Суммы.СуммаНДС) КАК СуммаНДС
	               |ИЗ
	               |	ВТ_Суммы КАК ВТ_Суммы";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСумм, Выборка);
	КонецЕсли;
	Возврат СтруктураСумм;

КонецФункции

#КонецОбласти

 		#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеДоговора()

	Возврат "ВЫБРАТЬ
	        |	бестСвязьДоговоров.СвязанныйДоговор КАК Договор
	        |ИЗ
	        |	РегистрСведений.бестСвязьДоговоров КАК бестСвязьДоговоров
	        |ГДЕ
	        |	бестСвязьДоговоров.ОснованиеДляДоговора = &Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргДоговорыКонтрагентов.Ссылка КАК Договор,
	        |	энргДоговорыКонтрагентов.Организация КАК Организация,
	        |	энргДоговорыКонтрагентов.Район КАК Район,
	        |	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	        |	энргДоговорыКонтрагентов.ВзаимодействиеСЭДО КАК ВзаимодействиеСЭДО,
	        |	энргКонтрагенты.ИНН КАК ИНН,
	        |	энргКонтрагенты.КПП КАК КПП,
	        |	энргКонтрагенты.ОГРН КАК ОГРН,
	        |	энргКонтрагенты.КодПоОКПО КАК ОКПО,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	        |				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
	        |		КОНЕЦ) КАК ЮридическийАдресКонтрагента,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
	        |				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
	        |		КОНЕЦ) КАК ЭлектронныйАдресКонтрагента,
	        |	ВЫБОР
	        |		КОГДА НЕ энргДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	        |				И энргДоговорыКонтрагентов.ДатаОкончанияДействия <= &ТекДата
	        |			ТОГДА энргДоговорыКонтрагентов.ДатаОкончанияДействия
	        |		ИНАЧЕ энргДоговорыКонтрагентов.ДатаНачалаДействия
	        |	КОНЕЦ КАК ДатаСостоянияДоговора,
	        |	энргДоговорыКонтрагентов.ТипТарифа = ЗНАЧЕНИЕ(Перечисление.бестТипыТарифаНезависимыйСбыт.ФиксированныйТариф) КАК ФиксированныйТариф,
	        |	энргДоговорыКонтрагентов.Представление КАК ПредставлениеДоговора,
	        |	ПРЕДСТАВЛЕНИЕ(энргДоговорыКонтрагентов.Статус) КАК СтатусДоговора
	        |ИЗ
	        |	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	        |			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация.Ссылка
	        |				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	        |					ИЛИ энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
	        |		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Ссылка = &Договор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	энргКонтрагенты.ИНН,
	        |	энргКонтрагенты.КодПоОКПО,
	        |	энргКонтрагенты.КПП,
	        |	энргДоговорыКонтрагентов.Ссылка,
	        |	энргКонтрагенты.ОГРН,
	        |	энргДоговорыКонтрагентов.Организация,
	        |	энргДоговорыКонтрагентов.Район,
	        |	энргДоговорыКонтрагентов.Контрагент,
	        |	энргДоговорыКонтрагентов.ВзаимодействиеСЭДО,
	        |	ВЫБОР
	        |		КОГДА НЕ энргДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	        |				И энргДоговорыКонтрагентов.ДатаОкончанияДействия <= &ТекДата
	        |			ТОГДА энргДоговорыКонтрагентов.ДатаОкончанияДействия
	        |		ИНАЧЕ энргДоговорыКонтрагентов.ДатаНачалаДействия
	        |	КОНЕЦ,
	        |	энргДоговорыКонтрагентов.ТипТарифа = ЗНАЧЕНИЕ(Перечисление.бестТипыТарифаНезависимыйСбыт.ФиксированныйТариф),
	        |	энргДоговорыКонтрагентов.Представление,
	        |	ПРЕДСТАВЛЕНИЕ(энргДоговорыКонтрагентов.Статус)";

КонецФункции

Функция ТекстЗапросаДанныеОбъектовРасчета()

	Возврат "ВЫБРАТЬ
	        |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ВТ_ОбъектыИТочкиДоговора
	        |ИЗ
	        |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	        |ГДЕ
	        |	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета.МКД КАК МКД,
	        |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ВТ_АктивныеТУ
	        |ИЗ
	        |	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ОбъектыИТочкиДоговора.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ОбъектыИТочкиДоговора.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_ОбъектыИТочкиДоговора КАК ВТ_ОбъектыИТочкиДоговора)) КАК бестАктивностьТочекУчетаНПСрезПоследних
	        |ГДЕ
	        |	(бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	        |			ИЛИ бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестЗначенияПлощадейНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестЗначенияПлощадейНПСрезПоследних.Площадь КАК Площадь
	        |ПОМЕСТИТЬ ВТ_ЗначенияПлощадейОбъектов
	        |ИЗ
	        |	РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И ОбъектРасчета В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)
	        |				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)) КАК бестЗначенияПлощадейНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
	        |ПОМЕСТИТЬ ВТ_ТочкиПоставкиОбъекта
	        |ИЗ
	        |	РегистрСведений.бестТочкиПоставкиОбъектовРасчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестТочкиПоставкиОбъектовРасчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргАктивностьТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	        |	энргАктивностьТочекПоставкиСрезПоследних.Состояние КАК Состояние
	        |ПОМЕСТИТЬ ВТ_СостояниеТП
	        |ИЗ
	        |	РегистрСведений.энргАктивностьТочекПоставки.СрезПоследних(
	        |			,
	        |			ТочкаПоставки В
	        |				(ВЫБРАТЬ
	        |					ВТ_ТочкиПоставкиОбъекта.ТочкаПоставки КАК ТочкаПоставки
	        |				ИЗ
	        |					ВТ_ТочкиПоставкиОбъекта КАК ВТ_ТочкиПоставкиОбъекта)) КАК энргАктивностьТочекПоставкиСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	        |	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	        |	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	        |	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети.Представление КАК СтруктураСетиПредставление
	        |ПОМЕСТИТЬ ВТ_ПараметрыТочекПоставки
	        |ИЗ
	        |	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(
	        |			,
	        |			ТочкаПоставки В
	        |				(ВЫБРАТЬ
	        |					ВТ_ТочкиПоставкиОбъекта.ТочкаПоставки КАК ТочкаПоставки
	        |				ИЗ
	        |					ВТ_ТочкиПоставкиОбъекта КАК ВТ_ТочкиПоставкиОбъекта)) КАК энргПараметрыТочекПоставкиСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТочкиПоставкиОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТочкиПоставкиОбъекта.ТочкаПоставки КАК ТочкаПоставки,
	        |	ВТ_СостояниеТП.Состояние КАК Статус,
	        |	ВТ_ПараметрыТочекПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность,
	        |	ВТ_ПараметрыТочекПоставки.СтруктураСети КАК СтруктураСети,
	        |	ВТ_ПараметрыТочекПоставки.СтруктураСетиПредставление КАК СтруктураСетиПредставление
	        |ИЗ
	        |	ВТ_ТочкиПоставкиОбъекта КАК ВТ_ТочкиПоставкиОбъекта
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостояниеТП КАК ВТ_СостояниеТП
	        |		ПО ВТ_ТочкиПоставкиОбъекта.ТочкаПоставки = ВТ_СостояниеТП.ТочкаПоставки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТочекПоставки КАК ВТ_ПараметрыТочекПоставки
	        |		ПО ВТ_ТочкиПоставкиОбъекта.ТочкаПоставки = ВТ_ПараметрыТочекПоставки.ТочкаПоставки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
	        |ПОМЕСТИТЬ ВТ_ТочкиПоставкиТУ
	        |ИЗ
	        |	РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория
	        |ПОМЕСТИТЬ ВТ_ЦК
	        |ИЗ
	        |	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	        |ПОМЕСТИТЬ ВТ_УслугиТУ
	        |ИЗ
	        |	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестУслугиТочекУчетаНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_АктивныеТУ.МКД КАК МКД,
	        |	ВТ_УслугиТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_УслугиТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВТ_УслугиТУ.Услуга) КАК Услуга
	        |ПОМЕСТИТЬ ВТ_ПростыеУслугиТУ
	        |ИЗ
	        |	ВТ_АктивныеТУ КАК ВТ_АктивныеТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УслугиТУ КАК ВТ_УслугиТУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	        |				ПО энргВидыУслуг.Ссылка = энргВидыУслугСоставляющиеУслуг.Ссылка
	        |			ПО ВТ_УслугиТУ.Услуга = энргВидыУслуг.Ссылка
	        |				И (энргВидыУслуг.СоставнаяУслуга)
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_УслугиТУ.ОбъектРасчета
	        |			И ВТ_АктивныеТУ.ТочкаУчета = ВТ_УслугиТУ.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга,
	        |	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория
	        |ПОМЕСТИТЬ ВТ_ТарифныеКатегорииУслуг
	        |ИЗ
	        |	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, Услуга) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ПростыеУслугиТУ.МКД КАК МКД,
	        |						ВТ_ПростыеУслугиТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ПростыеУслугиТУ.Услуга КАК Услуга
	        |					ИЗ
	        |						ВТ_ПростыеУслугиТУ КАК ВТ_ПростыеУслугиТУ)) КАК бестТарифныеКатегорииНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПоставщикиУслугНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПоставщикиУслугНПСрезПоследних.Услуга КАК Услуга,
	        |	бестПоставщикиУслугНПСрезПоследних.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_ПоставщикиУслуг
	        |ИЗ
	        |	РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ТочкаУчета, Услуга) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ПростыеУслугиТУ.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_ПростыеУслугиТУ.Услуга КАК Услуга
	        |					ИЗ
	        |						ВТ_ПростыеУслугиТУ КАК ВТ_ПростыеУслугиТУ)) КАК бестПоставщикиУслугНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ВТ_ПриборыТУ
	        |ИЗ
	        |	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестПриборыТочекУчетаНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ВТ_АктивныеПУ
	        |ИЗ
	        |	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ТочкаУчета, ПриборУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ПриборыТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ПриборыТУ.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_ПриборыТУ.ПриборУчета КАК ПриборУчета
	        |					ИЗ
	        |						ВТ_ПриборыТУ КАК ВТ_ПриборыТУ)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	        |ГДЕ
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент КАК КоэффициентПУ
	        |ПОМЕСТИТЬ ВТ_КоэффициентыПУ
	        |ИЗ
	        |	РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ТочкаУчета, ПриборУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеПУ.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_АктивныеПУ.ПриборУчета КАК ПриборУчета
	        |					ИЗ
	        |						ВТ_АктивныеПУ КАК ВТ_АктивныеПУ)) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_АктивныеТУ.МКД КАК МКД,
	        |	ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТочкиПоставкиТУ.ТочкаПоставки КАК ТочкаПоставки,
	        |	ЕСТЬNULL(ВТ_ЦК.ЦеноваяКатегория, ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПустаяСсылка)) КАК ЦеноваяКатегория,
	        |	ВТ_ПростыеУслугиТУ.Услуга КАК Услуга,
	        |	ВТ_ТарифныеКатегорииУслуг.ТарифнаяКатегория КАК ТарифнаяКатегория,
	        |	ВТ_АктивныеПУ.ПриборУчета КАК ПриборУчета,
	        |	энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	        |	энргТипыПриборовУчета.МаркаПУ КАК ТипСИ,
	        |	энргПриборыУчетаАбонента.ДатаУстановки КАК ДатаУстановки,
	        |	энргПриборыУчетаАбонента.БалансоваяПринадлежность КАК БалансоваяПринадлежность,
	        |	энргПриборыУчетаАбонента.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
	        |	энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ПростыеУслугиТУ.Услуга.бестИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ПростыеУслугиТУ.Услуга.бестИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	        |	ВТ_ПростыеУслугиТУ.Услуга.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_КоэффициентыПУ.КоэффициентПУ КАК КоэффициентПУ,
	        |	ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал, 0) КАК МежповерочныйИнтервал,
	        |	ВТ_ПоставщикиУслуг.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_ДанныеТУ
	        |ИЗ
	        |	ВТ_АктивныеТУ КАК ВТ_АктивныеТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТочкиПоставкиТУ КАК ВТ_ТочкиПоставкиТУ
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_ТочкиПоставкиТУ.ОбъектРасчета
	        |			И ВТ_АктивныеТУ.ТочкаУчета = ВТ_ТочкиПоставкиТУ.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦК КАК ВТ_ЦК
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_ЦК.ОбъектРасчета
	        |			И ВТ_АктивныеТУ.ТочкаУчета = ВТ_ЦК.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПростыеУслугиТУ КАК ВТ_ПростыеУслугиТУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТарифныеКатегорииУслуг КАК ВТ_ТарифныеКатегорииУслуг
	        |			ПО ВТ_ПростыеУслугиТУ.ОбъектРасчета = ВТ_ТарифныеКатегорииУслуг.ОбъектРасчета
	        |				И ВТ_ПростыеУслугиТУ.Услуга = ВТ_ТарифныеКатегорииУслуг.Услуга
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоставщикиУслуг КАК ВТ_ПоставщикиУслуг
	        |			ПО ВТ_ПростыеУслугиТУ.ТочкаУчета = ВТ_ПоставщикиУслуг.ТочкаУчета
	        |				И ВТ_ПростыеУслугиТУ.Услуга = ВТ_ПоставщикиУслуг.Услуга
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_ПростыеУслугиТУ.ОбъектРасчета
	        |			И ВТ_АктивныеТУ.ТочкаУчета = ВТ_ПростыеУслугиТУ.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктивныеПУ КАК ВТ_АктивныеПУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	        |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	        |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
	        |					ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
	        |				ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	        |			ПО ВТ_АктивныеПУ.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоэффициентыПУ КАК ВТ_КоэффициентыПУ
	        |			ПО ВТ_АктивныеПУ.ТочкаУчета = ВТ_КоэффициентыПУ.ТочкаУчета
	        |				И ВТ_АктивныеПУ.ПриборУчета = ВТ_КоэффициентыПУ.ПриборУчета
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_АктивныеПУ.ОбъектРасчета
	        |			И ВТ_АктивныеТУ.ТочкаУчета = ВТ_АктивныеПУ.ТочкаУчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_АктивныеТУ.ТочкаУчета,
	        |	ВТ_ТочкиПоставкиТУ.ТочкаПоставки,
	        |	ВТ_АктивныеТУ.ОбъектРасчета,
	        |	ВТ_ПростыеУслугиТУ.Услуга,
	        |	ВТ_ТарифныеКатегорииУслуг.ТарифнаяКатегория,
	        |	ВТ_АктивныеПУ.ПриборУчета,
	        |	энргПриборыУчетаАбонента.ВидКанальности,
	        |	энргТипыПриборовУчета.МаркаПУ,
	        |	энргПриборыУчетаАбонента.ДатаУстановки,
	        |	энргПриборыУчетаАбонента.БалансоваяПринадлежность,
	        |	энргПриборыУчетаАбонента.СистемаУчетаЭлектроэнергии,
	        |	энргПриборыУчетаАбонента.ТипПрибораУчета,
	        |	ВТ_ПростыеУслугиТУ.Услуга.бестИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ПростыеУслугиТУ.Услуга.бестИспользоватьРасчетПоМощности,
	        |	ВТ_ПростыеУслугиТУ.Услуга.ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_АктивныеТУ.МКД,
	        |	ВТ_КоэффициентыПУ.КоэффициентПУ,
	        |	энргТипыПриборовУчета.бестМежповерочныйИнтервал,
	        |	ВТ_ПоставщикиУслуг.Поставщик,
	        |	ЕСТЬNULL(ВТ_ЦК.ЦеноваяКатегория, ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПустаяСсылка)),
	        |	ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал, 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ВТ_ПриборыУзловУчета
	        |ИЗ
	        |	РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета, УзелУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ДанныеТУ.МКД КАК МКД,
	        |						ВТ_ДанныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ДанныеТУ.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_ДанныеТУ.ПриборУчета КАК ПриборУчета
	        |					ИЗ
	        |						ВТ_ДанныеТУ КАК ВТ_ДанныеТУ)) КАК бестПриборыУзловУчетаНПСрезПоследних
	        |ГДЕ
	        |	бестПриборыУзловУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_АктивныеПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_АктивныеПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_АктивныеПУ.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ВТ_УзлыИПриборы
	        |ИЗ
	        |	ВТ_АктивныеПУ КАК ВТ_АктивныеПУ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ПриборыУзловУчета.ОбъектРасчета,
	        |	ВТ_ПриборыУзловУчета.ТочкаУчета,
	        |	ВТ_ПриборыУзловУчета.ПриборУчета
	        |ИЗ
	        |	ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ДатаПоверки КАК ДатаПоверки
	        |ПОМЕСТИТЬ ВТ_ДатыПоверкиПУ
	        |ИЗ
	        |	РегистрСведений.бестДатыПоверкиПрибораУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ТочкаУчета, ПриборУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_УзлыИПриборы.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_УзлыИПриборы.ПриборУчета КАК ПриборУчета
	        |					ИЗ
	        |						ВТ_УзлыИПриборы КАК ВТ_УзлыИПриборы)) КАК бестДатыПоверкиПрибораУчетаНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДанныеТУ.МКД КАК МКД,
	        |	ВТ_ДанныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ДанныеТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ДанныеТУ.ТочкаПоставки КАК ТочкаПоставки,
	        |	ВТ_ДанныеТУ.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	ВТ_ДанныеТУ.Услуга КАК Услуга,
	        |	ВТ_ДанныеТУ.ТарифнаяКатегория КАК ТарифнаяКатегория,
	        |	ВТ_ДанныеТУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ДанныеТУ.ВидКанальности КАК ВидКанальности,
	        |	ВТ_ДанныеТУ.ТипСИ КАК ТипСИ,
	        |	ВТ_ДанныеТУ.ДатаУстановки КАК ДатаУстановки,
	        |	ВТ_ДанныеТУ.БалансоваяПринадлежность КАК БалансоваяПринадлежность,
	        |	ВТ_ДатыПоверкиПУ.ДатаПоверки КАК ДатаПоверки,
	        |	ДОБАВИТЬКДАТЕ(ВТ_ДатыПоверкиПУ.ДатаПоверки, ГОД, ВТ_ДанныеТУ.МежповерочныйИнтервал) КАК ДатаСледующейПоверки,
	        |	ВТ_ДанныеТУ.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
	        |	ВТ_ДанныеТУ.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	энргВидыКанальностиШкалыПоУслугам.Шкала КАК Шкала,
	        |	ВТ_ДанныеТУ.ИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ДанныеТУ.ИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	        |	ВТ_ДанныеТУ.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_ДанныеТУ.КоэффициентПУ КАК КоэффициентПУ,
	        |	ВТ_ДанныеТУ.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_ШкалыПУ
	        |ИЗ
	        |	ВТ_ДанныеТУ КАК ВТ_ДанныеТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.ШкалыПоУслугам КАК энргВидыКанальностиШкалыПоУслугам
	        |		ПО ВТ_ДанныеТУ.ВидКанальности = энргВидыКанальностиШкалыПоУслугам.Ссылка
	        |			И ВТ_ДанныеТУ.Услуга = энргВидыКанальностиШкалыПоУслугам.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПоверкиПУ КАК ВТ_ДатыПоверкиПУ
	        |		ПО ВТ_ДанныеТУ.ТочкаУчета = ВТ_ДатыПоверкиПУ.ТочкаУчета
	        |			И ВТ_ДанныеТУ.ПриборУчета = ВТ_ДатыПоверкиПУ.ПриборУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	        |	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	        |ПОМЕСТИТЬ ВТ_ВидыДифференцированностиПУ
	        |ИЗ
	        |	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ТочкаУчета, ПриборУчета, Шкала) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ШкалыПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ШкалыПУ.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_ШкалыПУ.ПриборУчета КАК ПриборУчета,
	        |						ВТ_ШкалыПУ.Шкала КАК Шкала
	        |					ИЗ
	        |						ВТ_ШкалыПУ КАК ВТ_ШкалыПУ)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ШкалыПУ.МКД КАК МКД,
	        |	ВТ_ШкалыПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ШкалыПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ШкалыПУ.ТочкаПоставки КАК ТочкаПоставки,
	        |	ВТ_ШкалыПУ.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	ВТ_ШкалыПУ.Услуга КАК Услуга,
	        |	ВТ_ШкалыПУ.ТарифнаяКатегория КАК ТарифнаяКатегория,
	        |	ВТ_ШкалыПУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ШкалыПУ.ВидКанальности КАК ВидКанальности,
	        |	ВТ_ШкалыПУ.ТипСИ КАК ТипСИ,
	        |	ВТ_ШкалыПУ.ДатаУстановки КАК ДатаУстановки,
	        |	ВТ_ШкалыПУ.БалансоваяПринадлежность КАК БалансоваяПринадлежность,
	        |	ВТ_ШкалыПУ.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ШкалыПУ.ДатаСледующейПоверки КАК ДатаСледующейПоверки,
	        |	ВТ_ШкалыПУ.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
	        |	ВТ_ШкалыПУ.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ШкалыПУ.Шкала КАК Шкала,
	        |	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ВТ_ШкалыПУ.ИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ШкалыПУ.ИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	        |	ВТ_ШкалыПУ.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_ШкалыПУ.КоэффициентПУ КАК КоэффициентПУ,
	        |	ВТ_ШкалыПУ.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_ТарифныеЗоны
	        |ИЗ
	        |	ВТ_ШкалыПУ КАК ВТ_ШкалыПУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыДифференцированностиПУ КАК ВТ_ВидыДифференцированностиПУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	        |			ПО ВТ_ВидыДифференцированностиПУ.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	        |		ПО ВТ_ШкалыПУ.ОбъектРасчета = ВТ_ВидыДифференцированностиПУ.ОбъектРасчета
	        |			И ВТ_ШкалыПУ.ТочкаУчета = ВТ_ВидыДифференцированностиПУ.ТочкаУчета
	        |			И ВТ_ШкалыПУ.ПриборУчета = ВТ_ВидыДифференцированностиПУ.ПриборУчета
	        |			И ВТ_ШкалыПУ.Шкала = ВТ_ВидыДифференцированностиПУ.Шкала
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	        |	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	        |	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	        |	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ВЫБОР
	        |		КОГДА энргЗначенияТарифовСрезПоследних.НДСВнутри
	        |			ТОГДА энргЗначенияТарифовСрезПоследних.Значение * 100 / (100 + энргЗначенияТарифовСрезПоследних.СтавкаНДС)
	        |		ИНАЧЕ энргЗначенияТарифовСрезПоследних.Значение
	        |	КОНЕЦ КАК Тариф
	        |ПОМЕСТИТЬ ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение
	        |ИЗ
	        |	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (Услуга, ГруппаПотребителей, ТарифнаяЗона, Поставщик) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ТарифныеЗоны.Услуга КАК Услуга,
	        |						ВТ_ТарифныеЗоны.ТарифнаяКатегория КАК ГруппаПотребителей,
	        |						ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	        |						ВТ_ТарифныеЗоны.Поставщик КАК Поставщик
	        |					ИЗ
	        |						ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны)) КАК энргЗначенияТарифовСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга КАК Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.КонецПериода) КАК КонецПериода,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.ПериодНачисления) КАК ПериодНачисления
	        |ПОМЕСТИТЬ ВТ_ПоследнееНачислениеЭЭ
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	        |		ПО бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВТ_ТарифныеЗоны.ОбъектРасчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТочкаУчета = ВТ_ТарифныеЗоны.ТочкаУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.Услуга = ВТ_ТарифныеЗоны.Услуга
	        |			И бестОбъемНачисленийЭлектроэнергии.ПриборУчета = ВТ_ТарифныеЗоны.ПриборУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона = ВТ_ТарифныеЗоны.ТарифнаяЗона
	        |ГДЕ
	        |	бестОбъемНачисленийЭлектроэнергии.Организация = &Организация
	        |	И бестОбъемНачисленийЭлектроэнергии.Район = &Район
	        |	И НЕ бестОбъемНачисленийЭлектроэнергии.Распределение
	        |	И бестОбъемНачисленийЭлектроэнергии.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	        |	И бестОбъемНачисленийЭлектроэнергии.Договор = &Договор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.Шкала,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона,
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ВидНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга КАК Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.СпособНачисления) КАК СпособНачисления,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.Тариф) КАК Тариф
	        |ПОМЕСТИТЬ ВТ_СпособНачисленияИТарифЭЭ
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнееНачислениеЭЭ КАК ВТ_ПоследнееНачислениеЭЭ
	        |		ПО бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВТ_ПоследнееНачислениеЭЭ.ОбъектРасчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТочкаУчета = ВТ_ПоследнееНачислениеЭЭ.ТочкаУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.Услуга = ВТ_ПоследнееНачислениеЭЭ.Услуга
	        |			И бестОбъемНачисленийЭлектроэнергии.ПриборУчета = ВТ_ПоследнееНачислениеЭЭ.ПриборУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона = ВТ_ПоследнееНачислениеЭЭ.ТарифнаяЗона
	        |			И бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВТ_ПоследнееНачислениеЭЭ.ОбъектРасчета
	        |			И (бестОбъемНачисленийЭлектроэнергии.Организация = &Организация)
	        |			И (бестОбъемНачисленийЭлектроэнергии.Район = &Район)
	        |			И (НЕ бестОбъемНачисленийЭлектроэнергии.Распределение)
	        |			И (бестОбъемНачисленийЭлектроэнергии.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление))
	        |			И (бестОбъемНачисленийЭлектроэнергии.Договор = &Договор)
	        |			И бестОбъемНачисленийЭлектроэнергии.КонецПериода = ВТ_ПоследнееНачислениеЭЭ.КонецПериода
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Шкала,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга КАК Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления КАК ПериодНачисления,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОбъемыИСуммыЭЭ
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнееНачислениеЭЭ КАК ВТ_ПоследнееНачислениеЭЭ
	        |		ПО бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВТ_ПоследнееНачислениеЭЭ.ОбъектРасчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТочкаУчета = ВТ_ПоследнееНачислениеЭЭ.ТочкаУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.Услуга = ВТ_ПоследнееНачислениеЭЭ.Услуга
	        |			И бестОбъемНачисленийЭлектроэнергии.ПриборУчета = ВТ_ПоследнееНачислениеЭЭ.ПриборУчета
	        |			И бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона = ВТ_ПоследнееНачислениеЭЭ.ТарифнаяЗона
	        |			И бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВТ_ПоследнееНачислениеЭЭ.ОбъектРасчета
	        |			И (бестОбъемНачисленийЭлектроэнергии.Организация = &Организация)
	        |			И (бестОбъемНачисленийЭлектроэнергии.Район = &Район)
	        |			И (бестОбъемНачисленийЭлектроэнергии.Договор = &Договор)
	        |			И бестОбъемНачисленийЭлектроэнергии.ПериодНачисления = ВТ_ПоследнееНачислениеЭЭ.ПериодНачисления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ПриборУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Шкала,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.КонецПериода) КАК КонецПериода,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.ПериодНачисления) КАК ПериодНачисления
	        |ПОМЕСТИТЬ ВТ_ПоследнееНачисление
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	        |		ПО бестОбъемНачисленийНП.ОбъектРасчета = ВТ_ТарифныеЗоны.ОбъектРасчета
	        |			И бестОбъемНачисленийНП.ТочкаУчета = ВТ_ТарифныеЗоны.ТочкаУчета
	        |			И бестОбъемНачисленийНП.Услуга = ВТ_ТарифныеЗоны.Услуга
	        |			И бестОбъемНачисленийНП.ПриборУчета = ВТ_ТарифныеЗоны.ПриборУчета
	        |			И бестОбъемНачисленийНП.ТарифнаяЗона = ВТ_ТарифныеЗоны.ТарифнаяЗона
	        |ГДЕ
	        |	бестОбъемНачисленийНП.Организация = &Организация
	        |	И бестОбъемНачисленийНП.Район = &Район
	        |	И НЕ бестОбъемНачисленийНП.Распределение
	        |	И бестОбъемНачисленийНП.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	        |	И бестОбъемНачисленийНП.Договор = &Договор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.ПриборУчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.Шкала,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ВидНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.СпособНачисления) КАК СпособНачисления
	        |ПОМЕСТИТЬ ВТ_СпособНачисления
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнееНачисление КАК ВТ_ПоследнееНачисление
	        |		ПО бестОбъемНачисленийНП.ОбъектРасчета = ВТ_ПоследнееНачисление.ОбъектРасчета
	        |			И бестОбъемНачисленийНП.ТочкаУчета = ВТ_ПоследнееНачисление.ТочкаУчета
	        |			И бестОбъемНачисленийНП.Услуга = ВТ_ПоследнееНачисление.Услуга
	        |			И бестОбъемНачисленийНП.ПриборУчета = ВТ_ПоследнееНачисление.ПриборУчета
	        |			И бестОбъемНачисленийНП.ТарифнаяЗона = ВТ_ПоследнееНачисление.ТарифнаяЗона
	        |			И бестОбъемНачисленийНП.ОбъектРасчета = ВТ_ПоследнееНачисление.ОбъектРасчета
	        |			И (бестОбъемНачисленийНП.Организация = &Организация)
	        |			И (бестОбъемНачисленийНП.Район = &Район)
	        |			И (НЕ бестОбъемНачисленийНП.Распределение)
	        |			И (бестОбъемНачисленийНП.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление))
	        |			И (бестОбъемНачисленийНП.Договор = &Договор)
	        |			И бестОбъемНачисленийНП.КонецПериода = ВТ_ПоследнееНачисление.КонецПериода
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.ПриборУчета,
	        |	бестОбъемНачисленийНП.Шкала,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслуги,
	        |	СУММА(бестОбъемНачисленийНП.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОбъемыИСуммы
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнееНачисление КАК ВТ_ПоследнееНачисление
	        |		ПО бестОбъемНачисленийНП.ОбъектРасчета = ВТ_ПоследнееНачисление.ОбъектРасчета
	        |			И бестОбъемНачисленийНП.ТочкаУчета = ВТ_ПоследнееНачисление.ТочкаУчета
	        |			И бестОбъемНачисленийНП.Услуга = ВТ_ПоследнееНачисление.Услуга
	        |			И бестОбъемНачисленийНП.ПриборУчета = ВТ_ПоследнееНачисление.ПриборУчета
	        |			И бестОбъемНачисленийНП.ТарифнаяЗона = ВТ_ПоследнееНачисление.ТарифнаяЗона
	        |			И бестОбъемНачисленийНП.ОбъектРасчета = ВТ_ПоследнееНачисление.ОбъектРасчета
	        |			И (бестОбъемНачисленийНП.Организация = &Организация)
	        |			И (бестОбъемНачисленийНП.Район = &Район)
	        |			И (бестОбъемНачисленийНП.Договор = &Договор)
	        |			И бестОбъемНачисленийНП.ПериодНачисления = ВТ_ПоследнееНачисление.ПериодНачисления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.ПриборУчета,
	        |	бестОбъемНачисленийНП.Шкала,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ПериодНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТарифныеЗоны.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТарифныеЗоны.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТарифныеЗоны.ТочкаПоставки КАК ТочкаПоставки,
	        |	ВТ_ТарифныеЗоны.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	ВТ_ТарифныеЗоны.Услуга КАК Услуга,
	        |	ВТ_ТарифныеЗоны.ТарифнаяКатегория КАК ТарифнаяКатегория,
	        |	ВТ_ТарифныеЗоны.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ТарифныеЗоны.ВидКанальности КАК ВидКанальности,
	        |	ВТ_ТарифныеЗоны.ТипСИ КАК ТипСИ,
	        |	ВТ_ТарифныеЗоны.ДатаУстановки КАК ДатаУстановки,
	        |	ВТ_ТарифныеЗоны.БалансоваяПринадлежность КАК БалансоваяПринадлежность,
	        |	ВТ_ТарифныеЗоны.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ТарифныеЗоны.ДатаСледующейПоверки КАК ДатаСледующейПоверки,
	        |	ВТ_ТарифныеЗоны.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ТарифныеЗоны.Шкала КАК Шкала,
	        |	ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.Тариф КАК Тариф,
	        |	ВТ_СпособНачисления.СпособНачисления КАК СпособНачисления,
	        |	ВТ_ТарифныеЗоны.КоэффициентПУ КАК КоэффициентПУ,
	        |	ВТ_ТарифныеЗоны.Поставщик КАК Поставщик,
	        |	ВТ_ОбъемыИСуммы.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ОбъемыИСуммы.ОбъемУслуги КАК ОбъемУслуги,
	        |	ВТ_ОбъемыИСуммы.Сумма КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ДанныеТУИтог
	        |ИЗ
	        |	ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение КАК ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение
	        |		ПО ВТ_ТарифныеЗоны.ТарифнаяКатегория = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.ГруппаПотребителей
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.Услуга
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособНачисления КАК ВТ_СпособНачисления
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_СпособНачисления.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_СпособНачисления.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_СпособНачисления.Услуга
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_СпособНачисления.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_СпособНачисления.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемыИСуммы КАК ВТ_ОбъемыИСуммы
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_ОбъемыИСуммы.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_ОбъемыИСуммы.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_ОбъемыИСуммы.Услуга
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_ОбъемыИСуммы.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_ОбъемыИСуммы.ТарифнаяЗона
	        |ГДЕ
	        |	НЕ ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ТарифныеЗоны.ОбъектРасчета,
	        |	ВТ_ТарифныеЗоны.ТочкаУчета,
	        |	ВТ_ТарифныеЗоны.ТочкаПоставки,
	        |	ВТ_ТарифныеЗоны.ЦеноваяКатегория,
	        |	ВТ_ТарифныеЗоны.Услуга,
	        |	ВТ_ТарифныеЗоны.ТарифнаяКатегория,
	        |	ВТ_ТарифныеЗоны.ПриборУчета,
	        |	ВТ_ТарифныеЗоны.ВидКанальности,
	        |	ВТ_ТарифныеЗоны.ТипСИ,
	        |	ВТ_ТарифныеЗоны.ДатаУстановки,
	        |	ВТ_ТарифныеЗоны.БалансоваяПринадлежность,
	        |	ВТ_ТарифныеЗоны.ДатаПоверки,
	        |	ВТ_ТарифныеЗоны.ДатаСледующейПоверки,
	        |	ВТ_ТарифныеЗоны.СистемаУчетаЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ТипПрибораУчета,
	        |	ВТ_ТарифныеЗоны.Шкала,
	        |	ВТ_ТарифныеЗоны.ТарифнаяЗона,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетПоМощности,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_СпособНачисленияИТарифЭЭ.Тариф,
	        |	ВТ_СпособНачисленияИТарифЭЭ.СпособНачисления,
	        |	ВТ_ТарифныеЗоны.КоэффициентПУ,
	        |	ВТ_ТарифныеЗоны.Поставщик,
	        |	ВТ_ОбъемыИСуммыЭЭ.ПериодНачисления,
	        |	ВТ_ОбъемыИСуммыЭЭ.ОбъемУслуги,
	        |	ВТ_ОбъемыИСуммыЭЭ.Сумма
	        |ИЗ
	        |	ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособНачисленияИТарифЭЭ КАК ВТ_СпособНачисленияИТарифЭЭ
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_СпособНачисленияИТарифЭЭ.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_СпособНачисленияИТарифЭЭ.Услуга
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_СпособНачисленияИТарифЭЭ.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_СпособНачисленияИТарифЭЭ.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_СпособНачисленияИТарифЭЭ.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемыИСуммыЭЭ КАК ВТ_ОбъемыИСуммыЭЭ
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_ОбъемыИСуммыЭЭ.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_ОбъемыИСуммыЭЭ.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_ОбъемыИСуммыЭЭ.Услуга
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_ОбъемыИСуммыЭЭ.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_ОбъемыИСуммыЭЭ.ТарифнаяЗона
	        |ГДЕ
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии
	        |	И НЕ ВТ_ТарифныеЗоны.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население)
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ТарифныеЗоны.ОбъектРасчета,
	        |	ВТ_ТарифныеЗоны.ТочкаУчета,
	        |	ВТ_ТарифныеЗоны.ТочкаПоставки,
	        |	ВТ_ТарифныеЗоны.ЦеноваяКатегория,
	        |	ВТ_ТарифныеЗоны.Услуга,
	        |	ВТ_ТарифныеЗоны.ТарифнаяКатегория,
	        |	ВТ_ТарифныеЗоны.ПриборУчета,
	        |	ВТ_ТарифныеЗоны.ВидКанальности,
	        |	ВТ_ТарифныеЗоны.ТипСИ,
	        |	ВТ_ТарифныеЗоны.ДатаУстановки,
	        |	ВТ_ТарифныеЗоны.БалансоваяПринадлежность,
	        |	ВТ_ТарифныеЗоны.ДатаПоверки,
	        |	ВТ_ТарифныеЗоны.ДатаСледующейПоверки,
	        |	ВТ_ТарифныеЗоны.СистемаУчетаЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ТипПрибораУчета,
	        |	ВТ_ТарифныеЗоны.Шкала,
	        |	ВТ_ТарифныеЗоны.ТарифнаяЗона,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетПоМощности,
	        |	ВТ_ТарифныеЗоны.ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.Тариф,
	        |	ВТ_СпособНачисленияИТарифЭЭ.СпособНачисления,
	        |	ВТ_ТарифныеЗоны.КоэффициентПУ,
	        |	ВТ_ТарифныеЗоны.Поставщик,
	        |	ВТ_ОбъемыИСуммыЭЭ.ПериодНачисления,
	        |	ВТ_ОбъемыИСуммыЭЭ.ОбъемУслуги,
	        |	ВТ_ОбъемыИСуммыЭЭ.Сумма
	        |ИЗ
	        |	ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение КАК ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение
	        |		ПО ВТ_ТарифныеЗоны.ТарифнаяКатегория = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.ГруппаПотребителей
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.Услуга
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_ТарифыНеЭлектроэнергииИлиЦКНаселение.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособНачисленияИТарифЭЭ КАК ВТ_СпособНачисленияИТарифЭЭ
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_СпособНачисленияИТарифЭЭ.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_СпособНачисленияИТарифЭЭ.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_СпособНачисленияИТарифЭЭ.Услуга
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_СпособНачисленияИТарифЭЭ.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_СпособНачисленияИТарифЭЭ.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемыИСуммыЭЭ КАК ВТ_ОбъемыИСуммыЭЭ
	        |		ПО ВТ_ТарифныеЗоны.ОбъектРасчета = ВТ_ОбъемыИСуммыЭЭ.ОбъектРасчета
	        |			И ВТ_ТарифныеЗоны.ТочкаУчета = ВТ_ОбъемыИСуммыЭЭ.ТочкаУчета
	        |			И ВТ_ТарифныеЗоны.Услуга = ВТ_ОбъемыИСуммыЭЭ.Услуга
	        |			И ВТ_ТарифныеЗоны.ПриборУчета = ВТ_ОбъемыИСуммыЭЭ.ПриборУчета
	        |			И ВТ_ТарифныеЗоны.ТарифнаяЗона = ВТ_ОбъемыИСуммыЭЭ.ТарифнаяЗона
	        |ГДЕ
	        |	ВТ_ТарифныеЗоны.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население)
	        |	И ВТ_ТарифныеЗоны.ИспользоватьРасчетЭлектроэнергии
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестТипыТарифовТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестТипыТарифовТочекУчетаСрезПоследних.ТипТарифа КАК ТипТарифа
	        |ПОМЕСТИТЬ ВТ_ТипыТарифовТУ
	        |ИЗ
	        |	РегистрСведений.бестТипыТарифовТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестТипыТарифовТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестЗначенияСкидкиТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестЗначенияСкидкиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестЗначенияСкидкиТочекУчетаСрезПоследних.ЗначениеСкидки КАК ЗначениеСкидки
	        |ПОМЕСТИТЬ ВТ_ЗначенияСкидкиТУ
	        |ИЗ
	        |	РегистрСведений.бестЗначенияСкидкиТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестЗначенияСкидкиТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестТарифныеСеткиТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестТарифныеСеткиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестТарифныеСеткиТочекУчетаСрезПоследних.ТарифнаяСетка КАК ТарифнаяСетка
	        |ПОМЕСТИТЬ ВТ_ТарифныеСеткиТУ
	        |ИЗ
	        |	РегистрСведений.бестТарифныеСеткиТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета) В
	        |					(ВЫБРАТЬ
	        |						ВТ_АктивныеТУ.МКД КАК МКД,
	        |						ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета
	        |					ИЗ
	        |						ВТ_АктивныеТУ КАК ВТ_АктивныеТУ)) КАК бестТарифныеСеткиТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестМаксимальныеПоказанияНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестМаксимальныеПоказанияНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	бестМаксимальныеПоказанияНПСрезПоследних.Шкала КАК Шкала,
	        |	бестМаксимальныеПоказанияНПСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестМаксимальныеПоказанияНПСрезПоследних.Показание КАК Показание,
	        |	бестМаксимальныеПоказанияНПСрезПоследних.Период КАК ДатаПоказания
	        |ПОМЕСТИТЬ ВТ_ПоследниеПоказания
	        |ИЗ
	        |	РегистрСведений.бестМаксимальныеПоказанияНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (ОбъектРасчета, ПриборУчета, Шкала, ТарифнаяЗона) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ТарифныеЗоны.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ТарифныеЗоны.ПриборУчета КАК ПриборУчета,
	        |						ВТ_ТарифныеЗоны.Шкала КАК Шкала,
	        |						ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	        |					ИЗ
	        |						ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны)) КАК бестМаксимальныеПоказанияНПСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПотериТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПотериТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПотериТочекУчетаСрезПоследних.ВидПотерь КАК ВидПотерь,
	        |	бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестПотериТочекУчетаСрезПоследних.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
	        |	бестПотериТочекУчетаСрезПоследних.ПроцентПотерь КАК ПроцентПотерь,
	        |	бестПотериТочекУчетаСрезПоследних.ВидПотерь.Представление КАК ВидПотерьПредставление,
	        |	бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона.Представление КАК ТарифнаяЗонаПредставление
	        |ИЗ
	        |	РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (МКД, ОбъектРасчета, ТочкаУчета, ТарифнаяЗона) В
	        |					(ВЫБРАТЬ
	        |						ВТ_ТарифныеЗоны.МКД КАК МКД,
	        |						ВТ_ТарифныеЗоны.ОбъектРасчета КАК ОбъектРасчета,
	        |						ВТ_ТарифныеЗоны.ТочкаУчета КАК ТочкаУчета,
	        |						ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	        |					ИЗ
	        |						ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны)) КАК бестПотериТочекУчетаСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	энргВидыЭнергииСредствИзмерения.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ПРЕДСТАВЛЕНИЕ(энргВидыЭнергииСредствИзмерения.ВидЭнергии) КАК ВидЭнергии
	        |ИЗ
	        |	РегистрСведений.энргВидыЭнергииСредствИзмерения КАК энргВидыЭнергииСредствИзмерения
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеТУ КАК ВТ_ДанныеТУ
	        |		ПО энргВидыЭнергииСредствИзмерения.ТипПрибораУчета = ВТ_ДанныеТУ.ТипПрибораУчета
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ТипПрибораУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНомерПломбПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	бестНомерПломбПриборовУчетаНПСрезПоследних.НомерПломбы КАК НомерПломбы,
	        |	бестНомерПломбПриборовУчетаНПСрезПоследних.МестоУстановки.Представление КАК МестоУстановки,
	        |	бестНомерПломбПриборовУчетаНПСрезПоследних.ДатаОперацииСПломбой КАК ДатаОперацииСПломбой
	        |ИЗ
	        |	РегистрСведений.бестНомерПломбПриборовУчетаНП.СрезПоследних(
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И ПриборУчета В
	        |					(ВЫБРАТЬ
	        |						ВТ_УзлыИПриборы.ПриборУчета КАК ПриборУчета
	        |					ИЗ
	        |						ВТ_УзлыИПриборы КАК ВТ_УзлыИПриборы)) КАК бестНомерПломбПриборовУчетаНПСрезПоследних
	        |ГДЕ
	        |	бестНомерПломбПриборовУчетаНПСрезПоследних.Состояние
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_АктивныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ЗначенияПлощадейОбъектов.Площадь КАК Площадь,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета)
	        |				ТОГДА бестОбъектыРасчетаКонтактнаяИнформация.Представление
	        |		КОНЕЦ) КАК АдресОбъекта
	        |ИЗ
	        |	ВТ_АктивныеТУ КАК ВТ_АктивныеТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПлощадейОбъектов КАК ВТ_ЗначенияПлощадейОбъектов
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = ВТ_ЗначенияПлощадейОбъектов.ОбъектРасчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	        |		ПО ВТ_АктивныеТУ.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
	        |			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_АктивныеТУ.ОбъектРасчета,
	        |	ВТ_ЗначенияПлощадейОбъектов.Площадь
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДанныеТУИтог.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ДанныеТУИтог.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ДанныеТУИтог.ТочкаПоставки КАК ТочкаПоставки,
	        |	ВТ_ДанныеТУИтог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	ПРЕДСТАВЛЕНИЕ(ВТ_ДанныеТУИтог.ЦеноваяКатегория) КАК ЦеноваяКатегорияПредставление,
	        |	ВТ_ДанныеТУИтог.Услуга КАК Услуга,
	        |	ВТ_ДанныеТУИтог.ТарифнаяКатегория КАК ТарифнаяКатегория,
	        |	ВТ_ДанныеТУИтог.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ДанныеТУИтог.ВидКанальности КАК ВидКанальности,
	        |	ВТ_ДанныеТУИтог.ТипСИ КАК ТипСИ,
	        |	ВТ_ДанныеТУИтог.ДатаУстановки КАК ДатаУстановки,
	        |	ВТ_ДанныеТУИтог.БалансоваяПринадлежность КАК БалансоваяПринадлежность,
	        |	ВТ_ДанныеТУИтог.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ДанныеТУИтог.ДатаСледующейПоверки КАК ДатаСледующейПоверки,
	        |	ВТ_ДанныеТУИтог.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
	        |	ВТ_ДанныеТУИтог.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ДанныеТУИтог.Шкала КАК Шкала,
	        |	ВТ_ДанныеТУИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ВТ_ДанныеТУИтог.ИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	ВТ_ДанныеТУИтог.ИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	        |	ВТ_ДанныеТУИтог.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	        |	ВТ_ДанныеТУИтог.Тариф КАК Тариф,
	        |	ВТ_ДанныеТУИтог.СпособНачисления КАК СпособНачисления,
	        |	ПРЕДСТАВЛЕНИЕ(ВТ_ДанныеТУИтог.СпособНачисления) КАК СпособНачисленияПредставление,
	        |	ВТ_ТипыТарифовТУ.ТипТарифа КАК ТипТарифа,
	        |	ПРЕДСТАВЛЕНИЕ(ВТ_ТипыТарифовТУ.ТипТарифа) КАК ТипТарифаПредставление,
	        |	ВТ_ЗначенияСкидкиТУ.ЗначениеСкидки КАК ЗначениеСкидки,
	        |	ВТ_ТарифныеСеткиТУ.ТарифнаяСетка КАК ТарифнаяСетка,
	        |	ВТ_ДанныеТУИтог.КоэффициентПУ КАК КоэффициентПУ,
	        |	ВТ_ДанныеТУИтог.Шкала.Представление КАК ШкалаПредставление,
	        |	ВТ_ПоследниеПоказания.Показание КАК Показание,
	        |	ВТ_ПоследниеПоказания.ДатаПоказания КАК ДатаПоказания,
	        |	НЕ ВТ_ПоследниеПоказания.ОбъектРасчета ЕСТЬ NULL КАК ЕстьПоследниеПоказания,
	        |	ВТ_ДанныеТУИтог.Поставщик КАК Поставщик,
	        |	ВТ_ДанныеТУИтог.ТочкаУчета.Представление КАК ТочкаУчетаПредставление,
	        |	ВТ_ДанныеТУИтог.ТочкаПоставки.Представление КАК ТочкаПоставкиПредставление,
	        |	ВТ_ДанныеТУИтог.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ДанныеТУИтог.ОбъемУслуги КАК ОбъемУслуги,
	        |	ВТ_ДанныеТУИтог.Сумма КАК Сумма
	        |ИЗ
	        |	ВТ_ДанныеТУИтог КАК ВТ_ДанныеТУИтог
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипыТарифовТУ КАК ВТ_ТипыТарифовТУ
	        |		ПО ВТ_ДанныеТУИтог.ОбъектРасчета = ВТ_ТипыТарифовТУ.ОбъектРасчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСкидкиТУ КАК ВТ_ЗначенияСкидкиТУ
	        |		ПО ВТ_ДанныеТУИтог.ОбъектРасчета = ВТ_ЗначенияСкидкиТУ.ОбъектРасчета
	        |			И ВТ_ДанныеТУИтог.ТочкаУчета = ВТ_ЗначенияСкидкиТУ.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТарифныеСеткиТУ КАК ВТ_ТарифныеСеткиТУ
	        |		ПО ВТ_ДанныеТУИтог.ОбъектРасчета = ВТ_ТарифныеСеткиТУ.ОбъектРасчета
	        |			И ВТ_ДанныеТУИтог.ТочкаУчета = ВТ_ТарифныеСеткиТУ.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеПоказания КАК ВТ_ПоследниеПоказания
	        |		ПО ВТ_ДанныеТУИтог.ОбъектРасчета = ВТ_ПоследниеПоказания.ОбъектРасчета
	        |			И ВТ_ДанныеТУИтог.ПриборУчета = ВТ_ПоследниеПоказания.ПриборУчета
	        |			И ВТ_ДанныеТУИтог.Шкала = ВТ_ПоследниеПоказания.Шкала
	        |			И ВТ_ДанныеТУИтог.ТарифнаяЗона = ВТ_ПоследниеПоказания.ТарифнаяЗона
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ОбъектРасчета,
	        |	ТочкаУчета,
	        |	Услуга,
	        |	ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПриборыУзловУчета.ТипИзмерителя КАК ТипИзмерителя,
	        |	ВТ_ПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	        |	энргТипыПриборовУчета.МаркаПУ КАК ТипСИ,
	        |	энргПриборыУчетаАбонента.ДатаУстановки КАК ДатаУстановки,
	        |	ВТ_ДатыПоверкиПУ.ДатаПоверки КАК ДатаПоверки,
	        |	ДОБАВИТЬКДАТЕ(ВТ_ДатыПоверкиПУ.ДатаПоверки, ГОД, ЕСТЬNULL(энргТипыПриборовУчета.бестМежповерочныйИнтервал, 0)) КАК ДатаСледующейПоверки
	        |ИЗ
	        |	ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПоверкиПУ КАК ВТ_ДатыПоверкиПУ
	        |		ПО ВТ_ПриборыУзловУчета.ТочкаУчета = ВТ_ДатыПоверкиПУ.ТочкаУчета
	        |			И ВТ_ПриборыУзловУчета.ПриборУчета = ВТ_ДатыПоверкиПУ.ПриборУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	        |		ПО ВТ_ПриборыУзловУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	        |		ПО ВТ_ПриборыУзловУчета.ТипИзмерителя = энргТипыПриборовУчета.Ссылка";

КонецФункции 

Функция ЗаполнитьСоответствиеПотерь(ВыборкаПотери, ИспользоватьТарифныеЗоны)

	ШаблонФиксОбъем = НСтр("ru = 'Фиксированный объем потерь (%1)'");
	ШаблонПроцент = НСтр("ru = 'Процент потерь (%1)'");
	СоответствиеПотери = Новый Соответствие;
	Пока ВыборкаПотери.Следующий() Цикл 
		
		ПолеГруппировкиПотерь = ВыборкаПотери.ВидПотерьПредставление;
		Если ИспользоватьТарифныеЗоны Тогда 
			ПолеГруппировкиПотерь = ВыборкаПотери.ТарифнаяЗонаПредставление;
		КонецЕсли;
		МассивПотери = СоответствиеПотери.Получить(ВыборкаПотери.ТочкаУчета);
		Если МассивПотери = Неопределено Тогда
			МассивПотери = Новый Массив;
		КонецЕсли; 
		
		КлючФиксОбъем = СтрШаблон(ШаблонФиксОбъем, ПолеГруппировкиПотерь); 
		КлючПроцент = СтрШаблон(ШаблонПроцент, ПолеГруппировкиПотерь);
		
		СтруктураПотери = Новый Структура("Ключ, Значение");
		СтруктураПотери.Ключ = КлючФиксОбъем;
		СтруктураПотери.Значение = ВыборкаПотери.ФиксированныйОбъемПотерь;
		МассивПотери.Добавить(СтруктураПотери);
		
		СтруктураПотери = Новый Структура("Ключ, Значение");
		СтруктураПотери.Ключ = КлючПроцент;
		СтруктураПотери.Значение = ВыборкаПотери.ПроцентПотерь;
		МассивПотери.Добавить(СтруктураПотери);
		
		СоответствиеПотери.Вставить(ВыборкаПотери.ТочкаУчета, МассивПотери);
	
	КонецЦикла;
	Возврат СоответствиеПотери;

КонецФункции

Функция ЗаполнитьСоответствиеВидовЭнергии(ВыборкаВидыЭнергии)

	СоответствиеВидыЭнергии = Новый Соответствие;
	ШаблонВидЭнергии = НСтр("ru = '%1 / %2'");
	Пока ВыборкаВидыЭнергии.Следующий() Цикл
		ВидЭнергии = СоответствиеВидыЭнергии.Получить(ВыборкаВидыЭнергии.ТипПрибораУчета);
		Если ВидЭнергии = Неопределено Тогда
			ВидЭнергии = ВыборкаВидыЭнергии.ВидЭнергии;
		Иначе
			ВидЭнергии = СтрШаблон(ШаблонВидЭнергии, ВидЭнергии, ВыборкаВидыЭнергии.ВидЭнергии);
		КонецЕсли;
	КонецЦикла;
	Возврат СоответствиеВидыЭнергии;

КонецФункции

Функция ЗаполнитьСоответствиеПломб(ВыборкаПломбы)

	СоответствиеПломбы = Новый Соответствие;
	ШаблонПломбы = НСтр("ru = '%1 / %2'");
	Пока ВыборкаПломбы.Следующий() Цикл 
		
		МассивПломб = СоответствиеПломбы.Получить(ВыборкаПломбы.ПриборУчета);
		Если МассивПломб = Неопределено Тогда
			МассивПломб = Новый Массив;
		КонецЕсли; 
		
		СтруктураПломбы = Новый Структура("Ключ, Значение");
		СтруктураПломбы.Ключ = ВыборкаПломбы.НомерПломбы; 
		ДатаОперацииСПломбой = Формат(ВыборкаПломбы.ДатаОперацииСПломбой, "ДЛФ=D");
		СтруктураПломбы.Значение = СтрШаблон(ШаблонПломбы, ВыборкаПломбы.МестоУстановки, ДатаОперацииСПломбой);
		МассивПломб.Добавить(СтруктураПломбы);
		
		СоответствиеПломбы.Вставить(ВыборкаПломбы.ПриборУчета, МассивПломб);
	
	КонецЦикла;
	Возврат СоответствиеПломбы;

КонецФункции

Процедура ЗаполнитьТЗОбъектыРасчета(ПоляДоговора, ВыборкаОбъектыРасчета, ОбъектыРасчета)
	Пока ВыборкаОбъектыРасчета.Следующий() Цикл
		СтрокаОбъектов = ОбъектыРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОбъектов, ВыборкаОбъектыРасчета);
	КонецЦикла;
	ЗаполнитьТЗОбъектыРасчетаПереопределяемый(ПоляДоговора, ВыборкаОбъектыРасчета, ОбъектыРасчета);
КонецПроцедуры

Процедура ЗаполнитьТЗОбъектыРасчетаПереопределяемый(ПоляДоговора, ВыборкаОбъектыРасчета, ОбъектыРасчета)
	// Переопределяется в расширении для заполнения дополнительных полей ТЗ ОбъектыРасчета
КонецПроцедуры

Процедура ЗаполнитьТЗТочкиПоставки(ВыборкаТочкиПоставки, ТочкиПоставки, ТЗСтруктураСети)
	Пока ВыборкаТочкиПоставки.Следующий() Цикл
		СтрокаТП = ТочкиПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТП, ВыборкаТочкиПоставки);
		СхемаПрисоединения = ВыборкаТочкиПоставки.СтруктураСетиПредставление;
		СтруктураСети = ВыборкаТочкиПоставки.СтруктураСети;
		Справочники.бестСтруктураСети.ЗаполнитьСхемуПрисоединения(СтруктураСети, ТЗСтруктураСети, СхемаПрисоединения);
		СтрокаТП.СхемаПрисоединения = СхемаПрисоединения;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьОбщиеДанныеДереваТУ(ВыборкаТУ, ДеревоДанныеПоТУ, ПоляДоговора, СтрокиДерева)
	
	СтрокаТУ = ДеревоДанныеПоТУ.Строки.Добавить();
	СтрокиДерева.СтрокаТУ = СтрокаТУ;
	ЗаполнитьЗначенияСвойств(СтрокаТУ, ВыборкаТУ);
	СтрокаТУ.Ключ = НСтр("ru = 'Точка учета'");
	СтрокаТУ.Значение = ВыборкаТУ.ТочкаУчетаПредставление;
	
	СтрокаОбщиеДанныеТУ = СтрокаТУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаОбщиеДанныеТУ, ВыборкаТУ);
	СтрокаОбщиеДанныеТУ.Ключ = НСтр("ru = 'Общие данные'");
	
	СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Точка поставки'");
	СтрокаДерева.Значение = ВыборкаТУ.ТочкаПоставкиПредставление;
	
	Если ПоляДоговора.НезависимыйСбыт Тогда
		СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Тип тарифа'");
		СтрокаДерева.Значение = ВыборкаТУ.ТипТарифаПредставление;
		
		СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Значение скидки'");
		СтрокаДерева.Значение = ВыборкаТУ.ЗначениеСкидки;
		
		Если ВыборкаТУ.ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ФиксированныйТариф Тогда
			СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
			СтрокаДерева.Ключ = НСтр("ru = 'Тарифная сетка'");
			СтрокаДерева.Значение = ВыборкаТУ.ТарифнаяСетка;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоляДоговора.НезависимыйСбыт И ВыборкаТУ.ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ЦеноваяКатегорияГП
		Или Не ПоляДоговора.НезависимыйСбыт И ВыборкаТУ.ИспользоватьРасчетЭлектроэнергии Тогда
		СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Ценовая категория'");
		СтрокаДерева.Значение = ВыборкаТУ.ЦеноваяКатегорияПредставление;
	КонецЕсли; 
	
	Если Не ВыборкаТУ.ИспользоватьРасчетЭлектроэнергии ИЛИ ВыборкаТУ.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.Население Тогда
		СтрокаДерева = СтрокаОбщиеДанныеТУ.Строки.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Тарифная категория'");
		СтрокаДерева.Значение = ВыборкаТУ.ТарифнаяКатегория;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОбщиеДанныеДереваПУ(ВыборкаТУ, ДеревоДанныеПоПУ, ПоляДоговора, СоответствиеВидыЭнергии, СоответствиеПломбы)
	
	СтрокаОбщиеДанныеПУ = ДеревоДанныеПоПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаОбщиеДанныеПУ, ВыборкаТУ);
	СтрокаОбщиеДанныеПУ.Ключ = НСтр("ru = 'Общие данные'");
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Номер прибора учета'"); 
	СтрокаДерева.Значение = ВыборкаТУ.ПриборУчета; 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Тип СИ'"); 
	СтрокаДерева.Значение = ВыборкаТУ.ТипСИ; 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата установки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаТУ.ДатаУстановки, "ДЛФ=D"); 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Балансовая принадлежность'"); 
	СтрокаДерева.Значение = ВыборкаТУ.БалансоваяПринадлежность; 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата фактической поверки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаТУ.ДатаПоверки, "ДЛФ=D"); 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата следующей поверки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаТУ.ДатаСледующейПоверки, "ДЛФ=D"); 
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = НСтр("ru = 'Вид энергии'"); 
	СтрокаДерева.Значение = СоответствиеВидыЭнергии.Получить(ВыборкаТУ.ТипПрибораУчета); 
	
	ЗаголовокКоэффициентПУ = НСтр("ru = 'Коэффициент ПУ'");
	
	Если ПоляДоговора.ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда
		СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Система учета электроэнергии'"); 
		СтрокаДерева.Значение = ВыборкаТУ.СистемаУчетаЭлектроэнергии;
		
		ЗаголовокКоэффициентПУ = НСтр("ru = 'Коэффициент трансформации'");
	КонецЕсли;
	
	СтрокаДерева = СтрокаОбщиеДанныеПУ.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
	СтрокаДерева.Ключ = ЗаголовокКоэффициентПУ; 
	СтрокаДерева.Значение = ВыборкаТУ.КоэффициентПУ;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОбУслугеДереваТУ(ВыборкаТУ, СтрокаТУ, СтрокаУслуга, ПоляДоговора, ТекущиеДанные, СтрокиДерева) 
	
	Если (Не ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета Или Не ТекущиеДанные.Услуга = ВыборкаТУ.Услуга Или Не ТекущиеДанные.ТарифнаяЗона = ВыборкаТУ.ТарифнаяЗона) И Не ВыборкаТУ.ИспользоватьРасчетРеактивнойЭнергии Тогда
		
		Если Не ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета Или Не ТекущиеДанные.Услуга = ВыборкаТУ.Услуга Тогда
			СтрокаУслуга = СтрокаТУ.Строки.Добавить();
			СтрокиДерева.СтрокаУслуга = СтрокаУслуга;
			ЗаполнитьЗначенияСвойств(СтрокаУслуга, ВыборкаТУ);
			СтрокаУслуга.Ключ = НСтр("ru = 'Услуга'");
			СтрокаУслуга.Значение = ВыборкаТУ.Услуга;
			
			СтрокаДерева = СтрокаУслуга.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
			СтрокаДерева.Ключ = НСтр("ru = 'Поставщик'");
			СтрокаДерева.Значение = ВыборкаТУ.Поставщик;
		Иначе
			СтрокаУслуга = СтрокиДерева.СтрокаУслуга;
		КонецЕсли;
		СтрокаРодительТУ = СтрокаУслуга;
		
		Если ПоляДоговора.ИспользоватьТарифныеЗоны И ЗначениеЗаполнено(ВыборкаТУ.ТарифнаяЗона) Тогда
			СтрокаТарифнаяЗона = СтрокаРодительТУ.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТарифнаяЗона, ВыборкаТУ);
			СтрокаТарифнаяЗона.Ключ = ВыборкаТУ.ТарифнаяЗона; 
			СтрокаРодительТУ = СтрокаТарифнаяЗона;
		КонецЕсли;
		
		СтрокаДерева = СтрокаРодительТУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Способ расчета'");
		СтрокаДерева.Значение = ВыборкаТУ.СпособНачисленияПредставление;
		
		СтрокаДерева = СтрокаРодительТУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Значение тарифа'");
		СтрокаДерева.Значение = ВыборкаТУ.Тариф;
		
		СтрокаРасчет = СтрокаРодительТУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасчет, ВыборкаТУ);
		ШаблонРасчет = НСтр("ru = 'Расчет за период %1'");
		ПериодНачисления = Формат(ВыборкаТУ.ПериодНачисления, "ДФ='ММММ yyyy'");
		СтрокаРасчет.Ключ = СтрШаблон(ШаблонРасчет, ПериодНачисления);
		
		СтрокаДерева = СтрокаРасчет.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Объем услуги'");
		СтрокаДерева.Значение = ВыборкаТУ.ОбъемУслуги;
		
		СтрокаДерева = СтрокаРасчет.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Сумма без НДС'");
		СтрокаДерева.Значение = ВыборкаТУ.Сумма;		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеПоказанийПУ(ВыборкаТУ, ДеревоДанныеПоПУ, ПоляДоговора, ТекущиеДанные, СтрокиДерева)
	
	ШаблонШкала = НСтр("ru = 'Шкала (%1)'");
	Если ВыборкаТУ.ЕстьПоследниеПоказания И Не (ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета И ТекущиеДанные.Шкала = ВыборкаТУ.Шкала И ТекущиеДанные.ТарифнаяЗона = ВыборкаТУ.ТарифнаяЗона) Тогда 
		Если СтрокиДерева.СтрокаПоказания = Неопределено Тогда
			СтрокаПоказания = ДеревоДанныеПоПУ.Строки.Добавить();
			СтрокиДерева.СтрокаПоказания = СтрокаПоказания;
			ЗаполнитьЗначенияСвойств(СтрокаПоказания, ВыборкаТУ);
			СтрокаПоказания.Ключ = НСтр("ru = 'Данные показаний'");
		Иначе
			СтрокаПоказания = СтрокиДерева.СтрокаПоказания;
		КонецЕсли;
		СтрокаРодительПУ = СтрокаПоказания;
		Если ПоляДоговора.ИспользоватьШкалыПриборовУчета Тогда
			Если Не ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета Или Не ТекущиеДанные.Шкала = ВыборкаТУ.Шкала Тогда
				СтрокаШкала = СтрокаРодительПУ.Строки.Добавить();
				СтрокиДерева.СтрокаШкала = СтрокаШкала;
				ЗаполнитьЗначенияСвойств(СтрокаШкала, ВыборкаТУ);
				СтрокаШкала.Ключ = СтрШаблон(ШаблонШкала, ВыборкаТУ.ШкалаПредставление);
			Иначе
				СтрокаШкала = СтрокиДерева.СтрокаШкала;
			КонецЕсли;
			СтрокаРодительПУ = СтрокаШкала;
		КонецЕсли;
		
		Если (Не ТекущиеДанные.ТУ = ВыборкаТУ.ТочкаУчета Или Не ТекущиеДанные.ТарифнаяЗона = ВыборкаТУ.ТарифнаяЗона) И ПоляДоговора.ИспользоватьТарифныеЗоны И ЗначениеЗаполнено(ВыборкаТУ.ТарифнаяЗона) Тогда
			СтрокаТарифнаяЗона = СтрокаРодительПУ.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТарифнаяЗона, ВыборкаТУ);
			СтрокаТарифнаяЗона.Ключ = ВыборкаТУ.ТарифнаяЗона; 
			СтрокаРодительПУ = СтрокаТарифнаяЗона;
		КонецЕсли;
		
		СтрокаДерева = СтрокаРодительПУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Последние показания'"); 
		СтрокаДерева.Значение = ВыборкаТУ.Показание;
		
		СтрокаДерева = СтрокаРодительПУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаТУ);
		СтрокаДерева.Ключ = НСтр("ru = 'Дата последних показаний'"); 
		СтрокаДерева.Значение = Формат(ВыборкаТУ.ДатаПоказания, "ДЛФ=D");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДеревоПоСоответствию(Выборка, ИмяПоляПоиска, Соответствие, СтрокаДереваРодитель, Заголовок)

	Массив = Соответствие.Получить(Выборка[ИмяПоляПоиска]);
	Если Не Массив = Неопределено Тогда
		СтрокаЗаголовок = СтрокаДереваРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаголовок, Выборка);
		СтрокаЗаголовок.Ключ = Заголовок;
		
		Для Каждого ЭлементМассива Из Массив Цикл
			СтрокаДерева = СтрокаЗаголовок.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОбщиеДанныеДереваИзмерительногоКомплекса(ВыборкаИзмерительныйКомплекс, ДеревоДанныеПоИзмерительномуКомплексу, СтрокиДерева)

	СтрокаТипИзмерителя = СтрокиДерева.СтрокаТипИзмерителя;
	СтрокаТипИзмерителя = ДеревоДанныеПоИзмерительномуКомплексу.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТипИзмерителя, ВыборкаИзмерительныйКомплекс);
	СтрокаТипИзмерителя.Ключ = ВыборкаИзмерительныйКомплекс.ТипИзмерителя;
	
	СтрокаДерева = СтрокаТипИзмерителя.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаИзмерительныйКомплекс);
	СтрокаДерева.Ключ = НСтр("ru = 'Номер прибора учета'"); 
	СтрокаДерева.Значение = ВыборкаИзмерительныйКомплекс.ПриборУчета;
	
	СтрокаДерева = СтрокаТипИзмерителя.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаИзмерительныйКомплекс);
	СтрокаДерева.Ключ = НСтр("ru = 'Тип СИ'"); 
	СтрокаДерева.Значение = ВыборкаИзмерительныйКомплекс.ТипСИ;
	
	СтрокаДерева = СтрокаТипИзмерителя.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаИзмерительныйКомплекс);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата установки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаИзмерительныйКомплекс.ДатаУстановки, "ДЛФ=D");
	
	СтрокаДерева = СтрокаТипИзмерителя.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаИзмерительныйКомплекс);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата фактической поверки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаИзмерительныйКомплекс.ДатаПоверки, "ДЛФ=D");
	
	СтрокаДерева = СтрокаТипИзмерителя.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаИзмерительныйКомплекс);
	СтрокаДерева.Ключ = НСтр("ru = 'Дата следующей поверки'"); 
	СтрокаДерева.Значение = Формат(ВыборкаИзмерительныйКомплекс.ДатаСледующейПоверки, "ДЛФ=D");

КонецПроцедуры

#КонецОбласти