#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройку применения тарифа в разрезе комнат.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НастройкаПримененияТарифаВРазрезеКомнат(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкаПримененияТарифаВРазрезеКомнат());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНастройкаПримененияТарифаВРазрезеКомнат()
	
	Текст =	
	"ВЫБРАТЬ
	|	энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних.Период КАК Период,
	|	энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних.Организация КАК Организация,
	|	энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних.Район КАК Район,
	|	энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних.ИпользованиеТарифаКомнат КАК ИпользованиеТарифаКомнат
	|ИЗ
	|	РегистрСведений.энргНастройкаПримененияТарифаВРазрезеКомнат.СрезПоследних КАК энргНастройкаПримененияТарифаВРазрезеКомнатСрезПоследних";
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли