#Область ОбработчикиСобытий

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	Объект.Соответствие.Очистить();	
	Для каждого ТЧ Из Метаданные.Документы[Объект.Документ].ТабличныеЧасти Цикл
		Стр = Объект.Соответствие.Добавить();
		Стр.РеквизитДокумента = "Табличная часть: " + ТЧ;
		Для каждого Реквизит Из ТЧ.Реквизиты Цикл
			Стр = Объект.Соответствие.Добавить();
			Стр.РеквизитДокумента 	= Реквизит.Имя;
			Стр.Синоним 			= Реквизит.Синоним;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеЗаголовка();
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Для Каждого ТипДокумента Из Метаданные.Документы Цикл
		Имя = ТипДокумента.Имя;
		Синоним = ТипДокумента.Синоним;
		Элементы.Документ.СписокВыбора.Добавить(Имя,Синоним);
    КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	НаборЗаписей = РегистрыСведений.энргСоответствиеПолей.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Справочник.Установить(Объект.Ссылка); 
	
	Для Каждого СтрокаТаблицы Из Объект.Соответствие Цикл 
		Если ЗначениеЗаполнено(СтрокаТаблицы.НазваниеКолонки) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период 				= ТекущаяДата();
			НоваяЗапись.Справочник 			= Объект.Ссылка;
			НоваяЗапись.РеквизитДокумента	= СтрокаТаблицы.РеквизитДокумента;
			НоваяЗапись.НомерКолонки 		= СтрокаТаблицы.НазваниеКолонки;
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзDBFПриИзменении(Элемент)
	ОтображениеЗаголовка();	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеЗаголовка()
	Если Объект.ЗагрузитьИзDBF Тогда
		Элементы.СоответствиеНазваниеКолонки.Заголовок = "Название колонки";
	Иначе 
		Элементы.СоответствиеНазваниеКолонки.Заголовок = "Номер колонки";		
	КонецЕсли;
КонецПроцедуры








#КонецОбласти
