
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргАбоненты(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

#КонецОбласти

#Область СобытияСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;

	Если ТекСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
			
	Если ТекСтрока.Свойство("Ссылка") Тогда 		
		ТекЭлемент = ТекСтрока.ссылка;
		
		УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЛС(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран абонент");
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ЭтоГруппа тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закрытие лицевого для группы не доступно");
		Возврат;
	КонецЕсли; 	
	
	ДанныеЗаполнения  = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС"));
	ДанныеЗаполнения.Вставить("Абонент",ТекСтрока.ссылка);
	ДанныеЗаполнения.Вставить("Район",ТекСтрока.Район);
	ДанныеЗаполнения.Вставить("Организация",ТекСтрока.Организация);
	ДанныеЗаполнения.Вставить("КлючПомещения",ТекСтрока.КлючПомещения);
	
	ПараметрыОткрытия  =Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ДанныеЗаполнения);
	ПараметрыОткрытия.Вставить("ЗаполнитьДокумент",Истина);	
	ОткрытьФорму("Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаЗакрытиеЛС",ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПлощади(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьЗначениеПлощади.ФормаОбъекта");	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолвоПрописанных(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьКоличествоПрописанных.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУслугу(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСУслугами.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги"));
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУслугу(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСУслугами.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги"));
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ"));
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидБлагоустройства(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьВидБлагоустройстваАбонента.ФормаОбъекта");	
КонецПроцедуры

#КонецОбласти

#Область СобытияКонтролерыМаршруты

&НаКлиенте
Процедура КонтролерыМаршрутыПередНачаломИзменения(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтролерыМаршрутыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента(ИмяОткрываемойФормы,ВидОперации = Неопределено)
	ТекСтрока 					= Элементы.Список.ТекущиеДанные;
	
	ЗаполнитьДокумент 			= Истина;
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("ЗаполнитьДокумент",ЗаполнитьДокумент);
	
	Если ЗаполнитьДокумент тогда
		ЗначенияЗаполнения  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
		ЗначенияЗаполнения.Абонент  = ТекСтрока.ссылка;
		ЗначенияЗаполнения.Организация  	= ТекСтрока.Организация;
		ЗначенияЗаполнения.Район		  	=  ТекСтрока.Район;
		ЗначенияЗаполнения.КлючПомещения	=ТекСтрока.КлючПомещения;
		//энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЗначенияЗаполнения); 
	иначе
		ЗначенияЗаполнения = Новый Структура;
	КонецЕсли;
	ЕСли ВидОперации <>Неопределено тогда
		ЗначенияЗаполнения.Вставить("ВидОперации",ВидОперации);
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	ОткрытьФорму(ИмяОткрываемойФормы,ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока)
	
	Абонент 	= ТекСтрока.ссылка;		
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Район", ТекСтрока.Район);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргАбоненты.КлючПомещения.Строение КАК Строение
	               |ПОМЕСТИТЬ ВТ_СтрАб
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	энргАбоненты.Ссылка = &Абонент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	энргСтроенияКонтактнаяИнформация.Представление КАК Представление,
	               |	энргСтроенияКонтактнаяИнформация.Ссылка КАК Строение
	               |ПОМЕСТИТЬ ВТ_Строение
	               |ИЗ
	               |	ВТ_СтрАб КАК ВТ_СтрАб
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	               |		ПО ВТ_СтрАб.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргСтроенияКонтактнаяИнформация.Ссылка,
	               |	энргСтроенияКонтактнаяИнформация.Представление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК АдресМаршрута,
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка.Владелец КАК Контролер,
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка КАК Маршрут
	               |ИЗ
	               |	ВТ_Строение КАК ВТ_Строение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	               |		ПО (ВТ_Строение.Представление ПОДОБНО энргМаршрутыКонтроллеровАдресаМаршрута.Представление)";
	
	
	
	Результат 							= Запрос.Выполнить();
	ВыгрузкаМаршруты 					= Результат.Выгрузить();
	КонтролерыМаршруты.Загрузить(ВыгрузкаМаршруты);
	
	запрос = новый запрос;
	запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", ТекСтрока.Организация);
	Запрос.УстановитьПараметр("Район", ТекСтрока.Район);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	Запрос.Текст=  "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Ссылка,
	               |	энргАбоненты.КлючПомещения КАК КлючПомещения
	               |ПОМЕСТИТЬ СпрАбонент
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	энргАбоненты.Ссылка = &Абонент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ГруппаПотребителей,
	               |	СпрАбонент.КлючПомещения КАК КлючПомещения,
	               |	энргГруппыПотребителейАбонентовСрезПоследних.Период КАК Период,
	               |	энргГруппыПотребителейАбонентовСрезПоследних.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РегистрГруппы
	               |ИЗ
	               |	СпрАбонент КАК СпрАбонент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И КлючПомещения В
	               |						(ВЫБРАТЬ
	               |							СпрАбонент.КлючПомещения КАК КлючПомещения
	               |						ИЗ
	               |							СпрАбонент КАК СпрАбонент)) КАК энргГруппыПотребителейАбонентовСрезПоследних
	               |		ПО СпрАбонент.КлючПомещения = энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегистрГруппы.ГруппаПотребителей КАК ГруппаПотребителей,
	               |	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	               |	энргЗначенияТарифовСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрГруппы КАК РегистрГруппы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	               |				&Период,
				   |				Организация = &Организация
				   |					И Район = &Район
				   |	) КАК энргЗначенияТарифовСрезПоследних
	               |		ПО РегистрГруппы.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегистрГруппы.ГруппаПотребителей,
	               |	энргЗначенияТарифовСрезПоследних.Услуга,
	               |	энргЗначенияТарифовСрезПоследних.Значение";
	Результат = Запрос.Выполнить();
	ВыгрузкаТарифы = Результат.Выгрузить();
	Тарифы.Загрузить(ВыгрузкаТарифы);
	

	КлючПомещения = ТекСтрока.КлючПомещения;//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "КлючПомещения");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Услуги,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПриборыУчетаАбонента,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлощадиАбонента,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КоличествоПрописанных,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТочкиУчета,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВидБлагоустройства,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтключаемыеВНеполивнойСезон,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеЛС,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КоличествоПроживающих,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Начисления,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(энргИсторияДоговоровАбонента,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Оплата,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Авансы,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспределениеПлатежей,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказанияПрибораУчетаИстория,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормулаРасчетаТУ,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
