#Область ОбработчикиСобытий

Функция СписокРайонов() Экспорт  
	Возврат ПараметрыСеанса.энргДоступныеРайоны;
КонецФункции


#КонецОбласти

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	Если Не ПравоДоступа("Чтение", Метаданные.Константы[ИмяКонстанты]) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Константы[ИмяКонстанты].Получить();
КонецФункции

#Область ВнешниеФункцииДляОтчетовСКД

Функция ПолучитьДанныеИзАдреса(Адрес, ТипИнф) Экспорт
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Адрес) Или Не ЗначениеЗаполнено(ТипИнф) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		СтрукАдреса = РаботаСАдресами.СведенияОбАдресе(Адрес);
		СтрукАдреса.Свойство(ТипИнф, Результат);
		
		Если Результат = Неопределено Тогда
			Помещения = Неопределено;
			Если СтрукАдреса.Свойство("Помещения", Помещения) И ТипЗнч(Помещения) = Тип("Массив") Тогда 
				Для каждого ТекПомещение Из Помещения Цикл
					ТипПомещения = Неопределено;
					Если ТекПомещение.Свойство("ТипПомещения", ТипПомещения) И ТипПомещения = ТипИнф Тогда
						Результат = ТекПомещение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Корпуса = Неопределено;
			Если СтрукАдреса.Свойство("Корпуса", Корпуса) И ТипЗнч(Корпуса) = Тип("Массив") Тогда 
				Для каждого ТекКорпус Из Корпуса Цикл
					ТипКорпуса = Неопределено;
					Если ТекКорпус.Свойство("ТипКорпуса", ТипКорпуса) И ТипКорпуса = ТипИнф Тогда
						Результат = ТекКорпус;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат.Свойство("Номер", Результат);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Результат;
КонецФункции


Функция ПолучитьДанныеИзАдресаКИ(Адрес, ТипИнф) Экспорт
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Адрес) Или Не ЗначениеЗаполнено(ТипИнф) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Адрес);
		
	Если СтруктураАдреса.Свойство("locality") И ТипИнф = "Город" Тогда 
		
		Результат = СтруктураАдреса.localityType + " " + СтруктураАдреса.locality;
		Возврат Результат;
		
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("cityType") И ТипИнф = "Город" Тогда 
		
		Результат = СтруктураАдреса.cityType + " " + СтруктураАдреса.city;
		Возврат Результат;
		
	КонецЕсли;

	Если СтруктураАдреса.Свойство("streetType") И ТипИнф = "Улица" Тогда
		
		Результат = СтруктураАдреса.streetType + " " + СтруктураАдреса.street;
		Возврат Результат;
		
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("houseType") И ТипИнф = "Дом" Тогда
		
		Результат = СтруктураАдреса.houseNumber;
		Возврат Результат;
		
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("buildings") И СтруктураАдреса.buildings.Количество() > 0 И ТипИнф = "Корпус" Тогда
		
		СтрокаПомещения  = СтруктураАдреса.buildings[0];		
		ПропускатьКорпус = СтрокаПомещения.type = "Корпус" и СтрНачинаетсяС(СтрокаПомещения.number, "/");
		
		Если НЕ ПропускатьКорпус Тогда
			
			Результат = СтрокаПомещения.number;
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("apartments") и СтруктураАдреса.apartments.Количество() > 0 И ТипИнф = "Квартира" Тогда
		
		СтрокаПомещения = СтруктураАдреса.apartments[0];
		Результат 		= НРег(Лев(СтрокаПомещения.type, 2)) + " " + СтрокаПомещения.number;
		Возврат Результат;
		
	КонецЕсли;	 
	
КонецФункции


#КонецОбласти