#Область ПрограммныйИнтерфейс

// Функция - Получить действующие точки учета
//
// Параметры:
//  Период					 - Дата 
//  Организация				 - СправочникСсылка.Организации 
//  Район					 - СправочникСсылка.энргЗоныОтвественности
//  Услуга					 - СправочникСсылка.энргВидыУслуг 
//  ГруппаОбъектовРасчета	 - СправочникСсылка.бестГруппыОбъектовРасчета
//  ОбъектРасчета			 - СправочникСсылка.бестОбъектыРасчета 
//  Контролер				 - СправочникСсылка.энргСотрудники 
//  Договор					 - СправочникСсылка.энргДоговорыКонтрагентов 
//  ЛС						 - СправочникСсылка.скэкЛицевыеСчетаЮЛ 
//  МВТ						 - МенеджерВременныхТаблиц 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьДействующиеТочкиУчета(Период,Организация,Район, Услуга = Неопределено, ГруппаОбъектовРасчета = Неопределено, ОбъектРасчета = Неопределено, Контролер = Неопределено, Договор = Неопределено, ЛС = Неопределено, МВТ = Неопределено) Экспорт 
	
	Запрос  		= Новый Запрос;
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета) КАК бестУслугиТочекУчетаНПСрезПоследних
	|		ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = бестУслугиТочекУчетаНПСрезПоследних.Организация
	|			И бестАктивностьТочекУчетаНПСрезПоследних.Район = бестУслугиТочекУчетаНПСрезПоследних.Район
	|			И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета.Контролер = &Контролер
	|	И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета.ГруппаОбъектовРасчета = &ГруппаОбъектовРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА АктивныеТочкиУчетаОбъекта.Услуга
	|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|	КОНЕЦ КАК Услуга
	|ПОМЕСТИТЬ ПростыеУслуги
	|ИЗ
	|	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета) КАК бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних
	|		ПО АктивныеТочкиУчетаОбъекта.ТочкаУчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ТочкаУчета
	|			И АктивныеТочкиУчетаОбъекта.ОбъектРасчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ОбъектРасчета
	|			И АктивныеТочкиУчетаОбъекта.Услуга = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Услуга
	|			И АктивныеТочкиУчетаОбъекта.Организация = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Организация
	|			И АктивныеТочкиУчетаОбъекта.Район = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО АктивныеТочкиУчетаОбъекта.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор,
	|	ПростыеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ПростыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	ПростыеУслуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ПростыеУслуги КАК ПростыеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета) КАК бестДоговорыТочекУчетаСрезПоследних
	|		ПО ПростыеУслуги.ТочкаУчета = бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета
	|			И ПростыеУслуги.ОбъектРасчета = бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ПростыеУслуги.Услуга = бестДоговорыТочекУчетаСрезПоследних.Услуга
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|	И ПростыеУслуги.Услуга = &Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Договор КАК Договор,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.Услуга КАК Услуга
	|ИЗ
	|	Итог КАК Итог";
	
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос.УстановитьПараметр("Договор",			Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга",			Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПростыеУслуги.Услуга = &Услуга", "ИСТИНА");
	КонецЕсли;

	Если ЗначениеЗаполнено(Контролер) Тогда
		Запрос.УстановитьПараметр("Контролер",			Контролер);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета.Контролер = &Контролер", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаОбъектовРасчета) Тогда
		Запрос.УстановитьПараметр("ГруппаОбъектовРасчета",			ГруппаОбъектовРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета.ГруппаОбъектовРасчета = &ГруппаОбъектовРасчета", "ИСТИНА");
	КонецЕсли;
	

	
	Возврат Запрос.Выполнить();
КонецФункции

// Процедура - Обновить группы потребителей услуги   
// Обновляет ТЧ ТарифныеКатегорииУслуги связанную с ТЧ ТочкиУчета
//
// Параметры:
//  ТекущийОбъект			 - ФормаКлиентскогоПриложения 
//  IDСтроки				 - УникальныйИдентификатор 
//  МКД						 - СправочникСсылка.энргСтроения 
//  НаименованиеРеквизитаID	 - Строка 
//
Процедура ОбновитьГруппыПотребителейУслуги(ТекущийОбъект, IDСтроки, МКД = Неопределено, НаименованиеРеквизитаID = "IDСтрокиВладельца") Экспорт
	
	МассивУслуг			= Новый Массив;
	МассивУслугДобавить = Новый Массив;
	МассивУслугУдалить	= Новый Массив;
	МассивТекУслуг		= Новый Массив;
	
	СтрокиВБ = ТекущийОбъект.Объект.ТарифныеКатегорииУслуги.НайтиСтроки(Новый Структура("IDСтроки",IDСтроки));
	Для Каждого СтрокаВБ Из СтрокиВБ Цикл
		Если МассивТекУслуг.Найти(СтрокаВБ.Услуга) = Неопределено Тогда
			МассивТекУслуг.Добавить(СтрокаВБ.Услуга);	
		КонецЕсли; 	
	КонецЦикла; 
	КоллекцияТУ = ТекущийОбъект.Объект.ТочкиУчета.НайтиСтроки(Новый Структура(НаименованиеРеквизитаID,IDСтроки));
	
	Для Каждого ТекУслуга Из КоллекцияТУ Цикл
		
		Если Не ЗначениеЗаполнено(ТекУслуга.Услуга) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТекУслуга.Услуга.СоставнаяУслуга Тогда
			Для Каждого СостУслуга Из ТекУслуга.Услуга.СоставляющиеУслуг Цикл
				Если МассивТекУслуг.Найти(СостУслуга.Услуга) = Неопределено И МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслугДобавить.Добавить(СостУслуга.Услуга);
					МассивУслуг.Добавить(СостУслуга.Услуга);
				ИначеЕсли МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслуг.Добавить(СостУслуга.Услуга);
				КонецЕсли	
			КонецЦикла;			
		Иначе
			Если МассивТекУслуг.Найти(ТекУслуга.Услуга) = Неопределено И МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслугДобавить.Добавить(ТекУслуга.Услуга);	
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			ИначеЕсли МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла; 
	
	
	Для Каждого ТекУслуга Из МассивТекУслуг Цикл
		Если МассивУслуг.Найти(ТекУслуга) = Неопределено Тогда
			МассивУслугУдалить.Добавить(ТекУслуга);	
		КонецЕсли; 	
	КонецЦикла; 
	
	
	Для Каждого ТекУслуга Из МассивУслугУдалить Цикл
		
		СтрокиГруппыПотребителей = ТекущийОбъект.Объект.ТарифныеКатегорииУслуги.НайтиСтроки(Новый Структура("Услуга,IDСтроки",ТекУслуга,IDСтроки));
		
		Для Каждого ТекСтрока Из СтрокиГруппыПотребителей Цикл
			ТекущийОбъект.Объект.ТарифныеКатегорииУслуги.Удалить(ТекСтрока);	
		КонецЦикла; 
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивУслугДобавить Цикл
		НоваяСтрока = ТекущийОбъект.Объект.ТарифныеКатегорииУслуги.Добавить();
		НоваяСтрока.Услуга				= ТекУслуга;
		
		Если IDСтроки <> Неопределено Тогда
			//НоваяСтрока.IDСтроки			= Новый УникальныйИдентификатор();
			НоваяСтрока.IDСтроки    = IDСтроки;	
		КонецЕсли;	
		
		Если МКД <> Неопределено Тогда
			СтрокаМКД = МКД.ВидыБлагоустройстваТарифныеКатегории.Найти(ТекУслуга, "Услуга");
			Если СтрокаМКД <> Неопределено Тогда
				НоваяСтрока.ВидБлагоустройства    = СтрокаМКД.ВидБлагоустройстваОбщедомовой;
				НоваяСтрока.ТарифнаяКатегория    = СтрокаМКД.ТарифнаяКатегория;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Получить данные для формы субабонентов
// Работа с формой субабонентов
//
// Параметры:
//  ПараметрыПередачи	 - Структура - Принимает объект "Субоненты".
//  Объект				 - ДокументОбъект - возвращает "Субоненты".
//
Процедура ПолучитьДанныеДляФормыСубабонентов(ПараметрыПередачи, Объект) Экспорт
	ПараметрыПередачи.Вставить("Субабоненты"	,ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Субабоненты.Выгрузить(Новый Структура("IDСтроки",ПараметрыПередачи.IDСтроки))));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучаемыеСвойстваТочекУчета() Экспорт
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение,Головная";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

Функция СоотвествиеРеквизитовСвойствамТочкиУчета() Экспорт
	Возврат Новый Структура("НаименованиеТочки,Расположение,Головная","Наименование","Расположение","Головная");
КонецФункции

#Область РаботаСТочкамиПоставки

Функция ПолучитьМассивТочекПоставки(ПараметрыЗапроса) Экспорт	
	
	Схема 			= Новый СхемаЗапроса;  	
	ПараметрыВТ 	= Новый Массив;
	Для каждого эл из ПараметрыЗапроса Цикл
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура(эл.Ключ, 	эл.Ключ), 	Неопределено));
	КонецЦикла;
	Параметры 	= Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", 	ПараметрыВТ);
	Параметры.Вставить("Период",  		Новый Структура("ИмяПараметра", "Период"));
	
	РегистрыСведений.бестТочкиПоставкиОбъектовРасчета.ТочкиПоставкиОбъектовРасчета(Схема,Параметры);
	
	Результат 	= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ТочкаПоставки");
КонецФункции

// Функция - Получить ТП по договору
//
// Параметры:
//  Период	 - Дата 
//  Договор	 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//  Массив - Массив элементов с типом СправочникСсылка.энргТочкиУчета 
//
Функция ПолучитьТППоДоговору(Период, Договор) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестДоговорыТочекУчетаСрезПоследних.Организация КАК Организация,
		|	бестДоговорыТочекУчетаСрезПоследних.Район КАК Район,
		|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ТУДоговоров
		|ИЗ
		|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(&Период, ) КАК бестДоговорыТочекУчетаСрезПоследних
		|ГДЕ
		|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
		|ИЗ
		|	РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
		|			&Период,
		|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
		|				(ВЫБРАТЬ
		|					ТУДоговоров.Организация КАК Организация,
		|					ТУДоговоров.Район КАК Район,
		|					ТУДоговоров.ОбъектРасчета КАК ОбъектРасчета,
		|					ТУДоговоров.ТочкаУчета КАК ТочкаУчета
		|				ИЗ
		|					ТУДоговоров КАК ТУДоговоров)) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТочкаПоставки");
КонецФункции

#КонецОбласти

#КонецОбласти