#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак наличия рассрочки абонента.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПризнакНаличияРассрочкиАбонента(Период, Организация, Район, МКД, Абонент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПризнакНаличияРассрочкиАбонента(); 
		
	Запрос.УстановитьПараметр("Период", Период); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("МКД", МКД);	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат	РезультатЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПризнакНаличияРассрочкиАбонента()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Период КАК Период,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Организация КАК Организация,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Район КАК Район,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.ПризнакРассрочкиЗадолженности КАК ПризнакРассрочкиЗадолженности
	|ИЗ
	|	РегистрСведений.энргПризнакНаличияРассрочкиАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПризнакНаличияРассрочкиАбонентаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции   

#КонецОбласти

#КонецЕсли