#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает текущее значение филиала.
//
// Параметры:
//  Организация	 - 	СправочникСсылка.Организации.
//  Район		 - 	СправочникСсылка.энргЗоныОтвественности.
//  Строение	 - 	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргФилиалы.
//
Функция ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргФилиалыСтроений.ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ПолучитьТекущееЗначениеФилиала";
		ПараметрыМетода 			= Новый Структура("Организация, Район, Строение", Организация, Район, Строение);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;  		
	
	
КонецФункции

// Возвращает Филиалы района.
//
// Параметры:
//  Район	-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргФилиалы.
//
Функция ФилиалыРайона(Район) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ФилиалыРайона(Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргЗоныОтвественности.ФилиалыРайона(Район);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ФилиалыРайона";
		ПараметрыМетода 			= Новый Структура("Район", Район);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список филиалов по организации району стронию абоненту.
//
// Параметры:
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Строение	-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
//  Период		-	Дата.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргФилиалы.
//
Функция СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту(Организация, Район, Строение, Абонент, Период = '0001-01-01') Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту(Организация, Район, Строение, Абонент, Период);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Новый СписокЗначений;
	
	Если НЕ Абонент = Неопределено И ЗначениеЗаполнено(Абонент) Тогда
		ФилиалАбонента				= ФилиалАбонента(Абонент,Период);
		Результат.Добавить(ФилиалАбонента);
	ИначеЕсли Не Организация = Неопределено и ЗначениеЗаполнено(Организация)
		И Не Район = Неопределено и ЗначениеЗаполнено(Район)
		И Не Строение = Неопределено и ЗначениеЗаполнено(Строение) Тогда
		ФилиалСтроения 				= ПолучитьТекущееЗначениеФилиала(Организация,Район,Строение);
		Результат.Добавить(ФилиалСтроения);
	Иначе
		ПараметрыЗапроса 			= Новый Структура;
		Схема 						= Неопределено;
		ПараметрыСхемы 				= Новый Структура;
		Если НЕ Период = Неопределено Тогда
			ПараметрыСхемы.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
			ПараметрыЗапроса.Вставить("Период", Период);
		КонецЕсли;
		СоотвествиеПолей 			= Новый Структура;
		
		Если НЕ Организация = Неопределено Тогда
			СоотвествиеПолей.Вставить("Организация", "Организация");
			ПараметрыЗапроса.Вставить("Организация", Организация);
		КонецЕсли;
		
		Если НЕ Район = Неопределено Тогда
			СоотвествиеПолей.Вставить("Район", "Район");
			ПараметрыЗапроса.Вставить("Район", Район);
		КонецЕсли;
		
		Если НЕ Строение = Неопределено Тогда
			СоотвествиеПолей.Вставить("Строение", "Строение");
			ПараметрыЗапроса.Вставить("Строение", Строение);
		КонецЕсли;
		
		ПараметрыВТ  				= Новый Массив;
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
		ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
		
		РегистрыСведений.энргФилиалыСтроений.ЗаполнитьСхемуФилиалыСтроение(Схема,ПараметрыСхемы,"");
		
		РезультатЗапроса  			= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
		Выборка 					= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Филиал);
		КонецЦикла;		
	КонецЕсли;
	
	Если НЕ Результат.Количество() = 0 И Не Район = Неопределено и ЗначениеЗаполнено(Район) Тогда
		Результат 	 				= Обработки.энргЗоныОтвественностиМенеджер.ФилиалыРайона(Район);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту";
		ПараметрыМетода 			= Новый Структура("Организация, Район, Строение, Абонент, Период", Организация, Район, Строение, Абонент, Период);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает Филиал абонента.
//
// Параметры:
//  Абонент	-	СправочникСсылка.энргАбоненты.
//  Период	-	Дата.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргФилиалы.
//
Функция ФилиалАбонента(Абонент, Период = '0001-01-01') Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ФилиалАбонента(Абонент,Период);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  = РегистрыСведений.энргФилиалыАбонентов.ПолучитьПоследнее(Период,Новый Структура("Абонент",Абонент)).Филиал;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ФилиалАбонента";
		ПараметрыМетода 			= Новый Структура("Абонент,Период", Абонент,Период);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли