
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргАбоненты(ЭтотОбъект);
	Параметры.Свойство("СтрокаНачальногоПоиска", СтрокаНачальногоПоиска);
	
	УстановитьОтборСпискаСервер();
	 	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура СтрокаНачальногоПоискаПриИзменении(Элемент)
	УстановитьОтборСпискаСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементаФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЗакрытьФорму(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьФорму(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьФорму(ТекДанные)
	Если ТекДанные <> Неопределено Тогда
		Закрыть(ТекДанные);
	Иначе
		Закрыть(ТекДанные);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УдалосьВыполнитьПолнотекстовыйПоиск(СписокАбонентов)
	
	МаксимальноеКоличествоЭлементовПоиска 		= 50;
	
	Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда		
		Возврат Ложь;
	КонецЕсли; 	
	
	яПолнотекстовыйПоиск 						= ПолнотекстовыйПоиск.СоздатьСписок(СтрокаНачальногоПоиска);
	ОбластьПоиска 								= Новый Массив;
	ОбластьПоиска.Добавить(Метаданные.Справочники.энргАбоненты);		
	яПолнотекстовыйПоиск.ОбластьПоиска 			= ОбластьПоиска;
	яПолнотекстовыйПоиск.ПолучатьПредставление 	= Ложь;
	яПолнотекстовыйПоиск.ПолучатьОписание 		= Ложь;
	Попытка
		яПолнотекстовыйПоиск.ПерваяЧасть();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если яПолнотекстовыйПоиск.СлишкомМногоРезультатов() Тогда
		КодОшибки 								= "СлишкомМногоРезультатов";
		Возврат Ложь;
	КонецЕсли;		
	
	КоличествоРезультатов 						= яПолнотекстовыйПоиск.ПолноеКоличество();
	
	Если КоличествоРезультатов = 0 Тогда
		КодОшибки 								= "НичегоНеНайдено";
		Возврат Ложь;
	КонецЕсли;
	
	Если КоличествоРезультатов > МаксимальноеКоличествоЭлементовПоиска Тогда
		КодОшибки 								= "СлишкомМногоРезультатов";
		Возврат Ложь;
	КонецЕсли;
	
	мСписокСсылок 								= Новый СписокЗначений;
	Для Каждого НайденныйЭлемент Из яПолнотекстовыйПоиск Цикл
		мСписокСсылок.Добавить(НайденныйЭлемент.Значение);
	КонецЦикла;	
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборСпискаСервер()
	
	СписокАбонентов 				= Новый СписокЗначений;
	ПоискВыполнен 					= Ложь;
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда		
		Если УдалосьВыполнитьПолнотекстовыйПоиск(СписокАбонентов) Тогда
			ПоискВыполнен 			= Истина;
		КонецЕсли;		
		 // ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",мСписокСсылок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	 КонецЕсли;
	 
	 Если Не ПоискВыполнен И Не ПустаяСтрока(СтрокаНачальногоПоиска) Тогда
		 мАбоненты 					= Обработки.энргАбонентыМенеджер.МассивСсылокПолноТекствогоПоиска(СтрокаНачальногоПоиска);
		 СписокАбонентов.ЗагрузитьЗначения(мАбоненты);
	 КонецЕсли;
	 
	 Если Не СписокАбонентов.Количество() = 0 Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокАбонентов,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	 Иначе
		 ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Ссылка"); 
	 КонецЕсли;
 КонецПроцедуры
 
#КонецОбласти


