#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПросроченныеЗадачи(Организация = Неопределено, Абонент = Неопределено, Контрагент = Неопределено, Договор = Неопределено) Экспорт 
	// Отбираем обращения с сроком окончания этапа меньше текущей даты и при этом не берем в расчет заявки со статусом "ЗакрытиеОбращения"
	// У каждого регистратора должна быть запись со следующим этапом с записью в измерении "Обращение"
	// Если такой записи нет то задача просрочена
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЭтапыОбращений.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ОбращенияСрокМеньшеТекующейДаты
		|ИЗ
		|	РегистрСведений.бестЭтапыОбращений КАК бестЭтапыОбращений
		|ГДЕ
		|	бестЭтапыОбращений.СрокОкончанияЭтапа < &Дата
		|	И бестЭтапыОбращений.Этап <> &ЭтапЗакрытия
		|	И бестЭтапыОбращений.Организация = &Организация
		|	И бестЭтапыОбращений.Абонент = &Абонент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЭтапыОбращенийЮрЛиц.Регистратор
		|ИЗ
		|	РегистрСведений.бестЭтапыОбращенийЮрЛиц КАК бестЭтапыОбращенийЮрЛиц
		|ГДЕ
		|	бестЭтапыОбращенийЮрЛиц.СрокОкончанияЭтапа < &Дата
		|	И бестЭтапыОбращенийЮрЛиц.Этап <> &ЭтапЗакрытия
		|	И бестЭтапыОбращенийЮрЛиц.Организация = &Организация
		|	И бестЭтапыОбращенийЮрЛиц.Контрагент = &Контрагент
		|	И бестЭтапыОбращенийЮрЛиц.Договор = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ЗакрытыеОбращения
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЭтапыОбращений КАК бестЭтапыОбращений
		|		ПО ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор = бестЭтапыОбращений.Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЭтапыОбращенийЮрЛиц КАК бестЭтапыОбращенийЮрЛиц
		|		ПО ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор = бестЭтапыОбращенийЮрЛиц.Обращение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор КАК Регистратор
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|ГДЕ
		|	НЕ ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор В
		|				(ВЫБРАТЬ
		|					ВТ_ЗакрытыеОбращения.Регистратор КАК Регистратор
		|				ИЗ
		|					ВТ_ЗакрытыеОбращения КАК ВТ_ЗакрытыеОбращения)";
	
	Запрос.УстановитьПараметр("Дата"			, ТекущаяДата());
	Запрос.УстановитьПараметр("ЭтапЗакрытия"	, Справочники.бестЭтапыОбращений.ЭтапОбращений_ЗакрытиеОбращения);
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращений.Организация = &Организация","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Организация = &Организация","");
	Иначе 
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если Абонент = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращений.Абонент = &Абонент","");		
	Иначе 
		Запрос.УстановитьПараметр("Абонент", Абонент);
	КонецЕсли;
	
	Если Контрагент = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Контрагент = &Контрагент","");
	Иначе 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	
	Если Договор = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Договор = &Договор","");
	Иначе 
		Запрос.УстановитьПараметр("Договор", Договор);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли