
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Запись);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Запись);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;
	
	УстановитьПараметрыВыбораВладелецФайла();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьНастройкиДляВидаОперации(Истина);
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ВладелецФайлаПриИзменении(Элемент)
	УстановитьНастройкиДляВидаОперации();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды

&НаСервере
Функция ВладельцыПрисоединенныхФайлов()	
	Возврат энргРаботаСПрикрепленнымиФайламиСервер.ВладельцыПрисоединенныхФайлов();
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораВладелецФайла()
	НовыйПараметр 							= Новый ПараметрВыбора("Отбор.Ссылка", ВладельцыПрисоединенныхФайлов());
	НовыйМассив 							= Новый Массив;
	НовыйМассив.Добавить(НовыйПараметр);
	ПараметрыВыбора 						= Новый ФиксированныйМассив(НовыйМассив);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВладелецФайла", "ПараметрыВыбора", ПараметрыВыбора);
КонецПроцедуры



&НаСервере
Процедура УстановитьНастройкиДляВидаОперации(ПроверятьВидОперации = Ложь)
	СтруктураВидаОперации = энргРаботаСПрикрепленнымиФайламиСервер.ПолучитьСтруктуруВидаОперации(Запись.ВладелецФайла);
	Если ПроверятьВидОперации и ЗначениеЗаполнено(Запись.ВидОперации) Тогда
		СтруктураВидаОперации.ВидОперации = Запись.ВидОперации;
	КонецЕсли;	
	УстановитьПараметрыВыбораВидаОперации(СтруктураВидаОперации);
	ПривестиКТипуВидаОперации(СтруктураВидаОперации);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораВидаОперации(СтруктураВидаОперации)
	НовыйМассив = Новый Массив;
	Если СтруктураВидаОперации.УстанавливатьПараметрыВыбора Тогда
		НовыйПараметр 							= Новый ПараметрВыбора("Отбор.Ссылка", СтруктураВидаОперации.ПараметрыВыбораВидОперации);		
		НовыйМассив.Добавить(НовыйПараметр);
		ПараметрыВыбора 						= Новый ФиксированныйМассив(НовыйМассив);
	Иначе 
		ПараметрыВыбора							= Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидОперации", "ПараметрыВыбора", ПараметрыВыбора);
КонецПроцедуры

&НаСервере
Процедура ПривестиКТипуВидаОперации(СтруктураВидаОперации)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидОперации", "ОграничениеТипа"	, Новый ОписаниеТипов(СтруктураВидаОперации.ТипВидаОперации));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидОперации", "ВыбиратьТип"		, Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидОперации", "Доступность"		, СтруктураВидаОперации.ФлагДоступностиВидаОперации);
	Запись.ВидОперации = СтруктураВидаОперации.ВидОперации; 
КонецПроцедуры

#КонецОбласти

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Запись");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;
	
	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Запись");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

#КонецОбласти


