#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая) ;
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	ДублиУслуги = ПроверитьУслугиВТЧ();
	
	Если ДублиУслуги Тогда
		Отказ			= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наличие одинаковых услуг. Выберите другую");
	КонецЕсли;
	ДублиУслуги = ПроверитьУслугиВТЧ();
	
	ДанныеШапки = ДанныеШапки();
	
	бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки,Движения.бестНагрузкаПоУслугамНП,"Нагрузки");  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Для Каждого СтрТЧ из Нагрузки Цикл 
		СтрТЧ.ВидНагрузки = Неопределено;
		СтрТЧ.Нагрузка = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ОбъектРасчета",			ОбъектРасчета);
	ДанныеШапки.Вставить("Нагрузки",				Нагрузки);	

	Возврат ДанныеШапки;
КонецФункции

Функция ПроверитьУслугиВТЧ()
	
	Запрос = Новый  Запрос; 
	Запрос.Текст ="ВЫБРАТЬ
	              |	КОЛИЧЕСТВО(бестУстановитьНагрузкуПоУслугамНагрузки.Услуга) КАК Количество,
	              |	бестУстановитьНагрузкуПоУслугамНагрузки.Услуга КАК Услуга
	              |ИЗ
	              |	Документ.бестУстановитьНагрузкуПоУслугам.Нагрузки КАК бестУстановитьНагрузкуПоУслугамНагрузки
	              |ГДЕ
	              |	бестУстановитьНагрузкуПоУслугамНагрузки.Ссылка = &Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	бестУстановитьНагрузкуПоУслугамНагрузки.Услуга";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();   
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НаличиеДублей=Ложь;
	ТекУслуга = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ТекУслуга = ВыборкаДетальныеЗаписи.Услуга  Тогда 
			Если ВыборкаДетальныеЗаписи.Количество > 1 Тогда
				НаличиеДублей = Истина;
			КонецЕсли;
		КонецЕсли;
		ТекУслуга = ВыборкаДетальныеЗаписи.Услуга;
	КонецЦикла;
	Возврат НаличиеДублей;
				  
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли