#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргУстановитьТочкиПоставкиНаТочкиУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргУстановитьТочкиПоставкиНаТочкиУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргУстановитьТочкиПоставкиНаТочкиУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргУстановитьТочкиПоставкиНаТочкиУчета");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаТочкиПоставкиТочекУчетаСтроений(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргТочкиПоставкиТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Дата КАК Период,
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Район КАК Район,
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Организация КАК Организация,
	|	энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.ТочкаУчета КАК ТочкаУчета,
	|	энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	Документ.энргУстановитьТочкиПоставкиНаТочкиУчета.ТочкиПоставки КАК энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьТочкиПоставкиНаТочкиУчета КАК энргУстановитьТочкиПоставкиНаТочкиУчета
	|		ПО энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.Ссылка = энргУстановитьТочкиПоставкиНаТочкиУчета.Ссылка
	|ГДЕ
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Ссылка В(&мДокументы)
	|	И энргУстановитьТочкиПоставкиНаТочкиУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТочкиПоставкиТочекУчетаСтроений(Схема, Регистры)
	
	ИмяРегистра = "энргТочкиПоставкиТочекУчетаСтроений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Дата КАК Период,
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Район КАК Район,
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Организация КАК Организация,
	|	энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.ТочкаУчета КАК ТочкаУчета,
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.МКД КАК Строение
	|ИЗ
	|	Документ.энргУстановитьТочкиПоставкиНаТочкиУчета.ТочкиПоставки КАК энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьТочкиПоставкиНаТочкиУчета КАК энргУстановитьТочкиПоставкиНаТочкиУчета
	|		ПО энргУстановитьТочкиПоставкиНаТочкиУчетаТочкиПоставки.Ссылка = энргУстановитьТочкиПоставкиНаТочкиУчета.Ссылка
	|ГДЕ
	|	энргУстановитьТочкиПоставкиНаТочкиУчета.Ссылка В(&мДокументы)
	|	И энргУстановитьТочкиПоставкиНаТочкиУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли