
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("НеПересчитыватьСумму") Тогда
		РегистрыНакопления.энргОбъемНачислений.УдалитьНеЗначащиеЗаписи(ЭтотОбъект);
		// Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если ДополнительныеСвойства.Свойство("ТекИндексСтрокиНабора") Тогда 
			ТекИндексСтрокиНабора	= ДополнительныеСвойства.ТекИндексСтрокиНабора;
		Иначе 
			ТекИндексСтрокиНабора	= 0;
		КонецЕсли;
		
		Для Сч = ТекИндексСтрокиНабора По ЭтотОбъект.Количество() -1 Цикл		
		
			СтрокаНабора = ЭтотОбъект[Сч];
			
			Если СтрокаНабора.СпособНачисления = Перечисления.энргСпособНачислений.Расчетный 
				Или СтрокаНабора.СпособНачисления = Перечисления.энргСпособНачислений.КорректировкаСезонныхУслуг Тогда
				Продолжить;
			КонецЕсли;
			
			РегистрыНакопления.энргОбъемНачислений.РассчитатьСуммы(СтрокаНабора);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДанныеНабораДоЗаписи") Тогда
		
		Для Каждого СтрокаНабораДоЗаписи Из ДополнительныеСвойства.ДанныеНабораДоЗаписи Цикл
			СтрокаНабора  									= ЭтотОбъект.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНабораДоЗаписи);
			СтрокаНабора.ОбъемУслуги 						= -СтрокаНабора.ОбъемУслуги;
			СтрокаНабора.ОбъемУслугиПотери 					= -СтрокаНабора.ОбъемУслугиПотери;
			СтрокаНабора.ОбъемУслугиПотребленный 			= -СтрокаНабора.ОбъемУслугиПотребленный;
			СтрокаНабора.ОбъемУслугиПотребленныйПотери 		= -СтрокаНабора.ОбъемУслугиПотребленныйПотери;
			СтрокаНабора.ОбъемУслугиПотребленныйСоцНорма 	= -СтрокаНабора.ОбъемУслугиПотребленныйСоцНорма;
			СтрокаНабора.ОбъемУслугиСоцНорма 				= -СтрокаНабора.ОбъемУслугиСоцНорма;
			СтрокаНабора.Сумма 								= -СтрокаНабора.Сумма;
			СтрокаНабора.СуммаПоПовышенномуКоэффициенту 	= -СтрокаНабора.СуммаПоПовышенномуКоэффициенту;
			СтрокаНабора.СуммаСниженияСтоимости 			= -СтрокаНабора.СуммаСниженияСтоимости;
			СтрокаНабора.ЭтоСторно							= Истина;
			СтрокаНабора.НомерСторнируемойСтроки			= СтрокаНабораДоЗаписи.НомерСтроки;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргОбъемНачислений","ДанныеНабора","",Истина,Истина) + ",
		|	ДанныеНабора.ЭтоСторно КАК ЭтоСторно
		|ПОМЕСТИТЬ ОбщиеДанные
		|ИЗ
		|	&ДанныеНабора КАК ДанныеНабора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргОбъемНачислений.Организация КАК Организация,
		|	энргОбъемНачислений.Район КАК Район,
		|	энргОбъемНачислений.Распределение КАК Распределение,
		|	энргОбъемНачислений.Строение КАК Строение,
		|	энргОбъемНачислений.Помещение КАК Помещение,
		|	энргОбъемНачислений.Абонент КАК Абонент,
		|	энргОбъемНачислений.Услуга КАК Услуга,
		|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
		|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
		|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
		|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	энргОбъемНачислений.Измеритель КАК Измеритель,
		|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
		|	энргОбъемНачислений.Шкала КАК Шкала,
		|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
		|	энргОбъемНачислений.Поставщик КАК Поставщик,
		|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
		|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
		|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
		|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
		|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
		|	энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
		|	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиПотребленныйСоцНорма) КАК ОбъемУслугиПотребленныйСоцНорма,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиСоцНорма) КАК ОбъемУслугиСоцНорма,
		|	СУММА(энргОбъемНачислений.Сумма) КАК Сумма,
		|	СУММА(энргОбъемНачислений.СуммаПоПовышенномуКоэффициенту) КАК СуммаПоПовышенномуКоэффициенту,
		|	СУММА(энргОбъемНачислений.СуммаСниженияСтоимости) КАК СуммаСниженияСтоимости,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.ЭтоСторно) КАК ЭтоСторно
		|ИЗ
		|	ОбщиеДанные КАК энргОбъемНачислений
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.Организация,
		|	энргОбъемНачислений.Район,
		|	энргОбъемНачислений.Распределение,
		|	энргОбъемНачислений.Строение,
		|	энргОбъемНачислений.Помещение,
		|	энргОбъемНачислений.Абонент,
		|	энргОбъемНачислений.Услуга,
		|	энргОбъемНачислений.ТочкаУчета,
		|	энргОбъемНачислений.ВидНачисления,
		|	энргОбъемНачислений.СпособНачисления,
		|	энргОбъемНачислений.НаправлениеИспользованияТУ,
		|	энргОбъемНачислений.Измеритель,
		|	энргОбъемНачислений.ПриборУчета,
		|	энргОбъемНачислений.Шкала,
		|	энргОбъемНачислений.ТарифнаяЗона,
		|	энргОбъемНачислений.ЗначениеТарифа,
		|	энргОбъемНачислений.Поставщик,
		|	энргОбъемНачислений.ПериодРасчета,
		|	энргОбъемНачислений.ПериодНачисления,
		|	энргОбъемНачислений.ЧастныйСектор,
		|	энргОбъемНачислений.СверхНорматива,
		|	энргОбъемНачислений.НеПрименятьСезонность,
		|	энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
		|
		|ИМЕЮЩИЕ
		|	(СУММА(энргОбъемНачислений.ОбъемУслуги) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.ОбъемУслугиПотери) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.ОбъемУслугиПотребленный) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.ОбъемУслугиПотребленныйПотери) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.ОбъемУслугиПотребленныйСоцНорма) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.ОбъемУслугиСоцНорма) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.Сумма) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.СуммаПоПовышенномуКоэффициенту) <> 0
		|		ИЛИ СУММА(энргОбъемНачислений.СуммаСниженияСтоимости) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.ЭтоСторно) = 1)";
		
		Запрос.УстановитьПараметр("ДанныеНабора", ЭтотОбъект.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			ЭтотОбъект.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	ДобавитьОтложенныеДвижения(Регистратор);
	
	Если ЭтотОбъект.Количество() > 0 Тогда		
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
			
	Если ДополнительныеСвойства.Свойство("НаборыЗаписей") Тогда
		энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Замещение);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НаборТочкиУчетаСНулевымРасходом") Тогда
		НаборТочкиУчетаСНулевымРасходом = ДополнительныеСвойства.НаборТочкиУчетаСНулевымРасходом;
		НаборТочкиУчетаСНулевымРасходом.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	ЭтоИндивидульныйРасчет = ДополнительныеСвойства.Свойство("ДанныеНабораДоЗаписи");
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("Организация") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("МКД") Тогда 
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("МКД", Регистратор.Метаданные())  Тогда
			ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
		Иначе
			ДополнительныеСвойства.Вставить("МКД", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Строение") Тогда
		ДополнительныеСвойства.Вставить("Строение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Помещение") Тогда
		ДополнительныеСвойства.Вставить("Помещение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЧастныйСектор") Тогда
		ДополнительныеСвойства.Вставить("ЧастныйСектор", Ложь);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Район") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Район", Регистратор.Метаданные()) Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	КонецЕсли;
			
	НаборыЗаписей  						= Новый Структура;
	
	РазделыЗаписи 						= Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление") Тогда
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.СтабильныеПериоды, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
		
		НаборНачисленныйСреднийОбъем		= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
		НаборНачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НаборНачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 		НаборНачисленныйСреднийОбъем);
		
		Если НЕ ЭтоИндивидульныйРасчет Тогда
			
			ПериодНачисленияОтборТУ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ДополнительныеСвойства, 
				"ПериодНачисления",
				НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора));
			
			НаборТочкиУчетаСНулевымРасходом	= РегистрыСведений.энргТочкиУчетаСНулевымРасходом.СоздатьНаборЗаписей();
			НаборТочкиУчетаСНулевымРасходом.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборТочкиУчетаСНулевымРасходом.Отбор.Организация.Установить(ДополнительныеСвойства.Организация);			
			НаборТочкиУчетаСНулевымРасходом.Отбор.ПериодНачисления.Установить(ПериодНачисленияОтборТУ);
			НаборТочкиУчетаСНулевымРасходом.Отбор.Район.Установить(ДополнительныеСвойства.Район);
			НаборТочкиУчетаСНулевымРасходом.Отбор.ДокРегистратор.Установить(Регистратор);
			ДополнительныеСвойства.Вставить("НаборТочкиУчетаСНулевымРасходом", НаборТочкиУчетаСНулевымРасходом);
			
		КонецЕсли;
		
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРаспределениеМКД") или  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргДополнительныеНачисления") Тогда
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПерерасчет") Тогда 
		Если Регистратор.ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет  Тогда
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));			
			Если ДополнительныеСвойства.Свойство("НаборНачисленныйСредний") Тогда
				НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 	ДополнительныеСвойства.НаборНачисленныйСредний);
				ДополнительныеСвойства.Вставить("НачисленныйСреднийПрочитан" , Истина);
			Иначе
				НаборНачисленныйСреднийОбъем	= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
				НаборНачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
				НаборНачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
				НаборыЗаписей.Вставить("НаборНачисленныйСредний", 		НаборНачисленныйСреднийОбъем);
			КонецЕсли;
		ИначеЕсли   Регистратор.ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг Тогда
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));			
			нНаборВзаиморасчеты 						= РегистрыНакопления.энргВзаиморасчетыПоМесяцам.СоздатьНаборЗаписей();
			нНаборВзаиморасчеты.Отбор.Регистратор.установить(Регистратор);
			нНаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
			НаборыЗаписей.Вставить("энргВзаиморасчетыПоМесяцам", 		нНаборВзаиморасчеты);
	
		ИначеЕсли Регистратор.ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета Тогда
			НаборНачисленныйСреднийОбъем		= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
			НаборНачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
			НаборНачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);
			Если ДополнительныеСвойства.Свойство("НаборНачисленныйСредний") Тогда
				тзНаборНачисленныйСредний 			= ДополнительныеСвойства.НаборНачисленныйСредний.Выгрузить();			
				НаборНачисленныйСреднийОбъем.Загрузить(тзНаборНачисленныйСредний);
			КонецЕсли;
			НаборНачисленныйСреднийОбъем.УстановитьАктивность(Истина);
			НаборыЗаписей.Вставить("НаборНачисленныйСредний", 		НаборНачисленныйСреднийОбъем);
			ДополнительныеСвойства.Вставить("НачисленныйСреднийПрочитан" , Истина);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	  
	
	НаборВзаиморасчеты 						= РегистрыНакопления.энргВзаиморасчеты.СоздатьНаборЗаписей();
	НаборВзаиморасчеты.Отбор.Регистратор.установить(Регистратор);
	НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
	НаборыЗаписей.Вставить("энргВзаиморасчеты", 		НаборВзаиморасчеты);
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("МассивКлючейПомещений") Тогда
		Если РазделыЗаписи.Количество() > 0 Тогда
			НаборОтложенныеДвижения 			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);	
			НаборОтложенныеДвижения.ДополнительныеСвойства.Вставить("ЗамещатьОтложенныеДвижения", Истина);
			НаборыЗаписей.Вставить("энргОтложенныеДвиженияДокументов", 		НаборОтложенныеДвижения);
		КонецЕсли;
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НаборВзаиморасчеты, НачисленныйСредний, нНаборВзаиморасчеты, НаборТочкиУчетаСНулевымРасходом;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
	
	ЕстьНачисленныйСредний 									= Ложь; 
	Если НЕ НаборыЗаписей.Свойство("энргВзаиморасчеты", НаборВзаиморасчеты) Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборыЗаписей.Свойство("энргНачисленныйСреднийОбъем", НачисленныйСредний) Тогда
		ЕстьНачисленныйСредний 								= Истина;
	КонецЕсли;   	
	
	
	Если НаборыЗаписей.Свойство("энргВзаиморасчетыПоМесяцам", нНаборВзаиморасчеты) Тогда
		ЗаписьВоВзаиморасчеты 								= Истина;
	иначе 
		ЗаписьВоВзаиморасчеты 								= Ложь;
	КонецЕсли; 	
	
	Результат = ДанныеВзаиморасчеты(Регистратор); 		
	РезультатВзаиморасчеты = Результат.Выбрать();
	Пока РезультатВзаиморасчеты.Следующий() Цикл
		Запись = НаборВзаиморасчеты.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Запись, РезультатВзаиморасчеты);
	КонецЦикла; 	
	
	Если ЗаписьВоВзаиморасчеты Тогда 
		
		//Результат = ДанныеВзаиморасчеты(Регистратор);
		ДокОбъект = Регистратор.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		//РезультатВзаиморасчеты 									= Результат.Выбрать();
		
		РезультатВзаиморасчеты.Сбросить();
		Пока РезультатВзаиморасчеты.Следующий() Цикл
			СтрокаНачислений = ДокОбъект.Движения.энргОбъемНачислений.Добавить();
	        ЗаполнитьЗначенияСвойств(СтрокаНачислений, РезультатВзаиморасчеты);
 		КонецЦикла;	
		ДокОбъект.записать(РежимЗаписиДокумента.Запись);
		
 	КонецЕсли;	
	
	Если ЕстьНачисленныйСредний тогда
		НачисленныйСреднийПрочитан 							= Ложь;
		Если ДополнительныеСвойства.Свойство("НачисленныйСреднийПрочитан") Тогда
			НачисленныйСреднийПрочитан						= ДополнительныеСвойства.НачисленныйСреднийПрочитан;
		КонецЕсли; 		
		Если НЕ НачисленныйСреднийПрочитан Тогда			
			РезультатНачисленныйСредний 					= РегистрыНакопления.энргОбъемНачислений.РезультатНачисленныйСреднийОбъем(ДополнительныеСвойства.ОтложенныеНачисленияПоПриборам.Выгрузить()); ;
			ВыборкаНачисленныйСредний 						= РезультатНачисленныйСредний.Выбрать();
			Пока ВыборкаНачисленныйСредний.Следующий() Цикл
				Запись										= НачисленныйСредний.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Запись,ВыборкаНачисленныйСредний);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("НаборТочкиУчетаСНулевымРасходом", НаборТочкиУчетаСНулевымРасходом) Тогда
				
		РезультатЗапроса = РезультатТочкиУчетаСНулевымРасходом(Регистратор); 		
		ВыборкаДобавить = РезультатЗапроса.Выгрузить();
		НаборТочкиУчетаСНулевымРасходом.Загрузить(ВыборкаДобавить);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 						= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("энргОтложенныеДвиженияДокументов", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("МассивКлючейПомещений") и ЭтотОбъект.ДополнительныеСвойства.МассивКлючейПомещений <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Или ЭтотОбъект.ДополнительныеСвойства.Помещение <> Неопределено Тогда
		РазделыЗаписи 					= ДополнительныеСвойства.РазделыЗаписи;
		
		Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	    
			Если СтрокаРаздела.Раздел = Перечисления.энргРазделыЗаписи.СтабильныеПериоды Или НЕ ДополнительныеСвойства.Свойство("Организации") Тогда
				ДобавитьСтрокуОтложенногоДвижения(НаборОтложенныеДвижения, Регистратор, СтрокаРаздела, ДополнительныеСвойства.Организация);
			Иначе
				Для Каждого ТекОрганизация Из ДополнительныеСвойства.Организации Цикл
					ДобавитьСтрокуОтложенногоДвижения(НаборОтложенныеДвижения, Регистратор, СтрокаРаздела, ТекОрганизация);	
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтрокуОтложенногоДвижения(НаборОтложенныеДвижения, Регистратор, СтрокаРаздела, ТекОрганизация)
	НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
	НоваяЗапись.Организация		 	= ТекОрганизация;
	НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
	НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
	НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
	НоваяЗапись.ДокРегистратор 		= Регистратор;
	НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;
	НоваяЗапись.Строение 			= ДополнительныеСвойства.МКД;
	НоваяЗапись.ЧастныйСектор		= ДополнительныеСвойства.ЧастныйСектор;		
КонецПроцедуры

Функция ДанныеВзаиморасчеты(Регистратор)
	
	тзНаборЗаписей 						= ЭтотОбъект.Выгрузить();
	
	ДополнительныеСвойства.Вставить("тзНаборЗаписей", тзНаборЗаписей);
			
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	Запрос 								= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Набор", 				тзНаборЗаписей);
	Запрос.УстановитьПараметр("Регистратор", 		Регистратор);
	Запрос.УстановитьПараметр("Дата", 				ДополнительныеСвойства.ДатаРегистратора);
	Запрос.УстановитьПараметр("ПериодНачисления",	НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора));
	Запрос.УстановитьПараметр("Организация", 		ДополнительныеСвойства.Организация);
	Запрос.УстановитьПараметр("МКД",				ДополнительныеСвойства.МКД);
	Запрос.УстановитьПараметр("Район", 				ДополнительныеСвойства.Район);
	Запрос.Текст 					= 	
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА Набор.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ Набор.Строение
	|	КОНЕЦ КАК МКД,
	|	Набор.Организация КАК Организация,
	|	Набор.Район КАК Район,
	|	Набор.СпособНачисления КАК СпособНачисления,
	|	Набор.Абонент КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ОбъемУслуги КАК ОбъемУслуги,
	|	Набор.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	Набор.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	Набор.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	Набор.Сумма КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	ИСТИНА КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&Набор КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(ОбъемНачислений.Сумма) КАК Сумма,
	|	СУММА(ОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
	|	МАКСИМУМ(ОбъемНачислений.Организация) КАК Организация,
	|	МАКСИМУМ(ОбъемНачислений.Период) КАК Период,
	|	МАКСИМУМ(ОбъемНачислений.ПериодНачисления) КАК ПериодНачисления,
	|	МАКСИМУМ(ОбъемНачислений.МКД) КАК МКД,
	|	МАКСИМУМ(ОбъемНачислений.Район) КАК Район,
	|	МАКСИМУМ(ОбъемНачислений.Поставщик) КАК Поставщик,
	|	ОбъемНачислений.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.Услуга,
	|	ОбъемНачислений.ИзменятьВзаиморасчеты
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ОбъемНачислений.Сумма) <> 0
	|		ИЛИ ОбъемНачислений.ИзменятьВзаиморасчеты)";
		
	Результат 						= Запрос.Выполнить();

	Возврат  Результат;
КонецФункции

Функция РезультатТочкиУчетаСНулевымРасходом(Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсходныеДанныеНабора.Организация КАК Организация,
	|	ИсходныеДанныеНабора.ПериодНачисления КАК ПериодНачисления,
	|	ИсходныеДанныеНабора.Район КАК Район,
	|	ИсходныеДанныеНабора.Абонент КАК Абонент,
	|	ИсходныеДанныеНабора.Услуга КАК Услуга,
	|	ИсходныеДанныеНабора.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ДанныеНабораОбъемНачислений КАК ИсходныеДанныеНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсходныеДанныеНабора.Организация КАК Организация,
	|	ИсходныеДанныеНабора.ПериодНачисления КАК ПериодНачисления,
	|	ИсходныеДанныеНабора.Район КАК Район,
	|	ИсходныеДанныеНабора.Абонент КАК Абонент,
	|	ИсходныеДанныеНабора.Услуга КАК Услуга,
	|	ИсходныеДанныеНабора.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ УдаленныеНезначащиеЗаписи
	|ИЗ
	|	&УдаленныеЗаписи КАК ИсходныеДанныеНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Регистратор КАК ДокРегистратор,
	|	УдаленныеНезначащиеЗаписи.Организация КАК Организация,
	|	УдаленныеНезначащиеЗаписи.ПериодНачисления КАК ПериодНачисления,
	|	УдаленныеНезначащиеЗаписи.Район КАК Район,
	|	УдаленныеНезначащиеЗаписи.Абонент КАК Абонент,
	|	УдаленныеНезначащиеЗаписи.Услуга КАК Услуга,
	|	УдаленныеНезначащиеЗаписи.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	УдаленныеНезначащиеЗаписи КАК УдаленныеНезначащиеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеДанные КАК ИсходныеДанные
	|		ПО УдаленныеНезначащиеЗаписи.Организация = ИсходныеДанные.Организация
	|			И УдаленныеНезначащиеЗаписи.ПериодНачисления = ИсходныеДанные.ПериодНачисления
	|			И УдаленныеНезначащиеЗаписи.Район = ИсходныеДанные.Район
	|			И УдаленныеНезначащиеЗаписи.Абонент = ИсходныеДанные.Абонент
	|			И УдаленныеНезначащиеЗаписи.Услуга = ИсходныеДанные.Услуга
	|			И УдаленныеНезначащиеЗаписи.ТочкаУчета = ИсходныеДанные.ТочкаУчета
	|ГДЕ
	|	ИсходныеДанные.Организация ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);		
	Запрос.УстановитьПараметр("ДанныеНабораОбъемНачислений", ДополнительныеСвойства.тзНаборЗаписей);
	Запрос.УстановитьПараметр("УдаленныеЗаписи", ДополнительныеСвойства.УдаленныеЗаписи);	
		
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
		
КонецФункции

#КонецОбласти


