#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестОперацияСПриборомУчетаНП(ЭтотОбъект, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
	
	ЗаполнитьДокумент = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) И ЗаполнитьДокумент тогда
		ЗаполнитьДанныеОбъектаРасчета();		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля();
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);

	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		СоответствиеПрибора 				= Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
			
		КонецЦикла;
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеУстановкиФормулы(ТекущийОбъект);
		
		// Узлы Учета-- Переопределил
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ); 
		// Узлы Учета-- Переопределил
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) И СтрокаТочки.ПриборУчета <> СтрокаТочки.ПриборУчетаВывод Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		мСтрокВведенныхИзмерителей = ТекущийОбъект.Измерители.НайтиСтроки(Новый Структура("Ввод", Истина)); 
		Для Каждого СтрокаИзмерителя Из мСтрокВведенныхИзмерителей Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");

	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
		
	ЗаполнитьТекстовыеПоля();
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестОперацияСПриборомУчетаНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия и ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСПриборомУчетаНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьДанныеОбъектаРасчета();
	ЗаполнитьТекстовыеПоля();
	ЗаполнитьАдресОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	
	энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	//ТаблицыФормы				= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

	//ТаблицыФормы				= Новый Массив;
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗаменаВспомогательныхПУ = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ");
	ЗаполнитьСвойстваИзмерителей(Объект);
	Если Поле.Имя = "ТочкиУчетаСредстваИзмеренияВывод" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект,"ЮЛ");
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("ЗаменаВспомогательныхПУ", ЗаменаВспомогательныхПУ);
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения,"Вывод");
	ИначеЕсли Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект,"ЮЛ");
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("Замена",Истина);
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("ЗаменаВспомогательныхПУ", ЗаменаВспомогательныхПУ);
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъектаРасчета() 
	ЗаменаВспомогательныхПУ = Объект.ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ;
	
	Документы.бестОперацияСПриборомУчетаНП.ЗаполнитьТабличныеЧастиДляАктаЗамены(Объект, ИспользоватьТарифныеЗоны, 
		ИспользоватьШкалыПриборовУчета);
	
	Если ЗаменаВспомогательныхПУ Тогда	
		Для Каждого стр из Объект.Измерители цикл 
			стр.Вывод = стр.ВспомогательноеОборудование; 
		КонецЦикла;	
	Иначе
		Для Каждого стр из Объект.Измерители цикл 
			стр.Вывод = Не стр.ВспомогательноеОборудование; 
		КонецЦикла;
		
		Для Каждого стр из Объект.ТочкиУчета цикл 
			стр.ПриборУчета = Неопределено;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#Область РаботаСУзлами

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	ДанныеОчистки = Новый Структура;
	ДанныеОчистки.Вставить("Измерители", Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	ДанныеОчистки.Вставить("ШкалыПриборовУчета", Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	ДанныеОчистки.Вставить("ПоказанияПриборовУчета", Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ,ДанныеОчистки);
	ТекСтрока = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	ТекСтрока[0].КоэффициентПУ = ПараметрыОбновления.Результат.КоэффициентПУ;
	ЗаполнитьТекстовыеПоля(ПараметрыОбновления.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоУслугамСерверВывод(ПараметрыОбновления) Экспорт 
	ДанныеОчистки = Новый Структура; 
	ОтборОчисткиИзмерителей = Новый Структура("IDСтрокиТочкиУчета,Ввод",ПараметрыОбновления.IDСтроки, Ложь);
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ Тогда
		ОтборОчисткиИзмерителей.Вставить("ВспомогательноеОборудование", Истина);
	КонецЕсли;
	ДанныеОчистки.Вставить("Измерители", ОтборОчисткиИзмерителей);
	ДанныеОчистки.Вставить("ШкалыПриборовУчета", Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Истина));
	ДанныеОчистки.Вставить("ПоказанияПриборовУчета", Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Истина));
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ,ДанныеОчистки);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", ПараметрыОбновления.IDСтроки);
	мСтрокаТУ 	= Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СтрокаТУ 	= мСтрокаТУ[0]; 
	Если СтрокаТУ.ПриборУчета = СтрокаТУ.ПриборУчетаВывод Тогда
		Для каждого стр из ПараметрыОбновления.Результат.Измерители Цикл
			Если стр.Вывод И НЕ стр.ВспомогательноеОборудование Тогда
				СтрокаТУ.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля(ПараметрыОбновления.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля(IDСтрокиТочкиУчета = Неопределено)	
	Если IDСтрокиТочкиУчета = Неопределено Тогда
		СтрокиТЧ = Объект.ТочкиУчета;
	Иначе
		СтрокиТЧ = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки",IDСтрокиТочкиУчета));
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ СтрокиТЧ Цикл
		ДанныеИзмерителейВывод = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета,Вывод", ТекСтрока.IDСтроки, Истина));
		Если ДанныеИзмерителейВывод.Количество() = 0 Тогда
			ТекСтрока.СредстваИзмеренияВывод = "Не заполнено";
		ИначеЕсли ДанныеИзмерителейВывод.Количество() = 1 Тогда
			ТекСтрока.СредстваИзмеренияВывод = ДанныеИзмерителейВывод[0].ЗаводскойНомер;
		Иначе
			ТекСтрока.СредстваИзмеренияВывод = "Заполнено";
		КонецЕсли;
		
		ДанныеИзмерителейВвод = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета,Ввод", ТекСтрока.IDСтроки, Истина));
		Если ДанныеИзмерителейВвод.Количество() = 0 Тогда
			ТекСтрока.СредстваИзмерения = "Не заполнено";
		ИначеЕсли ДанныеИзмерителейВвод.Количество() = 1 Тогда
			ТекСтрока.СредстваИзмерения = ДанныеИзмерителейВвод[0].ЗаводскойНомер;
		Иначе
			ТекСтрока.СредстваИзмерения = "Заполнено";
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		//ДанныеТочкиУчета 									= Новый Структура(бестРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваТочекУчета());
		//СоотвествиеРеквизитов 								= бестРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		//Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
		//	ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		//КонецЦикла; 		
		//ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти