#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ответственного по ключу помещения.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи.
//
Функция ПолучитьОтветственногоПоКлючуПомещения(КлючПомещения) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение
		|ПОМЕСТИТЬ ВТ_Строение
		|ИЗ
		|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Ссылка = &КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестОтветственныйПИРСрезПоследних.Строение КАК Строение,
		|	бестОтветственныйПИРСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.бестОтветственныйПИР.СрезПоследних(
		|			,
		|			Строение В
		|				(ВЫБРАТЬ
		|					ВТ_Строение.Строение КАК Строение
		|				ИЗ
		|					ВТ_Строение КАК ВТ_Строение)) КАК бестОтветственныйПИРСрезПоследних";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ответственный;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции

#КонецОбласти

#КонецЕсли