
#Область ОбработкаКомандФормы

&НаКлиенте
Процедура УстановитьЗапретРедактирования(Команда)
	ОткрытьФорму("Документ.бестЗапретРедактированияДоговораКонтрагента.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗапретРедактирования(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.бестЗапретРедактированияДоговораКонтрагента.Форма.ФормаДокумента", Новый Структура("Ключ", ТекСтрока.Регистратор));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗапретРедактирования(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.бестЗапретРедактированияДоговораКонтрагента.Форма.ФормаДокумента", Новый Структура("ЗначениеКопирования", ТекСтрока.Регистратор));
КонецПроцедуры

#КонецОбласти