#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Рассчитать коэффициент ПУ по данным трансформаторов
//
// Параметры:
//  ТипыПУ - Массив - массив ссылок на справочник энргТипыПриборовУчета
// 
// Возвращаемое значение:
//   Число - коэффициент ПУ
//
Функция РассчитатьКоэффициентПУПоДаннымТрансформаторов(ТипыПУ) Экспорт
	
	Результат = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(энргМаркиПриборовУчета.ТипСИ, ЗНАЧЕНИЕ(Перечисление.энргТипыСИ.ПУ)) КАК ТипСИ,
	                      |	энргТипыПриборовУчета.Ссылка КАК ТипПрибораУчета,
	                      |	энргТипыПриборовУчета.I1 КАК I1,
	                      |	энргТипыПриборовУчета.I2 КАК I2,
	                      |	энргТипыПриборовУчета.U1 КАК U1,
	                      |	энргТипыПриборовУчета.U2 КАК U2
	                      |ПОМЕСТИТЬ ВТ_ТипыСИ
	                      |ИЗ
	                      |	Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
	                      |		ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
	                      |ГДЕ
	                      |	энргТипыПриборовУчета.Ссылка В(&МассивТипПУ)
	                      |	И ЕСТЬNULL(энргМаркиПриборовУчета.ТипСИ, ЗНАЧЕНИЕ(Перечисление.энргТипыСИ.ПУ)) В (&МассивТипСИ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.I1), 0) КАК I1,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.I2), 0) КАК I2,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.U1), 0) КАК U1,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.U2), 0) КАК U2
	                      |ИЗ
	                      |	ВТ_ТипыСИ КАК ВТ_ТипыСИ");
	
	Запрос.УстановитьПараметр("МассивТипПУ", ТипыПУ);  
	ТипыСИ = Новый Массив;
	ТипыСИ.Добавить(Перечисления.энргТипыСИ.ТТ);
	ТипыСИ.Добавить(Перечисления.энргТипыСИ.ТН);
	Запрос.УстановитьПараметр("МассивТипСИ", ТипыСИ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.U1 <> 0 И Выборка.U2 <> 0 И Выборка.I1 <> 0 И Выборка.I2 <> 0 Тогда
		Результат = (Выборка.U1 / Выборка.U2) * (Выборка.I1 / Выборка.I2);
	ИначеЕсли Выборка.I1 <> 0 И Выборка.I2 <> 0 Тогда
		Результат = Выборка.I1 / Выборка.I2;
	ИначеЕсли Выборка.U1 <> 0 И Выборка.U2 <> 0 Тогда
		Результат = Выборка.U1 / Выборка.U2;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли