#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	ПроверяемыеРеквизиты.Добавить("бестМежповерочныйИнтервал");
	
	ТипСИ = Справочники.энргМаркиПриборовУчета.ПолучитьТипСИ(МаркаПУ);
	
	Если ТипСИ = Перечисления.энргТипыСИ.ТТ
		Или ТипСИ = Перечисления.энргТипыСИ.ТН Тогда 
		
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("РазрядностьДоЗапятой");
		НепроверяемыеРеквизиты.Добавить("РазрядностьПослеЗапятой");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты ,НепроверяемыеРеквизиты);	
		
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли