
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Задача", 	Задача);
	Параметры.Свойство("ИмяМакета", ИмяМакета);
	Параметры.Свойство("Этап",		Этап);
	
	Справочники.энргВидыОперацийПИД.СформироватьПечатнуюФормуЭтапа(Задача, ИмяМакета, ТабДок);
	Заголовок = Задача.Этап.Наименование;
	
	Элементы.ФормаОтправитьНаПочту.Видимость = Документы.энргСобытие.ОтправкаЭлектроннойПочтыДоступна(Задача.Абонент, Задача.Район);
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтправитьНаПочтуНаСервере()
	ТипСобытия = ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту");
	
	Возврат Документы.энргСобытие.СоздатьИВыполнитьСобытиеНаОсновеЗадачи(Задача, ТипСобытия);
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
	Если ОтправитьНаПочтуНаСервере() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Письмо отправлено.");
		Оповестить("УстановитьДатуЭП");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти